[
  {
    "title": "GE CARESCAPE Canvas – Will Not Power On",
    "description": "Basic power troubleshooting for a GE CARESCAPE Canvas patient monitor.",
    "assetType": "Patient Monitor",
    "manufacturer": "GE Healthcare",
    "model": "CARESCAPE Canvas",
    "url": "ge-carescape-canvas-power.html",
    "dateAdded": "2026-02-10",
    "steps": [
      {
        "title": "Make Sure the Monitor Has Power",
        "instructions": [
          "Confirm the monitor is plugged into an outlet that you know is working.",
          "If unsure, plug in another device (lamp, phone charger, etc.) to test the outlet.",
          "If the monitor is plugged into a power strip or isolation transformer, make sure that device is also turned on."
        ]
      },
      {
        "title": "Check the Power Cord",
        "instructions": [
          "Look over the power cord for cuts, fraying, bent or broken prongs.",
          "Make sure the cord is pushed in firmly at the wall outlet and back of the monitor."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Monitor will not power on.",
        "Cause": "Monitor shows no power with known-working outlet and known-good power cord. No indicator lights or screen activity observed. Suspected internal power failure.",
        "Resolution": "Removed from service and sent for repair."
      },
      "helpfulDetails": [
        "Outlet tested: yes / no",
        "Power cord swapped: yes / no",
        "Indicator light behavior",
        "Any sounds (fan, clicking, none)",
        "Any unusual smell or heat",
        "Final status (returned to service or sent for repair)"
      ]
    }
    },
    {
  "title": "ZOLL R Series – Printer Not Printing / Paper Jam (Thermal Paper)",
  "description": "Troubleshooting for ZOLL R Series defibrillator when the printer will not print or reports a paper jam using thermal paper.",
  "assetType": "Defibrillator",
  "manufacturer": "ZOLL",
  "model": "R Series",
  "url": "zoll-r-series-printer.html",
  "dateAdded": "2026-02-11",
  "steps": [
    {
      "title": "Check the Paper Stack",
      "instructions": [
        "Ensure there is a paper stack loaded in the printer’s tray.",
        "Confirm the leading edge of the top sheet is correctly positioned in the feed mechanism.",
        "Replace the stack if it is empty, wrinkled, or damaged.",
        "Note: Thermal paper is sensitive to heat, pressure, and folds. Crumpled or old paper may not feed properly or print."
      ]
    },
    {
      "title": "Inspect for Paper Jams",
      "instructions": [
        "Open the printer cover and remove any misfed or stuck sheets.",
        "Look for small bits of torn paper or debris blocking the feed path.",
        "Ensure the feed path is clear before closing the cover.",
        "Thermal paper jams can occur if the stack is compressed too tightly or the edges are bent."
      ]
    },
    {
      "title": "Verify Printer Cover is Closed Properly",
      "instructions": [
        "The printer will not operate if the cover is not fully closed.",
        "Close the printer cover until it clicks into place."
      ]
    },
    {
      "title": "Try a Known-Good Thermal Paper Stack (If Available)",
      "instructions": [
        "If the printer still fails to print, replace the current stack with a new, known-good thermal paper stack.",
        "Attempt a test print or generate a report from the device."
      ]
    },
    {
      "title": "Observe the Device Display",
      "instructions": [
        "Note exactly what the display or status indicator shows: “Paper Jam”, “Printer Error”, or “Insert Paper”.",
        "Record the message for documentation and trend tracking."
      ]
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Printer will not print / paper jam.",
      "Cause": "Paper stack loaded and properly seated, but printer still displays jam error. Paper cleared and cover closed. Suspected printer mechanism or thermal feed issue.",
      "Resolution": "Replaced thermal paper stack and cleared feed path; printer now functional."
    },
    "helpfulDetails": [
      "Paper stack loaded correctly and in good condition: yes / no",
      "Jam cleared: yes / no",
      "Printer cover closed: yes / no",
      "Test print performed: yes / no",
      "Display message",
      "Final status (returned to service or sent for repair)"
    ]
  }
},
    {
    "title": "ZOLL R Series – Pads Not Detected / Therapy Cable Failure",
    "description": "Troubleshooting for ZOLL R Series defibrillator when pads are not detected, often due to a therapy cable failure.",
    "assetType": "Defibrillator",
    "manufacturer": "ZOLL",
    "model": "R Series",
    "url": "zoll-r-series-pads-cable.html",
    "dateAdded": "2026-02-11",
    "steps": [
      {
        "title": "Check That the Pads Are Connected Properly",
        "instructions": [
          "Ensure both therapy pads are securely attached to the therapy cable.",
          "Confirm the pads are fully inserted into the connector port on the defibrillator.",
          "Loose connections can prevent the device from recognizing the pads."
        ]
      },
      {
        "title": "Inspect the Pads and Cable for Damage",
        "instructions": [
          "Look for cracked or torn pads, exposed wires, frayed or twisted cable.",
          "Replace pads or cable if any visible damage is present.",
          "Even small damage can cause the device to detect a failure."
        ]
      },
      {
        "title": "Try a Known-Good Pad Set or Cable (If Available)",
        "instructions": [
          "Remove the current pads or therapy cable and connect a known-good set.",
          "Observe if the defibrillator recognizes them correctly.",
          "This helps determine whether the issue is with the cable, pads, or device itself."
        ]
      },
      {
        "title": "Observe the Device Display",
        "instructions": [
          "Note exactly what the display or status indicator shows: “Pads Not Detected” or “Therapy Cable Failure”.",
          "Pay attention to whether the message appears immediately or intermittently.",
          "Even small details help identify intermittent cable or connector issues."
        ]
      },
      {
        "title": "Check Pad Expiration",
        "instructions": [
          "Verify that the pads are within their expiration date.",
          "Expired pads may not properly connect or be recognized by the device."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Defibrillator reports pads not detected / therapy cable failure.",
        "Cause": "Pads and cable inspected, no visible damage. Tested with known-good pads/cable: issue resolved. Suspected faulty therapy cable.",
        "Resolution": "Removed faulty cable/pads from service and replaced with known-good set."
      },
      "helpfulDetails": [
        "Pads/cable reseated: yes / no",
        "Pads/cable inspected for damage: yes / no",
        "Alternate pads/cable tested: yes / no",
        "Device display message",
        "Expiration date of pads",
        "Final status (returned to service or sent for repair)"
      ]
    }
  },
  {
    "title": "ZOLL R Series – Battery Fails Self-Test",
    "description": "Basic battery troubleshooting for a ZOLL R Series defibrillator reporting a failed self-test.",
    "assetType": "Defibrillator",
    "manufacturer": "ZOLL",
    "model": "R Series",
    "url": "zoll-r-series-battery-self-test.html",
    "dateAdded": "2026-02-11",
    "steps": [
      {
        "title": "Make Sure the Battery Is Fully Seated",
        "instructions": [
          "Confirm the battery is installed correctly in the defibrillator.",
          "Remove the battery and reinsert it, making sure it clicks or seats firmly into place.",
          "A loose battery can cause self-test failures even if the battery itself is good."
        ]
      },
      {
        "title": "Check the Battery Contacts",
        "instructions": [
          "Inspect the battery and device contacts for dirt or debris.",
          "Look for corrosion or bent or damaged pins.",
          "If safe to do so, gently clean visible debris from the contacts and reinsert the battery.",
          "Poor contact between the battery and device can cause charging and self-test issues."
        ]
      },
      {
        "title": "Verify the Battery Has Been Charging",
        "instructions": [
          "Confirm the defibrillator has been plugged into AC power when stored.",
          "Check for any charging or status indicators that show the battery has been receiving power.",
          "A battery that has not been charging may fail self-test due to low capacity."
        ]
      },
      {
        "title": "Try a Known-Good Battery (If Available)",
        "instructions": [
          "Remove the current battery and insert a known-good battery from another unit.",
          "Allow the unit to complete its self-test again.",
          "This helps determine whether the issue is with the battery or the defibrillator itself."
        ]
      },
      {
        "title": "Observe the Self-Test Message or Indicator",
        "instructions": [
          "Note exactly what the display or status indicator shows.",
          "Does it say \"Battery Fail\"?",
          "Does it say \"Replace Battery\"?",
          "Does it fail immediately or after charging?",
          "Even small details can help determine the cause."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Defibrillator reports battery failed self-test.",
        "Cause": "Battery fails self-test after reseating and charging. Alternate battery passes self-test. Suspected failed battery pack.",
        "Resolution": "Removed battery from service and replaced with known-good battery."
      },
      "helpfulDetails": [
        "Battery reseated: yes / no",
        "Contacts inspected: yes / no",
        "Alternate battery tested: yes / no",
        "Self-test message displayed",
        "Any unusual heat or swelling",
        "Final status (battery replaced or sent for repair)"
      ]
    }
  },
  {
    "title": "GE B850 – Will Not Power On",
    "description": "Basic power troubleshooting for a GE B850 patient monitor.",
    "assetType": "Patient Monitor",
    "manufacturer": "GE Healthcare",
    "model": "B850",
    "url": "ge-b850-power.html",
    "dateAdded": "2026-02-11",
    "steps": [
      {
        "title": "Make Sure the Monitor Has Power",
        "instructions": [
          "Confirm the monitor is plugged into an outlet that you know is working.",
          "If unsure, plug in another device (lamp, phone charger, etc.) to test the outlet.",
          "If the monitor is plugged into a power strip or isolation transformer, make sure that device is also turned on."
        ]
      },
      {
        "title": "Check the Power Cord",
        "instructions": [
          "Look over the power cord for cuts, fraying, bent or broken prongs.",
          "Make sure the cord is pushed in firmly at the wall outlet and back of the monitor."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Monitor will not power on.",
        "Cause": "Monitor shows no power with known-working outlet and known-good power cord. No indicator lights or screen activity observed. Suspected internal power failure.",
        "Resolution": "Removed from service and sent for repair."
      },
      "helpfulDetails": [
        "Outlet tested: yes / no",
        "Power cord swapped: yes / no",
        "Indicator light behavior",
        "Any sounds (fan, clicking, none)",
        "Any unusual smell or heat",
        "Final status (returned to service or sent for repair)"
      ]
    }
  }
  ,
  {
    "title": "Baxter Sigma Spectrum Infusion Pump – Occlusion Alarm / Will Not Start Infusion",
    "description": "Basic troubleshooting when a Sigma Spectrum infusion pump shows an occlusion alarm and will not start infusion.",
    "assetType": "Infusion Pump",
    "manufacturer": "Baxter",
    "model": "Sigma Spectrum",
    "url": "baxter-sigma-spectrum-occlusion.html",
    "dateAdded": "2026-02-10",
    "steps": [
      {
        "title": "Check the IV Set and Tubing",
        "instructions": [
          "Make sure the tubing is properly loaded into the pump.",
          "Confirm there are no kinks, twists, or sharp bends in the line.",
          "Check that clamps are fully open and not blocking fluid flow.",
          "Even a small pinch or bend can trigger an occlusion alarm."
        ]
      },
      {
        "title": "Inspect the Pump Door and Cassette",
        "instructions": [
          "Ensure the cassette or disposable set is seated correctly.",
          "Close the door fully — the pump may not start if it senses the door is ajar.",
          "Some alarms are triggered if the cassette isn’t aligned properly."
        ]
      },
      {
        "title": "Check the Fluid Bag or Syringe",
        "instructions": [
          "Make sure there is fluid in the bag or syringe.",
          "Confirm that the tubing is primed — air in the line can sometimes trigger an occlusion alarm."
        ]
      },
      {
        "title": "Observe the Pump Display and Alarm",
        "instructions": [
          "Look for any other messages on the display.",
          "Note the color and type of alarm: Red = occlusion, Yellow = warning / low fluid.",
          "Record what you see — this helps when documenting."
        ]
      },
      {
        "title": "Try a Simple Reset",
        "instructions": [
          "Stop the pump.",
          "Remove and reload the tubing.",
          "Close the door and restart the pump.",
          "If the alarm clears, the pump may resume infusion. If not, escalate."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Pump will not start infusion; occlusion alarm displayed.",
        "Cause": "Tubing and cassette inspected, tubing free of kinks, door fully closed, fluid present. Alarm persists. Suspected internal pump sensor issue.",
        "Resolution": "Removed pump from service, labeled out of service, sent for repair or tagged for bench evaluation."
      },
      "helpfulDetails": [
        "Tubing checked / replaced",
        "Door/cassette reseated",
        "Fluid bag checked / primed",
        "Alarm cleared / persisted",
        "Any unusual sounds or display behavior",
        "Final disposition (returned to service or sent for repair)"
      ]
    }
  }
]
