[
     {
  "title": "Verathon Prime Plus Bladder Scanner - Touchscreen / Display Issues",
  "description": "Structured Clinical Engineering steps for troubleshooting touchscreen and display issues on the Verathon Prime Plus bladder scanner, focusing on external checks before assuming internal failure.",
  "assetType": "Bladder Scanner",
  "manufacturer": "Verathon",
  "model": "Prime Plus",
  "url": "guides/verathon-prime-plus-touchscreen.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Power Check",
      "instructions": "Confirm the device is fully charged or connected to AC power.\nVerify the battery status indicator is normal.\nWhy: A low battery or intermittent power can cause touchscreen responsiveness issues or blank screens."
    },
    {
      "title": "Inspect Cables and Connectors",
      "instructions": "Check for loose or damaged AC adapters, docking station connectors, and probe connections.\nRe-seat all cables securely.\nWhy: Loose connections can prevent the display from initializing correctly."
    },
    {
      "title": "Clean the Touchscreen",
      "instructions": "Use a soft, lint-free cloth dampened with water or approved screen cleaner.\nAvoid abrasive materials or excessive moisture.\nWhy: Oils, dirt, or debris can block touch input or create ghost touches."
    },
    {
      "title": "Restart the Device",
      "instructions": "Power off completely, wait 10–15 seconds, then power on.\nObserve the display during boot for abnormalities.\nWhy: Temporary software glitches often resolve with a restart."
    },
    {
      "title": "Check for Physical Damage",
      "instructions": "Inspect the touchscreen for cracks, deep scratches, or liquid ingress.\nWhy: Physical damage can permanently affect touchscreen performance or display visibility."
    },
    {
      "title": "Test in Alternate Settings",
      "instructions": "Use a different AC outlet or battery pack if available.\nTry a known-good docking station or cable.\nWhy: Confirms whether the issue is with the scanner or its external power interface."
    },
    {
      "title": "Soft Reset / Factory Reset (if applicable and safe)",
      "instructions": "Only perform if safe and documented according to manufacturer guidelines.\nWhy: Corrupted settings can cause display or touch issues."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "Common external causes have been ruled out.\nThe device should be removed from service, labeled Out of Service, sent to Verathon-approved repair or internal bench evaluation.\nNote: Knowing when to stop is proper troubleshooting; avoid internal repairs beyond your scope."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Touchscreen is unresponsive or display intermittently blank.\nExample: “Display freezes when attempting to select patient profile; touchscreen does not respond to input.”",
      "Cause": "Observed: Device fully charged, cables intact, screen clean, but unresponsive; no physical damage noted.\nExample: Suspected internal touchscreen controller or display issue after external checks.",
      "Resolution": "Action taken: Device removed from service, labeled Out of Service, sent for manufacturer evaluation.\nExample: “Prime Plus scanner returned to Biomedical Engineering for vendor repair; patient scanned using alternate device.”"
    }
  },
  "helpfulDetails": [
    "Battery charge level at the time of issue",
    "Any recent drops or liquid exposure",
    "Device software version",
    "Response to restart or reset",
    "Any error codes displayed",
    "Docking station or cable used"
  ]
},
        {
  "title": "Verathon Prime Plus Bladder Scanner – Inaccurate Bladder Volume Readings",
  "description": "Structured Clinical Engineering guide for troubleshooting inaccurate bladder volume readings on the Verathon Prime Plus scanner, focusing on external, easily verifiable causes.",
  "assetType": "Bladder Scanner",
  "manufacturer": "Verathon",
  "model": "Prime Plus",
  "url": "guides/verathon-prime-plus-inaccurate-volume.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Check Battery and Power Status",
      "instructions": "Ensure the device is fully charged or connected to power. Low battery can affect probe signal processing."
    },
    {
      "title": "Verify Probe and Cable Connection",
      "instructions": "Inspect the ultrasound probe for secure connection to the scanner.\nLook for visible damage to the probe cable or connector."
    },
    {
      "title": "Inspect Probe Surface",
      "instructions": "Check for cracks, debris, or dried gel on the probe face.\nClean gently with approved disinfectant wipes."
    },
    {
      "title": "Confirm Correct Patient Positioning",
      "instructions": "Patient should be supine, bladder midline, legs slightly bent.\nInaccurate readings often occur if patient is leaning or moving."
    },
    {
      "title": "Ensure Adequate Ultrasound Gel Application",
      "instructions": "Apply sufficient gel to allow full contact between probe and skin.\nAir gaps reduce signal quality and volume accuracy."
    },
    {
      "title": "Check Device Settings",
      "instructions": "Verify correct gender selection (male/female) and patient type (adult/pediatric).\nEnsure the scanner mode is set to “Bladder Scan” and not other preset modes."
    },
    {
      "title": "Perform a Test Scan on a Known Volume Phantom (if available)",
      "instructions": "Confirms the scanner and probe are reading correctly outside of patient variability."
    },
    {
      "title": "Repeat Scan Carefully",
      "instructions": "Perform 2–3 consecutive scans, noting any variability.\nSmall movements or probe angle changes can affect readings."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "External causes have been ruled out (positioning, gel, settings, probe condition).\nThe device should be removed from service, labeled Out of Service, and sent for Verathon service or bench evaluation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Reported inaccurate bladder volume readings.\nExample: “Scanner reads 150 mL when catheterization shows 300 mL.”",
      "Cause": "Observed misalignment of probe, insufficient gel, or device settings mismatch.\nExample: “Probe was not centered on bladder; patient slightly rotated.”",
      "Resolution": "Actions taken to correct: checked connections, cleaned probe, reapplied gel, repeated scan.\nExample: “Scanner cleaned, settings verified, repeated scan with proper positioning; readings remained inconsistent, device removed from service and labeled OOS.”"
    }
  },
  "helpfulDetails": [
    "Patient position during scan",
    "Gel type and amount applied",
    "Number of scan attempts and variability",
    "Probe and cable condition",
    "Device battery or power status",
    "Device software version",
    "Final device status (e.g., OOS, sent for service)"
  ]
},
        {
  "title": "Verathon Prime Plus Bladder Scanner – Probe / Transducer Error",
  "description": "Structured Clinical Engineering troubleshooting for probe or transducer errors on the Verathon Prime Plus bladder scanner.",
  "assetType": "Bladder Scanner",
  "manufacturer": "Verathon",
  "model": "Prime Plus",
  "url": "guides/verathon-prime-plus-probe.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Power Cycle the Device",
      "instructions": "Turn the scanner off, wait 10–15 seconds, and turn it back on. Rationale: Clears temporary software glitches that may trigger false probe errors."
    },
    {
      "title": "Inspect the Probe Cable",
      "instructions": "Check for visible cuts, kinks, or frayed wires along the cable. Ensure connectors are fully seated in the scanner port. Rationale: Loose or damaged cables are the most common cause of transducer errors."
    },
    {
      "title": "Clean the Probe and Connector",
      "instructions": "Use manufacturer-approved cleaning wipes or solutions. Remove any gel residue or debris from the probe tip and connector pins. Rationale: Dirt or residual gel can interfere with ultrasound signal transmission."
    },
    {
      "title": "Swap the Probe (If Available)",
      "instructions": "Connect a known-good probe to the scanner. Rationale: Confirms whether the error is with the probe or the scanner itself."
    },
    {
      "title": "Verify Software / Firmware Status",
      "instructions": "Check the device screen for firmware version and error logs. Apply any manufacturer-recommended updates if safely possible. Rationale: Some probe errors may be triggered by outdated software."
    },
    {
      "title": "Check Environmental Factors",
      "instructions": "Ensure the scanner is not exposed to extreme temperatures or moisture. Rationale: Ultrasound transducers can be sensitive to environmental conditions."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "All external and easily verifiable causes have been ruled out. Label the device Out of Service. Remove it from patient care and escalate for vendor repair or bench evaluation. Knowing when to stop and escalate is a key part of proper troubleshooting."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Device reports “Probe Error” or “Transducer Error.” Example: “User reported intermittent probe error during catheter volume scan.”",
      "Cause": "Observed issues with probe cable, connectors, or probe contamination. Example: “Probe connector pins were dirty, or cable showed minor fraying.”",
      "Resolution": "Cleaned probe and connector, reseated cable, power-cycled device. Tested with a known-good probe. Device returned to service or labeled Out of Service if error persisted. Example: “After cleaning and power cycle, error resolved with same probe. Device returned to service.”"
    }
  },
  "helpfulDetails": [
    "Cable integrity check (any kinks or cuts)",
    "Probe tip condition (gel residue, scratches)",
    "Connector pins (clean and fully seated)",
    "Error message wording / code",
    "Device firmware version",
    "Final device status (in service, out of service)"
  ]
},
        {
  "title": "Verathon Prime Plus Bladder Scanner – Fails to Power On / Shuts Off",
  "description": "Structured Clinical Engineering approach to troubleshoot a Verathon Prime Plus bladder scanner that does not power on or shuts off unexpectedly.",
  "assetType": "Bladder Scanner",
  "manufacturer": "Verathon",
  "model": "Prime Plus",
  "url": "guides/verathon-prime-plus-power.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Ensure Patient Is Safe & Device Is Not In Use",
      "instructions": "If the scanner is in active use on a patient, finish the exam safely or switch to a standby device before troubleshooting."
    },
    {
      "title": "Verify External Power Source",
      "instructions": "If connected to AC power, confirm the outlet has power using a known working device or outlet tester. Inspect the power adapter for correct model, visible damage, frayed wires, bent pins, or debris. Ensure the adapter is fully seated in both the device and the wall outlet/UPS/power strip."
    },
    {
      "title": "Check Battery and Battery Contacts",
      "instructions": "If operating on battery, remove the battery module and inspect contacts for corrosion, dirt, or misalignment. Reinsert the battery making sure it locks into place. If a spare battery is available, try swapping to determine if the battery is the cause."
    },
    {
      "title": "Examine Power Button & Physical Interface",
      "instructions": "Press and hold the power button a few seconds. Confirm the button isn’t stuck or physically damaged. Observe any LED indicators or display backlight activity when pressing power."
    },
    {
      "title": "Look for Power Indicator Behavior",
      "instructions": "If lights flicker briefly or the screen attempts to light then shuts down, this may suggest insufficient power from either the battery or adapter."
    },
    {
      "title": "Test With Minimal Connections",
      "instructions": "Remove any unnecessary peripherals (printers, carts with other equipment, docking stations) and try powering on with just the essential power connection."
    },
    {
      "title": "Observe for Overheating or Unusual Symptoms",
      "instructions": "Feel for excessive heat at the power supply, battery, or scanner casing. Listen for unusual sounds (buzzing, fan noise) that could indicate internal issues."
    },
    {
      "title": "Basic Reset (If Applicable)",
      "instructions": "Some devices have a reset function (consult quick start/reference sheet only — do not open the device). Perform a reset if documented and external."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "After completing the above external checks (power source, battery, cables, power switch, basic reset), internal causes remain likely. At this point: Remove the device from clinical service. Label the device Out of Service. Send for manufacturer service or internal bench evaluation. Do not attempt internal board repairs or disassembly beyond what the user manual specifies for battery and cables."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bladder scanner fails to power on or shuts off shortly after powering.",
      "Cause": "Observed no power at outlet with tester; power adapter barrel connection loose; battery contacts showed corrosion; device attempt to start but immediately loses power.",
      "Resolution": "Verified outlet with tester; replaced power adapter with known good unit; cleaned battery contacts; confirmed device powers on and remains stable. End user tested functionality and confirmed normal operation. (If the device still fails, note that it was taken out of service and refer to manufacturer service in the resolution.)"
    }
  },
  "helpfulDetails": [
    "Outlet tested and outcome",
    "Power adapter model and whether swapped",
    "Battery ID and test results",
    "LED or display behavior during power attempts",
    "Any signs of physical damage, unusual heat, or sounds",
    "Final device status (Operational, OOS)"
  ]
}
]
