[
  {
  "title": "GE CARESCAPE Canvas Monitor – Power Issue",
  "description": "Structured Clinical Engineering guide for a GE CARESCAPE Canvas monitor that will not power on.",
  "assetType": "Patient Monitor",
  "manufacturer": "GE Healthcare",
  "model": "CARESCAPE Canvas",
  "url": "ge-carescape-canvas-power.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the monitor is in clinical use: Transfer the patient to a functioning monitor first. Do not troubleshoot while the monitor is actively required for patient care. Confirm the device is safe to remove from service before proceeding."
    },
    {
      "title": "Verify AC Power at the Outlet",
      "instructions": "Confirm the monitor is connected to a known-working hospital-grade outlet. Test the outlet with a known-good device (lamp, outlet tester, etc.). If plugged into a power strip, isolation transformer, or UPS, verify that device is powered on and functioning. If available, try a different known-working wall outlet. Why this matters: Loss of upstream power is the most common and simplest cause of a “dead” monitor."
    },
    {
      "title": "Inspect and Reseat the Power Cord",
      "instructions": "Visually inspect the power cord for cuts or fraying, bent or damaged prongs, and loose connector ends. Reseat the cord firmly at the wall outlet and the rear AC inlet of the monitor. If available, swap with a known-good hospital-grade power cord and attempt to power on again. Why this matters: A loose or internally failed cord can mimic total device failure."
    },
    {
      "title": "Confirm the Rear Power Switch Position",
      "instructions": "Verify the rear power rocker switch is in the ON position. Then press the front power button. Do not assume the switch position without physically checking it."
    },
    {
      "title": "Observe for Any Signs of Activity",
      "instructions": "When attempting to power on, closely observe front LED indicators, brief screen flash, audible fan noise, or clicking sounds. Even minimal activity suggests partial power presence and helps narrow down whether the failure is complete or localized."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the monitor shows no indicator lights, no fan noise, no display activity, and no response with known-good outlet and power cord, then common external causes have been ruled out. At this point, the issue is likely internal (power supply board, internal fuse, or power distribution failure). Remove the monitor from service, label clearly as Out of Service, and send for repair or bench evaluation. Knowing when to stop prevents unnecessary downtime and protects patient safety. Escalation after logical checks is proper troubleshooting."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor will not power on.",
      "Cause": "Unit does not power on with known-working outlet and known-good power cord. Rear switch verified ON. No indicator lights, fan noise, or display activity observed. Suspected internal power supply failure.",
      "Resolution": "Removed from service and tagged Out of Service. Sent to Biomed shop for bench evaluation. Dispatched for vendor repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested (yes/no)",
    "Alternate outlet attempted",
    "Power cord swapped (yes/no)",
    "Rear switch position confirmed",
    "Indicator light behavior",
    "Fan noise present/absent",
    "Any unusual odor or heat",
    "Final device status (returned to service or sent for repair)"
  ]
},
    {
  "title": "GE Healthcare MAC VU360 – Leads Not Detected / Noisy ECG",
  "description": "Structured ECG troubleshooting for lead-off messages and noisy waveform conditions.",
  "assetType": "Electrocardiograph (EKG) Machine",
  "manufacturer": "GE Healthcare",
  "model": "MAC VU360",
  "url": "ge-mac-vu360-leads-noisy-ecg.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Check Electrode Placement and Skin Prep",
      "instructions": "Ensure electrodes are positioned according to standard ECG guidelines. Confirm the patient’s skin is clean, dry, and free of oils or lotion. If necessary, gently prep the skin to improve adhesion. Replace any dried, expired, or loose electrodes."
    },
    {
      "title": "Inspect Lead Wires and Connections",
      "instructions": "Verify each lead wire is firmly snapped onto the electrode. Check for loose, bent, or damaged connectors. Inspect the patient cable for cracks, exposed wires, or signs of strain. Confirm the trunk cable is securely connected to the device."
    },
    {
      "title": "Reduce Electrical Interference",
      "instructions": "Route ECG cables away from power cords and other electrical equipment. Ensure the patient is not touching metal surfaces. Minimize cable looping or tangling."
    },
    {
      "title": "Confirm Proper Lead Selection",
      "instructions": "Verify the correct lead set configuration (3-lead, 5-lead, or 10-lead). Ensure the selected mode matches the cable type in use."
    },
    {
      "title": "Test with Known-Good Cable",
      "instructions": "Swap the patient cable with a verified, known-good cable if available. Reconnect electrodes and reassess waveform quality."
    },
    {
      "title": "Perform Simulator Test",
      "instructions": "Connect an ECG simulator and run a standard rhythm simulation. If the waveform is stable and clear, the issue is likely external (electrodes or cable). If the simulator tracing remains noisy or leads are not detected, suspect an internal problem."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If leads remain undetected or the ECG remains noisy after completing the above steps, the issue may involve the patient cable assembly or internal acquisition board. Remove the unit from service. Label as Out of Service. Send for further diagnostic evaluation. Knowing when to stop is an essential part of proper troubleshooting."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Example: “Multiple leads not detected and ECG waveform very noisy.”",
      "Cause": "Example: “Loose/dried electrodes and intermittent patient cable connection causing lead-off detection and artifact.”",
      "Resolution": "“Replaced electrodes and secured cable connections. Tested with simulator — unit operating normally.” “Failed simulator test. Removed from service for further evaluation.”"
    }
  },
  "helpfulDetails": [
    "Electrode condition and type",
    "Cable and connector condition",
    "Simulator test results",
    "Specific leads affected",
    "Final device status"
  ]
},
    {
  "title": "GE MAC VU360 – Printer Issue – Not Printing / Poor Print Quality",
  "description": "Structured troubleshooting for a GE MAC VU360 ECG machine experiencing printer failures or poor print quality.",
  "assetType": "Electrocardiograph (EKG) Machine",
  "manufacturer": "GE Healthcare",
  "model": "MAC VU360",
  "url": "ge-mac-vu360-printer.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the device is actively being used for patient testing, complete or transfer the study to another ECG machine before troubleshooting. Do not disassemble or manipulate the printer while connected to a patient."
    },
    {
      "title": "Confirm Printer Is Enabled",
      "instructions": "Access the system menu and verify the internal printer function is enabled. If disabled, enable the printer and initiate a controlled print test. This rules out configuration-related causes."
    },
    {
      "title": "Verify Paper Type and Installation",
      "instructions": "Open the printer compartment and confirm: Correct thermal ECG paper is installed. Paper is loaded in the proper orientation. Paper is not curled, faded, or contaminated. Thermal printers require proper paper orientation; incorrect loading will result in blank output."
    },
    {
      "title": "Inspect Paper Path and Compartment",
      "instructions": "Check for: Torn paper fragments. Dust buildup. Obstructions in the paper feed path. Gently clean with a dry lint-free cloth or compressed air. Do not use liquid cleaners on the thermal head."
    },
    {
      "title": "Check Print Density / Contrast Settings",
      "instructions": "Navigate to print settings and verify density is set to default or appropriate levels. If output is faint, increase density slightly and re-test. Reset to default if necessary to rule out user adjustment."
    },
    {
      "title": "Perform Printer Self-Test",
      "instructions": "Access the internal printer self-test through the system menu. Observe: Does paper feed properly? Is the test pattern clear and complete? Is output blank despite correct paper? If the self-test fails or prints poorly, this indicates likely internal printer or thermal head failure."
    },
    {
      "title": "Check for System Error Messages",
      "instructions": "Review the display for printer-related error codes. Document exact wording of the message. Do not attempt board-level repair based on codes; this is for documentation and escalation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“ECG prints blank pages.” or “Printout is very faint and unreadable.”",
      "Cause": "“Printer enabled and correct thermal paper loaded. Density adjusted with no improvement. Printer self-test prints blank output. Suspected thermal print head failure.”",
      "Resolution": "“Removed unit from service and sent for repair.” or “Printer assembly replaced on bench. Self-test passed. Returned to service.”"
    }
  },
  "helpfulDetails": [
    "Paper type verified",
    "Paper orientation confirmed",
    "Density setting checked",
    "Printer self-test result",
    "Error messages displayed",
    "Paper feed behavior",
    "Final device status (returned to service or sent for repair)"
  ]
},
    {
  "title": "ICU Medical CADD-Solis – Keypad Not Responding",
  "description": "Structured troubleshooting guide for CADD-Solis infusion pumps with unresponsive or faulty keypads.",
  "assetType": "Infusion Pump",
  "manufacturer": "ICU Medical",
  "model": "CADD-Solis",
  "url": "icu-cadd-solis-keypad.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the pump is actively infusing and programming changes cannot be made: Transition the patient to another verified infusion pump before troubleshooting. Do not attempt prolonged troubleshooting on an active infusion. Patient care takes priority over device diagnosis."
    },
    {
      "title": "Confirm the Pump Is Not Frozen",
      "instructions": "Observe whether the display is updating normally. Check for active alarms or error messages. Attempt multiple buttons across different areas of the keypad. If the screen is static and no inputs respond, the pump may be frozen rather than experiencing keypad hardware failure."
    },
    {
      "title": "Perform a Power Cycle",
      "instructions": "Turn the pump off. Wait at least 10 seconds. Turn the pump back on and allow it to complete full boot sequence. Temporary software or logic faults can cause keypad lockup. A full reboot resolves many intermittent issues."
    },
    {
      "title": "Inspect the Keypad Surface",
      "instructions": "Visually examine the keypad membrane for cracks, bubbling, separation, worn or faded button areas, signs of fluid intrusion, sticky or hardened residue. High-use keys (Start/Stop, Enter, navigation keys) are the most common failure points due to wear."
    },
    {
      "title": "Check for Cleaning Residue or Fluid Intrusion",
      "instructions": "Inspect edges of the keypad for signs of liquid seepage. Look for pooling of disinfectant beneath membrane edges. Clean gently per facility policy and allow to fully dry before retesting. Repeated aggressive cleaning can degrade membrane contacts over time."
    },
    {
      "title": "Test All Buttons Individually",
      "instructions": "Press each button one at a time and document which buttons fail consistently, whether failure is isolated to certain keys, and whether the entire keypad is unresponsive. If only specific keys fail, membrane contact failure is likely. If all keys fail, suspect internal ribbon connection or main board issue."
    },
    {
      "title": "Verify Battery and Power Status",
      "instructions": "Ensure battery charge is adequate. Confirm pump is not in a low-voltage or fault state. Verify proper external power connection if plugged in. Low voltage conditions can cause erratic keypad behavior."
    },
    {
      "title": "Observe and Document Behavior Pattern",
      "instructions": "Note whether the keypad works after reboot but fails later, whether only high-use keys are affected, whether pressing firmly temporarily restores function, and whether the failure is constant or intermittent. Pattern recognition helps determine whether the issue is wear-related or internal."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the keypad remains unresponsive after completing the steps above, common external causes have been ruled out. The issue is likely internal, such as keypad membrane failure, ribbon cable disconnection, or main PCB fault. Remove the pump from service. Label it Out of Service. Send for repair or Clinical Engineering bench evaluation. Bedside-level intervention should not include internal disassembly."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Keypad buttons not responding; unable to program infusion.",
      "Cause": "Pump power-cycled and inspected. Specific keypad buttons remain non-functional. Suspected keypad membrane failure. Entire keypad non-responsive after reboot. No visible membrane damage. Suspected internal PCB or ribbon cable issue. Keypad sticky from cleaning residue. After cleaning and drying, function restored.",
      "Resolution": "Removed pump from service, labeled Out of Service, sent for repair. Tagged for Clinical Engineering bench evaluation. Cleaned keypad surface per policy; functionality restored and returned to service."
    }
  },
  "helpfulDetails": [
    "Power cycled (yes / no)",
    "Visible membrane damage (yes / no)",
    "Specific buttons affected",
    "Entire keypad unresponsive (yes / no)",
    "Signs of fluid intrusion",
    "Battery level at time of inspection",
    "Final device disposition"
  ]
},
    {
  "title": "ICU Medical CADD-Solis – Air-in-Line Alarms",
  "description": "Structured troubleshooting guide for resolving air-in-line alarms on the ICU Medical CADD-Solis infusion pump.",
  "assetType": "Infusion Pump",
  "manufacturer": "ICU Medical",
  "model": "CADD-Solis",
  "url": "icu-medical-cadd-solis-air-in-line.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "1. Ensure Patient Safety First",
      "instructions": "If actively infusing, transition the patient to an alternate pump if therapy cannot be interrupted. Do not troubleshoot on an active critical infusion when avoidable. Once therapy is safely managed, proceed with inspection. Patient safety always takes priority over device troubleshooting."
    },
    {
      "title": "2. Inspect Tubing and Cassette for Air",
      "instructions": "Stop the pump if running. Visually inspect tubing from cassette to patient. Examine the cassette reservoir for visible air. Look closely at the section of tubing that passes through the pump’s air detection area. Even small bubbles near the sensor can trigger alarms. If air is present: Re-prime tubing per manufacturer guidelines. Remove all visible air before restarting infusion."
    },
    {
      "title": "3. Check All Tubing Connections",
      "instructions": "Verify all luer connections are secure. Inspect for loose, partially threaded, or cross-threaded connections. Check for any signs of leakage. Loose connections can introduce air during infusion, especially at higher flow rates."
    },
    {
      "title": "4. Confirm Proper Cassette Installation",
      "instructions": "Remove the cassette. Re-seat it firmly into the pump. Ensure it is fully locked and secured. Verify tubing is correctly aligned within the cassette channel and pressure plate area. A partially seated cassette can cause false air detection."
    },
    {
      "title": "5. Verify Pump Orientation and Placement",
      "instructions": "Confirm the pump is upright per manufacturer guidance. Avoid placing the pump on uneven surfaces. Ensure tubing runs freely without tension or kinking. Improper orientation or tension can affect sensor accuracy."
    },
    {
      "title": "6. Power Cycle the Pump",
      "instructions": "Turn the pump off. Wait at least 10 seconds. Restart the pump. Reinstall cassette and tubing. Restart infusion and monitor. Temporary sensor or logic glitches may clear after a reboot."
    },
    {
      "title": "7. Test with Known-Good Tubing and Cassette",
      "instructions": "Replace tubing and cassette with new or verified working components. Use the same infusion settings. Observe behavior. If alarms stop: Original tubing or cassette likely had trapped air or a defect. If alarms continue: Internal air-in-line sensor, pressure plate, or logic issue is likely."
    },
    {
      "title": "8. Observe and Document Alarm Pattern",
      "instructions": "Note the following: Does alarm occur immediately upon start? Does it occur only at certain flow rates? Is there visible air when alarm triggers? Does repositioning tubing temporarily resolve it? Does priming temporarily fix the issue? Pattern recognition helps distinguish external setup issues from internal failures."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Pump repeatedly alarming for air-in-line; no visible air in tubing.”",
      "Cause": "“Tubing inspected and re-primed; cassette reseated; alarm persists.” “Replaced tubing and cassette; alarms continue. Suspected internal air sensor issue.”",
      "Resolution": "“Removed from service, labeled Out of Service, sent for bench evaluation.” “Replaced defective tubing and cassette; infusion resumed without alarms.” “Power cycled and reseated cassette; issue resolved.”"
    }
  },
  "helpfulDetails": [
    "Tubing primed (yes / no)",
    "Tubing replaced/tested",
    "Cassette replaced/tested",
    "Pump orientation verified",
    "Alarm timing (immediate vs. during infusion)",
    "Flow rate at time of alarm",
    "Visible air present (yes / no)",
    "Final device status (returned to service or sent for repair)"
  ]
},
    {
  "title": "ICU Medical CADD-Solis – Occlusion Alarms – Especially False Occlusions",
  "description": "Structured troubleshooting guide for addressing occlusion alarms and false occlusions on the ICU Medical CADD-Solis infusion pump.",
  "assetType": "Infusion Pump",
  "manufacturer": "ICU Medical",
  "model": "CADD-Solis",
  "url": "icu-cadd-solis-occlusion.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "1. Ensure Patient Safety First",
      "instructions": "If actively infusing, transition the patient to another pump if clinically necessary. Do not perform extended troubleshooting on a device connected to a patient receiving critical medication. Patient safety takes priority over device evaluation."
    },
    {
      "title": "2. Inspect the Entire Tubing Path",
      "instructions": "Stop the infusion. Trace the tubing from cassette to patient. Look for: Kinks or sharp bends. Tubing pinched under bed rails, clothing, or clamps. Closed slide clamps. Tight securement at the IV site. Even minor kinks or tension can create enough back pressure to trigger an occlusion alarm."
    },
    {
      "title": "3. Verify Proper Cassette Seating",
      "instructions": "Remove the cassette. Inspect the cassette interface area. Confirm: Tubing is correctly seated in the pressure channel. Cassette clicks fully into place. No misalignment or partial engagement. Improper seating can cause inaccurate pressure detection."
    },
    {
      "title": "4. Inspect the Pressure Plate and Channel",
      "instructions": "Examine the pump’s pressure plate and cassette channel. Look for: Dried medication residue. Debris or contamination. Warped or cracked pressure components. Clean per facility policy if debris is present. Residue or physical distortion can cause false pressure readings."
    },
    {
      "title": "5. Confirm Correct and Compatible Tubing",
      "instructions": "Verify the cassette and tubing type match the therapy mode (continuous, PCA, intermittent). Confirm tubing is compatible with the CADD-Solis system. Check expiration date and physical condition. Worn, stiff, or incompatible tubing can increase resistance and trigger intermittent alarms."
    },
    {
      "title": "6. Check Pump Orientation and Placement",
      "instructions": "Ensure the pump is positioned according to manufacturer guidance. Avoid upside-down orientation. Confirm tubing runs freely without tension. Pressure sensors can react to mechanical stress if the pump or tubing is under strain."
    },
    {
      "title": "7. Power Cycle the Pump",
      "instructions": "Turn the pump off. Wait at least 10 seconds. Turn it back on. Reinstall cassette and tubing. Temporary sensor or logic irregularities may clear after a reboot."
    },
    {
      "title": "8. Test with Known-Good Components",
      "instructions": "Replace cassette and tubing with verified working components. Attempt infusion at the same programmed settings. If alarms stop: → Original tubing or cassette likely defective. If alarms continue: → Internal pressure sensor, pressure plate assembly, or logic issue is likely."
    },
    {
      "title": "9. Observe Alarm Pattern",
      "instructions": "Document: Does the alarm occur immediately on start? Only at higher flow rates? Intermittently during steady infusion? Does adjusting tubing temporarily clear it? Pattern recognition helps distinguish external resistance from internal sensing failure."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Pump repeatedly alarming ‘Occlusion’ during infusion; tubing appears patent.”",
      "Cause": "“Tubing inspected, no kinks noted. Cassette reseated. Pump power-cycled. Tested with known-good tubing and cassette. Occlusion alarm persisted. Suspect internal pressure sensor or pressure plate issue.” OR “Tubing found kinked under bed rail causing intermittent occlusion.”",
      "Resolution": "“Repositioned tubing; infusion resumed without alarms.” “Replaced defective cassette; pump functioning normally.” “Removed pump from service, labeled Out of Service, sent to CE bench for evaluation.”"
    }
  },
  "helpfulDetails": [
    "Tubing path clear (yes/no)",
    "Cassette replaced (yes/no)",
    "Known-good tubing tested (yes/no)",
    "Pump orientation verified",
    "Alarm timing (immediate or during infusion)",
    "Flow rate at time of alarm",
    "Any visible residue or contamination",
    "Final disposition (returned to service or sent for repair)"
  ]
},
    {
  "title": "ICU Medical CADD-Solis Cassette Not Recognized / Cassette Error",
  "description": "Structured troubleshooting guide for ICU Medical CADD-Solis pumps displaying cassette recognition errors.",
  "assetType": "Infusion Pump",
  "manufacturer": "ICU Medical",
  "model": "CADD-Solis",
  "url": "icu-cadd-solis-cassette-error.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the pump is actively infusing: Transition the patient to another pump if therapy must continue. Stop the pump safely per facility policy. Do not troubleshoot while connected to an active patient unless therapy is safely paused. This prevents interruption of critical infusion therapy."
    },
    {
      "title": "Remove and Re-seat the Cassette",
      "instructions": "Stop the pump if running. Remove the cassette completely. Inspect the pump cassette interface. Reinstall the cassette firmly until it clicks and locks into place. Confirm the cassette is: Properly aligned. Fully seated. Locked securely. A partially engaged cassette is the most common cause of recognition errors."
    },
    {
      "title": "Inspect the Cassette for Physical Damage",
      "instructions": "Examine: Cassette housing. Tubing channel. Keying/alignment features. Pressure plate contact area. Look for: Bent or broken alignment tabs. Cracked or warped plastic. Signs of fluid contamination. Dried medication residue. Even minor warping can prevent proper sensor engagement. Replace the cassette if any defect is observed."
    },
    {
      "title": "Confirm Cassette Compatibility",
      "instructions": "Verify: Cassette type matches the programmed therapy. Volume (50 mL, 100 mL, etc.) matches pump configuration. Cassette is approved for CADD-Solis use. If unsure, compare with a known-good cassette from the same stock. Incorrect cassette type can trigger validation errors."
    },
    {
      "title": "Inspect the Pump Cassette Latch Area",
      "instructions": "With the cassette removed: Check for debris or dried medication residue. Inspect latch mechanism for smooth movement. Look for plastic fragments or obstruction. Confirm latch does not feel loose or damaged. Clean gently per facility cleaning policy if contamination is present. Obstructions can prevent proper sensor or latch engagement."
    },
    {
      "title": "Power Cycle the Pump",
      "instructions": "Turn the pump off. Wait at least 10 seconds. Turn it back on. Reinstall the cassette. Temporary logic or sensor faults may clear after a reboot."
    },
    {
      "title": "Test with a Known-Good Cassette",
      "instructions": "Install a new, unused cassette: Attempt to program and start infusion. If the error clears: The original cassette was likely defective or warped. If the error persists with multiple cassettes: Suspect internal pump issue (cassette detection sensor, latch microswitch, pressure sensing mechanism, or PCB fault)."
    },
    {
      "title": "Observe and Document Exact Error Behavior",
      "instructions": "Record: Does the error occur immediately upon installation? Does it occur only when starting infusion? Are there additional pressure or occlusion messages? Does the latch feel loose or not fully engaging? This information helps determine whether the issue is mechanical, sensor-related, or logic-based."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Pump displaying ‘Cassette Error’ — cassette not recognized after installation.”",
      "Cause": "“Cassette reseated and replaced with known-good cassette. Error persists. Suspected internal cassette detection sensor or latch switch failure.”",
      "Resolution": "“Removed pump from service, labeled Out of Service, sent for repair.”"
    }
  },
  "helpfulDetails": [
    "Cassette reseated (yes / no)",
    "New cassette tested (yes / no)",
    "Visible cassette damage observed",
    "Latch engagement normal (yes / no)",
    "Error immediate or during infusion start",
    "Presence of additional pressure or occlusion alarms",
    "Final device disposition (returned to service or sent for repair)"
  ]
},
    {
  "title": "Kendall SCD 700 Series - Display / Control Panel Malfunction",
  "description": "Structured Clinical Engineering approach for display or control panel malfunctions on Kendall SCD 700 Series units.",
  "assetType": "Sequential Compression Device (SCD)",
  "manufacturer": "Cardinal Health",
  "model": "Kendall SCD 700 Series",
  "url": "kendall-scd700-display-control.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the device is actively being used on a patient: Transfer the patient to another functioning SCD unit first. Do not troubleshoot a malfunctioning control panel on an active patient unless therapy is confirmed safe and uninterrupted. Patient safety takes priority over equipment evaluation."
    },
    {
      "title": "Confirm the Unit Has Power",
      "instructions": "Verify the unit is plugged into a known good outlet. Confirm the power switch is in the ON position. Listen for internal startup sounds (pump initialization or fan noise). Observe any LED indicators. If there are no lights and no startup sounds, the issue may be power-related rather than display-related. Refer to the 'Will Not Turn On' troubleshooting process if needed. A blank screen is often a power issue."
    },
    {
      "title": "Assess Screen Visibility",
      "instructions": "Observe the screen closely in normal lighting. Shine a flashlight at an angle across the screen. Look for faint text or graphics. If text becomes visible under a flashlight, this strongly suggests backlight failure rather than full display failure. If the screen briefly lights and then goes dark, this may indicate a failing backlight or power regulation issue."
    },
    {
      "title": "Check for a Frozen Interface",
      "instructions": "Press multiple buttons. Observe whether indicator LEDs respond. Confirm whether sleeves continue inflating and cycling. If therapy continues but controls are unresponsive, this may indicate: Software logic freeze, Keypad membrane failure, Control board issue. If nothing responds at all, suspect a deeper display/control failure."
    },
    {
      "title": "Power Cycle the Unit",
      "instructions": "Turn the unit OFF. Unplug from the wall (if applicable). Wait at least 10 seconds. Restore power and allow full startup sequence. Temporary logic faults can cause display freezing or keypad lockout. A proper power cycle may restore normal function. Observe startup behavior carefully: Does the screen briefly flash? Is there a normal startup beep? Are partial segments visible? These details are important for documentation."
    },
    {
      "title": "Inspect for Physical Damage",
      "instructions": "Visually inspect the front panel: Cracks in the display window, Signs of liquid intrusion, Warping or pressure marks, Sticky or physically stuck buttons. Gently press each button to check for tactile feedback. Physical damage commonly causes intermittent or non-responsive controls."
    },
    {
      "title": "Check for Intermittent Behavior",
      "instructions": "With the unit powered on: Gently move the device. Lightly tap near the display area. Observe whether the screen flickers or partially returns. Intermittent flickering may indicate a loose internal ribbon cable or failing connection. Do not open the unit unless authorized and within scope of practice."
    },
    {
      "title": "If the Display or Controls Remain Malfunctioning",
      "instructions": "After completing the steps above, you have: Verified incoming power, Ruled out brightness/backlight visibility issues, Attempted power cycling, Checked for physical damage, Observed startup behavior, Confirmed therapy operation status. At this point, the issue is likely internal, such as: Display panel failure, Backlight failure, Keypad membrane failure, Internal control board malfunction, Ribbon cable connection issue. These are not bedside-correctable issues. The unit should be: Removed from service, Clearly labeled Out of Service, Sent for bench evaluation by Clinical Engineering."
    },
    {
      "title": "Clinical Use Tip",
      "instructions": "Never rely on a unit with a non-functional display or control panel for active therapy. If settings cannot be verified or adjusted, therapy parameters cannot be confirmed. Always transfer the patient to a functioning device before removing a malfunctioning unit from service."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Document what was reported by clinical staff. Examples: 'Display blank; unit powers on but no visible text.' 'Control buttons unresponsive; sleeves inflate but panel frozen.'",
      "Cause": "Document what you verified and observed. Examples: 'Power verified. Unit power cycled. No visible backlight or response from control panel. Suspected display/backlight failure.' 'Therapy running but control panel non-responsive after power cycle. Suspected internal control board or keypad failure.'",
      "Resolution": "Document the final action taken. Examples: 'Removed device from service; labeled Out of Service; sent to CE shop for bench evaluation.' 'Tagged Out of Service due to display/control malfunction; awaiting internal repair.'"
    }
  },
  "helpfulDetails": [
    "Outlet verified functional",
    "Startup beep present (yes/no)",
    "Screen completely blank or faint image visible",
    "Buttons responsive (yes/no)",
    "Therapy running despite display issue (yes/no)",
    "Visible physical damage present (yes/no)",
    "Unit removed from service (yes/no)",
    "Final device status"
  ]
},
    {
  "title": "Kendall SCD 700 Series – Alarms Going Off Unnecessarily",
  "description": "Structured Clinical Engineering troubleshooting guide for frequent or unnecessary alarms on a Kendall SCD 700 Series Sequential Compression Device.",
  "assetType": "Sequential Compression Device (SCD)",
  "manufacturer": "Cardinal Health",
  "model": "Kendall SCD 700 Series",
  "url": "kendall-scd700-alarms.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Before manipulating tubing or sleeves: Confirm therapy can be safely paused. If the device is actively in use on a patient, coordinate with clinical staff. Do not troubleshoot aggressively while connected to a patient. Patient safety comes first."
    },
    {
      "title": "Identify the Exact Alarm Message",
      "instructions": "Read and document the exact alarm wording. Determine whether the alarm is constant or intermittent. Note which side (left/right) is indicated, if applicable. Precise wording helps determine whether the issue is leak-related, pressure-related, or sensor-related."
    },
    {
      "title": "Check All Tubing Connections",
      "instructions": "Disconnect and fully reseat all tubing connectors. Ensure connectors are firmly inserted. Gently tug to confirm secure seating. Loose or partially seated connectors are the most common cause of nuisance alarms."
    },
    {
      "title": "Inspect Tubing for Micro-Leaks or Kinks",
      "instructions": "Inspect the full length of tubing for: Hairline cracks, Pinholes, Soft spots, Sharp bends or kinks, Compression under bed rails or wheels. Even very small leaks can cause repeated leak or pressure alarms."
    },
    {
      "title": "Inspect Sleeves",
      "instructions": "Check sleeves for: Torn seams, Worn or weak Velcro, Uneven wrapping, Incorrect size. Ensure sleeves are wrapped snugly and evenly. Improper application can create inconsistent pressure readings and false alarms."
    },
    {
      "title": "Swap Sleeves and Tubing (Isolation Step)",
      "instructions": "If available, replace sleeves with a known-good set. You may also: Swap left and right sleeves. Swap tubing sets. Observe results: If the alarm follows the sleeve/tubing → Accessory issue. If the alarm stays on the same port → Possible internal valve or sensor issue. This step helps isolate accessory versus device failure."
    },
    {
      "title": "Observe Pump and Inflation Behavior",
      "instructions": "During operation, observe: Does the pump sound smooth and consistent? Do sleeves inflate and deflate fully? When does the alarm trigger (inflation, hold, or deflation)? Normal pump sound with full inflation often suggests minor leaks or sensor sensitivity rather than major pump failure."
    },
    {
      "title": "Power Cycle the Unit",
      "instructions": "Turn the unit off. Wait at least 10 seconds. Restart therapy. Temporary software or logic faults can occasionally cause nuisance alarms."
    },
    {
      "title": "Evaluate the Environment",
      "instructions": "Confirm: Tubing is not being repeatedly flexed or pulled. The unit is positioned securely. No condensation or fluid contamination is present at connectors. The device is not located where tubing is constantly stressed. Environmental factors can intermittently break the air seal and trigger alarms."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Repeated leak alarm despite tubing appearing fully connected.”",
      "Cause": "“Tubing reseated and sleeves swapped. Alarm persisted on right port. Suspected internal pressure sensor or valve issue.” “Alarm followed sleeve when swapped. Leak identified at sleeve seam.”",
      "Resolution": "“Replaced defective sleeve; unit tested and returned to service.” “Removed from service and sent for bench evaluation due to persistent pressure alarm.”"
    }
  },
  "helpfulDetails": [
    "Exact alarm message",
    "Intermittent or constant",
    "Which side affected",
    "Sleeves swapped (yes / no)",
    "Tubing replaced (yes / no)",
    "Pump sounds normal (yes / no)",
    "Power cycled (yes / no)",
    "Environmental factors observed",
    "Final device status"
  ]
},
    {
  "title": "Kendall SCD 700 Series – Pressure Too Low or Inconsistent",
  "description": "Structured troubleshooting guide for low or inconsistent compression pressure on a Kendall SCD 700 Series.",
  "assetType": "Sequential Compression Device (SCD)",
  "manufacturer": "Cardinal Health",
  "model": "Kendall SCD 700 Series",
  "url": "kendall-scd700-pressure-low.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "1. Confirm Therapy Mode and Active Cycle",
      "instructions": "Verify correct therapy mode (calf vs. thigh). Confirm therapy is actively running and not paused or in standby. Observe at least one full inflation/deflation cycle."
    },
    {
      "title": "2. Check Sleeve Application and Fit",
      "instructions": "Ensure sleeves are wrapped snugly and evenly. Confirm proper sleeve size for the patient. Verify hook-and-loop closures are fully secured. Check that bladders are aligned correctly with the limb."
    },
    {
      "title": "3. Inspect Tubing for Leaks or Obstructions",
      "instructions": "Examine entire tubing length for cracks, splits, or pinholes. Check for loose fittings at both ends. Look for kinks, sharp bends, or compression under bed rails or equipment. Inspect for partially disconnected quick-connect fittings."
    },
    {
      "title": "4. Reseat All Connections at the Ports",
      "instructions": "Fully disconnect and reconnect tubing at both device ports. Ensure connectors click or seat completely. Listen for escaping air during inflation. Gently move connectors while the unit is inflating to check for intermittent leaks."
    },
    {
      "title": "5. Swap Sleeves and Tubing",
      "instructions": "Swap left and right sleeves. Replace tubing with a known-good set if available. Observe results: If the issue follows the sleeve → sleeve likely leaking. If the issue follows the tubing → tubing defective. If the issue remains on the same device port → possible internal valve or channel issue."
    },
    {
      "title": "6. Listen to Pump Operation",
      "instructions": "During inflation: Pump sound should be smooth and consistent. No excessive strain, grinding, or rapid short cycling. No unusually loud or weak-sounding motor activity."
    },
    {
      "title": "7. Check for Alarms or Error Messages",
      "instructions": "Look for: Leak detected. Pressure fault. System error. Record the exact alarm wording for documentation."
    },
    {
      "title": "8. Compare Both Channels",
      "instructions": "Swap tubing between ports. Observe whether low pressure follows the tubing or remains with the device port. If the issue remains isolated to one port after accessory swaps, internal channel components are likely involved."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Compression pressure weak and inconsistent on left leg.”",
      "Cause": "“Sleeves and tubing inspected and swapped; issue remained on left port. Suspected internal valve or pump degradation.”",
      "Resolution": "“Removed device from service and sent for bench evaluation due to suspected internal pressure channel failure.”"
    }
  },
  "helpfulDetails": [
    "Side affected (left / right / both)",
    "Exact alarm message wording",
    "Sleeve size used",
    "Sleeve swapped: yes / no",
    "Tubing replaced: yes / no",
    "Pump audible and consistent: yes / no",
    "Leak heard at connections: yes / no",
    "Final device status (returned to service / sent to repair)"
  ]
},
      {
  "title": "Kendall SCD 700 Series – One or More Sleeves Not Inflating",
  "description": "Structured troubleshooting guide for sleeve inflation problems on the Kendall SCD 700 Series Sequential Compression Device.",
  "assetType": "Sequential Compression Device (SCD)",
  "manufacturer": "Cardinal Health",
  "model": "Kendall SCD 700 Series",
  "url": "kendall-scd700-sleeve-not-inflating.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Confirm the Unit Is Powered and Therapy Is Started",
      "instructions": "Verify the unit is powered on. Confirm there are no active alarms preventing therapy. Ensure therapy has been started (unit powered on alone does not initiate compression)."
    },
    {
      "title": "Check Sleeve and Tubing Connections",
      "instructions": "Confirm tubing is fully seated into the correct port. Push connectors firmly until fully engaged. Inspect for partially disconnected or loose fittings. Swap left and right ports to see if the issue follows the sleeve or remains with the port."
    },
    {
      "title": "Inspect the Tubing for Kinks or Damage",
      "instructions": "Follow the entire tubing length from unit to sleeve. Check for sharp bends or kinks. Ensure tubing is not pinched under bed rails, wheels, or mattress frames. Inspect for cracks, punctures, or separation at connection points."
    },
    {
      "title": "Inspect the Sleeves",
      "instructions": "Visually inspect for: Tears or punctures. Separated seams. Worn or ineffective Velcro. Improper wrapping. Ensure sleeves are wrapped snugly but not overly tight. Improper fit can prevent pressure buildup or cause uneven compression."
    },
    {
      "title": "Swap Sleeves to Isolate the Issue",
      "instructions": "Disconnect both sleeves. Connect the left sleeve to the right port and vice versa. Restart therapy and observe. If the issue follows the sleeve → the sleeve is likely defective. If the issue stays with the same port → suspect an internal valve or channel issue."
    },
    {
      "title": "Check for Alarm Messages",
      "instructions": "Document any alarm messages exactly as displayed, such as: Leak detected. Disconnected tubing. Pressure fault. Alarm wording helps determine whether the system is sensing a leak or failing to generate pressure."
    },
    {
      "title": "Listen for Pump Operation",
      "instructions": "Start therapy and listen carefully: Pump audible and cycling → air movement is occurring. Pump running but no inflation → possible internal valve or manifold issue. No pump sound → possible internal motor or control board issue. Avoid opening the device. Internal repair is not a bedside procedure."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the sleeves still do not inflate after completing all external checks, you have ruled out: Therapy not started. Loose or disconnected tubing. Kinked or damaged tubing. Defective sleeves. Alarm-related interruptions. The issue is likely internal, such as: Internal valve failure. Pump motor malfunction. Pressure sensor fault. Internal manifold leak. Remove the unit from service. Clearly label it “Out of Service”. Send for bench evaluation or repair."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“One sleeve not inflating; right leg receiving no compression.”",
      "Cause": "“Tubing and sleeve inspected. Swapped sleeves; issue followed right sleeve. Sleeve leaking.” or “Swapped sleeves and ports. Issue remained on left port. Suspected internal valve failure.”",
      "Resolution": "“Replaced defective sleeve; unit tested and returned to service.” or “Removed device from service and sent to shop for internal repair.”"
    }
  },
  "helpfulDetails": [
    "Which side affected (left/right/both)",
    "Exact alarm messages displayed",
    "Whether sleeves were swapped",
    "Whether issue followed sleeve or stayed with port",
    "Tubing condition (intact/kinked/damaged)",
    "Pump audible (yes/no)",
    "Final device status (returned to service or removed)"
  ]
},
    {
  "title": "Kendall SCD 700 Series – Power Issue – Will Not Turn On",
  "description": "Structured troubleshooting approach for a Kendall SCD 700 Series that will not power on.",
  "assetType": "Sequential Compression Device (SCD)",
  "manufacturer": "Cardinal Health",
  "model": "Kendall SCD 700 Series",
  "url": "kendall-scd700-power.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Confirm the AC Power Source",
      "instructions": "Verify the unit is plugged into a known live hospital-grade outlet. Test the outlet using a known-good device. If plugged into a power strip, bypass it and plug directly into the wall. Power source issues are the most common cause of a no-power complaint."
    },
    {
      "title": "Verify Power Cord Integrity",
      "instructions": "Inspect the entire length of the power cord: No cuts, frays, or crushed sections. No exposed wiring. Strain relief intact at both ends. Ensure the cord is fully seated at the device inlet. If damage is found, remove from service immediately. Do not attempt temporary fixes."
    },
    {
      "title": "Check the Power Switch",
      "instructions": "Place the power switch firmly in the ON position. Observe for: Any LED illumination. Audible click or startup tone. Momentary light flicker. A worn switch may mechanically move but fail electrically."
    },
    {
      "title": "Test with a Known-Good Outlet",
      "instructions": "Even if the first outlet tested good, relocate the device to a second verified outlet. This eliminates: Intermittent outlet failure. Tripped upstream breaker. Faulty wall plate wiring."
    },
    {
      "title": "If Equipped with Battery – Verify Battery Status",
      "instructions": "Some SCD 700 units may include battery capability. If applicable: Confirm battery is properly seated. Attempt power-up on battery alone. Swap with a known-good battery if available. A failed battery can sometimes prevent startup."
    },
    {
      "title": "Observe for Any Partial Signs of Life",
      "instructions": "Attempt to power the unit while observing closely for: Brief LED flash. Faint beeping. Relay clicking. Burning smell. Excess heat. Document exactly what occurs. Even brief activity provides useful diagnostic information."
    },
    {
      "title": "Do Not Open the Unit in Clinical Areas",
      "instructions": "Do not access internal fuses or service panels in patient care areas. If internal fuse or PCB failure is suspected: Stop troubleshooting. Escalate to bench evaluation. Internal access should only occur in a controlled CE environment."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the device remains completely unresponsive after: Verifying power source. Inspecting cord. Testing alternate outlet. Checking switch function. Evaluating battery (if applicable). The issue is likely internal (power supply board, internal fuse, PCB failure). At this point: Remove the device from service. Clearly label it Out of Service. Send for Clinical Engineering bench evaluation. Knowing when to stop is proper troubleshooting."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Kendall SCD 700 will not power on. No display or indicator lights.”",
      "Cause": "“Verified hospital-grade outlet functional. Tested alternate outlet. Power cord intact. Power switch engaged with no response. No LED activity. Suspect internal power supply or fuse failure.”",
      "Resolution": "“Removed from service. Labeled Out of Service. Sent to CE shop for bench evaluation.” / “Unit tagged and routed for internal power supply inspection.”"
    }
  },
  "helpfulDetails": [
    "Outlet tested (yes/no)",
    "Alternate outlet tested",
    "Battery tested or swapped",
    "Power switch behavior",
    "Indicator light behavior",
    "Any audible clicks or tones",
    "Any smell or heat noted",
    "Final device status"
  ]
},
    {
  "title": "Welch Allyn Connex 6000 Series – Touchscreen Calibration Off / Dead Spots",
  "description": "Structured troubleshooting guide for touchscreen misalignment or dead spots on a Connex 6000 Series monitor.",
  "assetType": "Patient Monitor",
  "manufacturer": "Welch Allyn",
  "model": "Connex 6000 Series",
  "url": "welch-allyn-connex6000-touchscreen.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Check for Obstructions or Contamination",
      "instructions": "Inspect the screen for dirt, dried disinfectant residue, moisture, or debris. Clean the screen using an approved disinfectant wipe. Allow the screen to fully dry before testing. Ensure no plastic film, tape, labels, or screen protectors are present."
    },
    {
      "title": "Confirm the Monitor Is Not Frozen",
      "instructions": "Press multiple areas of the screen. Attempt to access different menus. Observe whether the display is updating normally or appears stuck. If the screen is frozen but powered on, proceed to a power cycle."
    },
    {
      "title": "Power Cycle the Monitor",
      "instructions": "Turn the monitor off. Wait at least 10 seconds. Power the monitor back on. Allow the unit to complete a full boot sequence before testing touch response."
    },
    {
      "title": "Check for Visible Screen Damage",
      "instructions": "Inspect for cracks, impact points, pressure marks, or discoloration. Lightly touch various areas and document where input is not detected. Note if touches register in the wrong location (misalignment)."
    },
    {
      "title": "Observe and Document the Behavior Pattern",
      "instructions": "Determine whether the issue is: Consistent dead zones in specific areas. Random intermittent non-response. Consistent touch offset (pressing one location activates another area). Complete non-response. Document any on-screen error messages or unusual behavior."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Touchscreen not responding correctly; dead spots on right side of screen.”",
      "Cause": "“Screen cleaned and dried. Unit power cycled. No visible cracks. Touch input remains unresponsive in upper-right quadrant. Suspected touchscreen digitizer failure.”",
      "Resolution": "“Removed from service, labeled Out of Service, sent for repair.” / “Tagged for Clinical Engineering bench evaluation.”"
    }
  },
  "helpfulDetails": [
    "Screen cleaned and dried",
    "Power cycle performed",
    "Specific areas not responding",
    "Misalignment observed (yes/no)",
    "Visible cracks or pressure damage",
    "Screen frozen prior to reboot (yes/no)",
    "Final disposition (returned to service or sent for repair)"
  ]
},
      {
  "title": "Philips V60 Ventilator - Fails Self-Test / Leak Detected",
  "description": "Provides a structured Clinical Engineering approach to troubleshoot a leak detected during self-test on a Philips V60 ventilator.",
  "assetType": "Ventilator",
  "manufacturer": "Philips",
  "model": "V60",
  "url": "philips-v60-leak-fail.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Check the Patient Circuit and Tubing",
      "instructions": "Ensure all connections are fully seated. Inspect for cracks, holes, or loose fittings. Verify the circuit is properly attached to the ventilator outlet. Reason: Even a small gap can cause a leak detection during self-test."
    },
    {
      "title": "Inspect the Exhalation Port and Filter",
      "instructions": "Confirm the exhalation port is installed correctly. Check the filter is present, seated properly, and unobstructed. Look for moisture buildup or blockages. Reason: Improper installation or obstruction can trigger a leak error."
    },
    {
      "title": "Check the Humidifier (If Installed)",
      "instructions": "Ensure the humidifier chamber is seated correctly and intact. Inspect tubing connections for tightness and leaks. Reason: Humidifier leaks are a common cause of self-test failure."
    },
    {
      "title": "Inspect the Mask or Test Plug",
      "instructions": "If a mask is attached, ensure a proper seal. If running a self-test without a patient, verify the test plug or circuit cap is secure. Reason: Any open patient interface will cause the ventilator to detect a leak."
    },
    {
      "title": "Perform a Simple Reset",
      "instructions": "Power the ventilator off. Re-seat the patient circuit, exhalation port, and humidifier connections. Power the ventilator back on and rerun the self-test. Reason: Resetting can clear temporary errors caused by connection issues."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the ventilator continues to fail the self-test after completing all external checks: The most common causes have been ruled out. The issue is likely internal (e.g., valve failure, internal leak). Next Steps: Remove the ventilator from clinical service. Clearly label it as Out of Service. Send for repair or bench evaluation. Clinical Engineering Note: Knowing when to stop is an essential part of proper troubleshooting and patient safety."
    },
    {
      "title": "Clinical Use Tip",
      "instructions": "Do not troubleshoot on an active patient; move the patient to another ventilator if possible. Only run self-tests when safe and with no patient attached or appropriately capped. Ensure all bedside staff are aware that the ventilator is being evaluated."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails self-test; leak detected.",
      "Cause": "Patient circuit, exhalation port, and humidifier inspected and reseated. No visible damage noted. Self-test continues to fail with leak detected. Suspected internal leak or valve failure.",
      "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
    }
  },
  "helpfulDetails": [
    "Circuit inspected or replaced",
    "Exhalation port reseated",
    "Humidifier chamber checked",
    "Self-test result (pass/fail)",
    "Visible damage or moisture",
    "Final device disposition (returned to service or sent for repair)"
  ]
},
   {
  "title": "Welch Allyn Connex 6000 Series – NIBP Failure / Leaky Hose / Transducer Drift",
  "description": "Step-by-step guide for Clinical Engineering to troubleshoot NIBP errors caused by hose leaks or transducer drift on the Connex 6000 Series.",
  "assetType": "Patient Monitor",
  "manufacturer": "Welch Allyn",
  "model": "Connex 6000 Series",
  "url": "welch-allyn-connex6000-nibp.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Inspect the NIBP Hose",
      "instructions": "Ensure the hose connecting the cuff to the monitor is fully seated at both ends. Examine the hose for cracks, holes, kinks, or wear. Replace the hose if any visible damage or leaks are detected. Even a small leak can prevent proper inflation and trigger an NIBP error."
    },
    {
      "title": "Check the Cuff and Connections",
      "instructions": "Confirm the cuff is the correct size for the patient. Verify the cuff tubing is fully inserted and the hook/Velcro is secure. Inspect the bladder for tears or leaks. A poorly seated or damaged cuff can cause failed or inaccurate readings."
    },
    {
      "title": "Verify the Module / Transducer Seating",
      "instructions": "Ensure the NIBP module is fully inserted in the monitor. Check connector pins for cleanliness, corrosion, or damage. Look for visible moisture or debris around the module. Loose or misaligned transducers can cause drift or persistent errors."
    },
    {
      "title": "Observe the Display",
      "instructions": "Note any error codes (e.g., “NIBP Fail,” “Low Pressure,” “Leak Detected”). Record whether the error occurs immediately or intermittently. Documenting these details helps Clinical Engineering track recurring issues."
    },
    {
      "title": "Try a Simple Reset",
      "instructions": "Remove the cuff and hose from the patient. Power cycle the monitor. Reconnect the hose and cuff, then attempt another measurement. If successful, the issue may have been a temporary connection or seating problem."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If NIBP measurements still fail after completing the above steps, you have already checked the most common and easily verified causes: Hose integrity, Cuff correctness and placement, Module/transducer connections, Simple reset. The issue is now likely internal (transducer drift, module malfunction, or sensor calibration issue) and cannot be resolved at the bedside. Next Steps: Remove the monitor from clinical service. Clearly label it as Out of Service. Send it for repair or bench evaluation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "NIBP measurement failed; error displayed.",
      "Cause": "Hose inspected and intact, cuff verified, module seated correctly. Measurement still fails. Suspected transducer drift or internal module fault.",
      "Resolution": "Removed monitor from service, labeled Out of Service, sent for repair. Tagged for bench evaluation by CE."
    }
  },
  "helpfulDetails": [
    "Hose checked/replaced",
    "Cuff verified/replaced",
    "Module reseated",
    "Error cleared/persisted",
    "Any visible damage, moisture, or debris",
    "Final device disposition (returned to service or sent for repair)"
  ]
},
    {
  "title": "Philips V60 Ventilator - Fails Self-Test / Flow Sensor Error",
  "description": "Structured Clinical Engineering troubleshooting guide for Philips V60 ventilator flow sensor errors or self-test failures.",
  "assetType": "Ventilator",
  "manufacturer": "Philips",
  "model": "V60",
  "url": "philips-v60-flow-error.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Inspect the Patient Circuit",
      "instructions": "Ensure all tubing connections are secure and fully seated. Check for cracks, holes, or loose fittings. Confirm there are no kinks or obstructions. Why: Even a small leak or disconnection can trigger a flow sensor error."
    },
    {
      "title": "Check the Flow Sensor Module",
      "instructions": "Locate the flow sensor (usually near the patient connection or ventilator port). Verify it is properly installed and seated. Inspect for visible damage, moisture, or condensation. Why: A loose or wet sensor prevents accurate flow readings."
    },
    {
      "title": "Verify Humidifier and Additional Circuit Components",
      "instructions": "Ensure the humidifier is seated correctly and tubing is fully connected. Check other inline devices (filters, adapters) for leaks or added resistance. Why: Extra resistance or leaks can trigger flow sensor alarms."
    },
    {
      "title": "Observe the Ventilator Display",
      "instructions": "Note the error code and any accompanying messages. Document the error for Clinical Engineering tracking."
    },
    {
      "title": "Attempt a Simple Reset",
      "instructions": "Power off the ventilator. Reseat the circuit and flow sensor connections. Power on and rerun the self-test. Why: Sometimes a simple reseating clears false errors."
    },
    {
      "title": "If the Flow Sensor Error Persists",
      "instructions": "After completing the above steps, if the ventilator still reports a flow sensor error: Common external causes have been ruled out. The issue is likely internal (flow sensor module, electronics, or calibration). Next steps: Remove the ventilator from clinical service. Label as Out of Service. Send for repair or bench evaluation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails self-test; flow sensor error.",
      "Cause": "Circuit and flow sensor inspected and reseated, humidifier checked, no visible damage. Error persists. Suspected internal flow sensor or electronics issue.",
      "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
    }
  },
  "helpfulDetails": [
    "Circuit inspected or replaced",
    "Flow sensor reseated",
    "Humidifier and inline devices checked",
    "Error cleared or persisted",
    "Any visible damage, moisture, or condensation",
    "Final disposition (returned to service or sent for repair)"
  ]
},
    {
  "title": "ZOLL R Series Defibrillator – Printer Not Printing / Paper Jam (Thermal Paper)",
  "description": "Structured Clinical Engineering approach for resolving printer not printing or paper jam errors on a ZOLL R Series defibrillator.",
  "assetType": "Defibrillator",
  "manufacturer": "ZOLL",
  "model": "R Series",
  "url": "zoll-r-series-printer.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Do not troubleshoot on an active code or patient.\nIf the device is in clinical use, move the patient to another defibrillator before proceeding.\nPatient care always takes priority over equipment troubleshooting."
    },
    {
      "title": "Check the Paper Stack",
      "instructions": "Open the printer compartment.\nConfirm a paper stack is present.\nEnsure the stack is properly seated and aligned in the tray.\nVerify the top sheet’s leading edge is correctly positioned in the feed path.\nReplace the stack if:\nIt is empty\nEdges are curled or bent\nSheets are wrinkled or compressed\nPaper appears old or heat-damaged\nThermal paper that is creased or compressed can misfeed and trigger jam errors."
    },
    {
      "title": "Inspect for Paper Jam or Debris",
      "instructions": "With the cover open:\nRemove any misfed or partially fed sheets.\nLook for torn paper fragments inside the feed rollers.\nCheck for debris or adhesive residue.\nEnsure rollers appear clean and unobstructed.\nDo not use sharp tools that could damage the thermal print head.\nClear the path completely before closing the cover."
    },
    {
      "title": "Verify Printer Cover Closure",
      "instructions": "The printer will not operate if the cover is not fully latched.\nClose the printer cover firmly.\nListen and feel for the latch click.\nConfirm the cover sits flush and does not spring open.\nA partially latched cover can generate false jam or “Insert Paper” messages."
    },
    {
      "title": "Try a Known-Good Thermal Paper Stack",
      "instructions": "If available:\nReplace the current paper stack with a new, known-good thermal stack.\nEnsure it is the correct type for the R Series.\nPerform a test strip or print an event summary.\nThis step helps rule out paper quality issues."
    },
    {
      "title": "Observe and Record the Exact Display Message",
      "instructions": "Document the exact error shown:\n“Paper Jam”\n“Insert Paper”\n“Printer Error”\nNo error, but no print output\nPrecise wording is important for trending and repair diagnostics."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Printer will not print / displaying paper jam error.”",
      "Cause": "“Paper stack wrinkled and misaligned in tray.”\n“Small torn paper fragment lodged in feed path.”\n“Paper loaded correctly, cover secured, known-good paper used — printer still displays jam error. Suspected internal printer mechanism failure.”",
      "Resolution": "“Cleared jam and replaced thermal paper stack; test print successful.”\n“Re-seated paper and secured cover; printer operational.”\n“Unit removed from service and sent for repair due to persistent printer error.”"
    }
  },
  "helpfulDetails": [
    "Paper stack loaded correctly: yes / no",
    "Paper condition (wrinkled, old, damaged)",
    "Jam cleared: yes / no",
    "Feed path inspected: yes / no",
    "Printer cover fully latched: yes / no",
    "Known-good paper tested: yes / no",
    "Exact display message",
    "Test print performed: yes / no",
    "Final device status (returned to service or sent for repair)"
  ]
},
    {
  "title": "ZOLL R Series Defibrillator – Pads Not Detected / Therapy Cable Failure",
  "description": "Structured troubleshooting guide for pad detection and therapy cable errors on a ZOLL R Series defibrillator.",
  "assetType": "Defibrillator",
  "manufacturer": "ZOLL",
  "model": "R Series",
  "url": "zoll-r-series-pads-cable.html",
  "dateAdded": "2026-02-17",
  "steps": [
    {
      "title": "Verify Pads Are Properly Connected",
      "instructions": "Ensure the therapy pads are fully seated into the therapy cable connector. Confirm the therapy cable is securely locked into the defibrillator front port. Disconnect and firmly reseat both connections."
    },
    {
      "title": "Inspect Pads for Physical Damage",
      "instructions": "Examine the pads for torn or cracked electrode surfaces, damaged snap connectors, dried or lifted gel surface, and contamination on contact surfaces. Replace immediately if any defect is noted."
    },
    {
      "title": "Inspect the Therapy Cable",
      "instructions": "Visually and physically inspect the entire cable for fraying or exposed wiring, kinks or sharp bends near strain relief, cracked housing at the connector, and loose or bent pins. Gently flex the cable near both ends while observing the screen for intermittent recognition."
    },
    {
      "title": "Verify Pad Expiration Date",
      "instructions": "Confirm pads are within manufacturer expiration date. If expired, replace with in-date pads and retest."
    },
    {
      "title": "Test With a Known-Good Cable or Pad Set",
      "instructions": "Replace pads with a known-good set. If the issue persists, replace the therapy cable with a known-good cable. This step isolates whether the problem follows the pads, the cable, or remains with the defibrillator."
    },
    {
      "title": "Observe the Exact Display Message",
      "instructions": "Document the exact wording of the error, whether the message appears immediately on power-up, whether it is intermittent, and any audible tones or status indicators."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "Remove the device from clinical service, label the unit Out of Service, and send for bench evaluation or authorized repair."
    },
    {
      "title": "Clinical Use Tip",
      "instructions": "Immediately transfer the patient to a backup defibrillator and ensure therapy capability is restored before beginning equipment evaluation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“R Series defibrillator displays ‘Pads Not Detected’ during daily check.”",
      "Cause": "“Therapy cable intermittently loses connection when flexed near strain relief.” or “Pads expired and not recognized by device.” or “No issue found with pads or cable; suspected internal therapy board fault.”",
      "Resolution": "“Replaced expired pads; unit passed operational check and returned to service.” “Removed defective therapy cable from service and replaced with known-good cable.” “Unit removed from service and sent to vendor for evaluation.”"
    }
  },
  "helpfulDetails": [
    "Pads reseated: yes / no",
    "Therapy cable reseated: yes / no",
    "Visible damage observed: yes / no",
    "Known-good pads tested: yes / no",
    "Known-good cable tested: yes / no",
    "Exact error message",
    "Pad expiration date",
    "Intermittent vs constant fault",
    "Final device status (returned to service or sent for repair)"
  ]
},
  {
    "title": "ZOLL R Series – Battery Fails Self-Test",
    "description": "Basic battery troubleshooting for a ZOLL R Series defibrillator reporting a failed self-test.",
    "assetType": "Defibrillator",
    "manufacturer": "ZOLL",
    "model": "R Series",
    "url": "zoll-r-series-battery-self-test.html",
    "dateAdded": "2026-02-11",
    "steps": [
      {
        "title": "Make Sure the Battery Is Fully Seated",
        "instructions": [
          "Confirm the battery is installed correctly in the defibrillator.",
          "Remove the battery and reinsert it, making sure it clicks or seats firmly into place.",
          "A loose battery can cause self-test failures even if the battery itself is good."
        ]
      },
      {
        "title": "Check the Battery Contacts",
        "instructions": [
          "Inspect the battery and device contacts for dirt or debris.",
          "Look for corrosion or bent or damaged pins.",
          "If safe to do so, gently clean visible debris from the contacts and reinsert the battery.",
          "Poor contact between the battery and device can cause charging and self-test issues."
        ]
      },
      {
        "title": "Verify the Battery Has Been Charging",
        "instructions": [
          "Confirm the defibrillator has been plugged into AC power when stored.",
          "Check for any charging or status indicators that show the battery has been receiving power.",
          "A battery that has not been charging may fail self-test due to low capacity."
        ]
      },
      {
        "title": "Try a Known-Good Battery (If Available)",
        "instructions": [
          "Remove the current battery and insert a known-good battery from another unit.",
          "Allow the unit to complete its self-test again.",
          "This helps determine whether the issue is with the battery or the defibrillator itself."
        ]
      },
      {
        "title": "Observe the Self-Test Message or Indicator",
        "instructions": [
          "Note exactly what the display or status indicator shows.",
          "Does it say \"Battery Fail\"?",
          "Does it say \"Replace Battery\"?",
          "Does it fail immediately or after charging?",
          "Even small details can help determine the cause."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Defibrillator reports battery failed self-test.",
        "Cause": "Battery fails self-test after reseating and charging. Alternate battery passes self-test. Suspected failed battery pack.",
        "Resolution": "Removed battery from service and replaced with known-good battery."
      },
      "helpfulDetails": [
        "Battery reseated: yes / no",
        "Contacts inspected: yes / no",
        "Alternate battery tested: yes / no",
        "Self-test message displayed",
        "Any unusual heat or swelling",
        "Final status (battery replaced or sent for repair)"
      ]
    }
  },
  {
  "title": "GE CARESCAPE B850 – Will Not Turn On",
  "description": "Basic power troubleshooting for a GE CARESCAPE B850 patient monitor.",
  "assetType": "Patient Monitor",
  "manufacturer": "GE Healthcare",
  "model": "B850",
  "url": "ge-b850-power.html",
  "dateAdded": "2026-02-16",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the monitor is in clinical use: transfer the patient to a functioning monitor first. Do not troubleshoot while the monitor is actively required for patient care. Confirm the device is safe to remove from service before proceeding."
    },
    {
      "title": "Verify AC Power at the Outlet",
      "instructions": "Confirm the monitor is connected to a known-working hospital-grade outlet. Test the outlet with a known-good device (lamp, outlet tester, etc.). If plugged into a power strip, isolation transformer, or UPS, verify that device is powered on and functioning. If available, try a different known-working wall outlet. Why this matters: Loss of upstream power is the most common and simplest cause of a “dead” monitor."
    },
    {
      "title": "Inspect and Reseat the Power Cord",
      "instructions": "Visually inspect the power cord for cuts, fraying, bent or damaged prongs, and loose connector ends. Reseat the cord firmly at the wall outlet and the rear AC inlet of the monitor. If available, swap with a known-good hospital-grade power cord and attempt to power on again. Why this matters: A loose or internally failed cord can mimic total device failure."
    },
    {
      "title": "Confirm the Rear Power Switch Position",
      "instructions": "Verify the rear power rocker switch is in the ON position. Then press the front power button. Do not assume the switch position without physically checking it."
    },
    {
      "title": "Observe for Any Signs of Activity",
      "instructions": "When attempting to power on, closely observe front LED indicators, brief screen flash, audible fan noise, or clicking sounds. Even minimal activity suggests partial power presence and helps narrow down whether the failure is complete or localized."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If the monitor shows no indicator lights, no fan noise, no display activity, and no response with known-good outlet and power cord, then common external causes have been ruled out. At this point, the issue is likely internal (power supply board, internal fuse, or power distribution failure). Remove the monitor from service, label clearly as Out of Service, and send for repair or bench evaluation. Knowing when to stop prevents unnecessary downtime and protects patient safety. Escalation after logical checks is proper troubleshooting."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor will not power on.",
      "Cause": "Unit does not power on with known-working outlet and known-good power cord. Rear switch verified ON. No indicator lights, fan noise, or display activity observed. Suspected internal power supply failure.",
      "Resolution": "Removed from service and tagged Out of Service. Sent to Biomed shop for bench evaluation. Dispatched for vendor repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested (yes/no)",
    "Alternate outlet attempted",
    "Power cord swapped (yes/no)",
    "Rear switch position confirmed",
    "Indicator light behavior",
    "Fan noise present/absent",
    "Any unusual odor or heat",
    "Final device status (returned to service or sent for repair)"
  ]
},
    {
    "title": "Baxter SIGMA Spectrum Infusion Pump – Occlusion Alarm / Will Not Start Infusion",
    "description": "Basic troubleshooting when a SIGMA Spectrum infusion pump shows an occlusion alarm and will not start infusion.",
    "assetType": "Infusion Pump",
    "manufacturer": "Baxter",
    "model": "SIGMA Spectrum",
    "url": "baxter-sigma-spectrum-occlusion.html",
    "dateAdded": "2026-02-10",
    "steps": [
      {
        "title": "Check the IV Set and Tubing",
        "instructions": [
          "Make sure the tubing is properly loaded into the pump.",
          "Confirm there are no kinks, twists, or sharp bends in the line.",
          "Check that clamps are fully open and not blocking fluid flow.",
          "Even a small pinch or bend can trigger an occlusion alarm."
        ]
      },
      {
        "title": "Inspect the Pump Door and Cassette",
        "instructions": [
          "Ensure the cassette or disposable set is seated correctly.",
          "Close the door fully — the pump may not start if it senses the door is ajar.",
          "Some alarms are triggered if the cassette isn’t aligned properly."
        ]
      },
      {
        "title": "Check the Fluid Bag or Syringe",
        "instructions": [
          "Make sure there is fluid in the bag or syringe.",
          "Confirm that the tubing is primed — air in the line can sometimes trigger an occlusion alarm."
        ]
      },
      {
        "title": "Observe the Pump Display and Alarm",
        "instructions": [
          "Look for any other messages on the display.",
          "Note the type of alarm shown (for example: occlusion, warning, or low fluid).",
          "Record what you see — this helps when documenting."
        ]
      },
      {
        "title": "Try a Simple Reset",
        "instructions": [
          "Stop the pump.",
          "Remove and reload the tubing.",
          "Close the door and restart the pump.",
          "If the alarm clears, the pump may resume infusion."
        ]
      }
    ],
    "documentation": {
      "CCR": {
        "Complaint": "Pump will not start infusion; occlusion alarm displayed.",
        "Cause": "Tubing and cassette inspected, tubing free of kinks, door fully closed, fluid present. Alarm persists. Suspected internal pump sensor issue.",
        "Resolution": "Removed pump from service, labeled out of service, sent for repair or tagged for bench evaluation."
      },
      "helpfulDetails": [
        "Tubing checked / replaced",
        "Door/cassette reseated",
        "Fluid bag checked / primed",
        "Alarm cleared / persisted",
        "Any unusual sounds or display behavior",
        "Final disposition (returned to service or sent for repair)"
      ]
    }
  }
]
