[
{
  "title": "Hillrom Progressa Hospital Bed - Bed Won’t Move / Functions Intermittently",
  "description": "Guide for troubleshooting a Hillrom Progressa hospital bed that fails to respond, moves intermittently, or stops functioning.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-wont-move.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Verify Power Connection",
      "instructions": "Confirm the bed is plugged into a live outlet or that its battery is charged. Check that the bed’s power cord is intact and fully seated. Why: Intermittent function is often caused by loose connections or depleted batteries."
    },
    {
      "title": "Check Bed Control Handset and Panel",
      "instructions": "Inspect the handset for visible damage, frayed wires, or stuck buttons. Test all functions to see if some movements work while others don’t. Why: A malfunctioning handset can mimic pump failure."
    },
    {
      "title": "Inspect Fuses and Circuit Breakers",
      "instructions": "Locate and check the bed’s internal fuses or reset any circuit breakers on the bed. Why: A blown fuse can prevent the pump from running or limit certain functions."
    },
    {
      "title": "Observe Mechanical Movement",
      "instructions": "Ensure no bed rails, linens, or accessories are obstructing actuator movement. Check that wheels are properly locked/unlocked depending on intended movement. Why: Mechanical obstructions can prevent the bed from moving even if the pump is working."
    },
    {
      "title": "Test Battery (if applicable)",
      "instructions": "If the bed has a battery pack, verify charge using the built-in indicator. Swap with a known-good battery if available. Why: Weak batteries often cause intermittent operation or slow movement."
    },
    {
      "title": "Listen for Pump Motor Activation",
      "instructions": "Press a function button and listen for any motor sound. No sound may indicate electrical/pump failure. Why: Confirms whether the issue is electrical or mechanical."
    },
    {
      "title": "Inspect Wiring and Connections",
      "instructions": "Check cables between the pump, handset, and motor assembly for loose or disconnected plugs. Why: Disconnected or damaged wires are a common cause of intermittent operation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed fails to respond to handset commands; functions intermittently.",
      "Cause": "Bed confirmed plugged in; handset buttons tested; no visible obstructions; fuses intact; pump motor silent.",
      "Resolution": "Bed removed from service, labeled Out of Service, and sent for repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified live",
    "Handset tested, buttons observed",
    "Fuses/circuit breakers checked",
    "Battery indicator checked",
    "Bed movement obstruction inspected",
    "Motor activation attempted, no sound heard",
    "Final device status: Out of Service"
  ]
},
  {
  "title": "Hillrom Progressa Bed Scale Inaccurate or Won’t Zero",
  "description": "Guide for troubleshooting inaccurate or non-zeroing scales on Hillrom Progressa hospital beds.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-scale.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Verify Bed Placement",
      "instructions": "Ensure the bed is fully on a flat, hard surface. Uneven flooring or partially on a rug can affect the scale reading."
    },
    {
      "title": "Check for Obstructions",
      "instructions": "Remove any items under or near the bed wheels or frame that may interfere with the scale sensors."
    },
    {
      "title": "Confirm Bed is Empty",
      "instructions": "No mattress accessories, trays, or patient equipment should be on the bed during zeroing."
    },
    {
      "title": "Engage Zeroing Function",
      "instructions": "Press the bed’s scale “Zero” or “Tare” button according to the bed’s user interface. Observe if the scale completes the zeroing process."
    },
    {
      "title": "Check Wheel Locks",
      "instructions": "Ensure all bed wheels are fully locked. Bed movement during weighing can cause unstable readings."
    },
    {
      "title": "Inspect Display and Connections",
      "instructions": "Confirm the display panel is properly seated and free of error messages. Check cables connecting the scale sensors to the control module for loose connections."
    },
    {
      "title": "Try a Known Weight",
      "instructions": "Place a known weight (e.g., a calibration weight or similar) on the bed to verify scale function."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed scale shows inaccurate readings or fails to zero.",
      "Cause": "Bed on uneven surface; zeroing fails; wheel locks engaged; connections verified but no improvement.",
      "Resolution": "Bed removed from service, labeled Out of Service, sent for repair."
    }
  },
  "helpfulDetails": [
    "Floor type and condition under the bed",
    "Wheel lock status",
    "Display error messages",
    "Steps attempted to zero",
    "Known weight testing results",
    "Final bed status"
  ]
},
  {
  "title": "Hillrom Progressa Air Mattress Not Inflating / Pressure Alarms",
  "description": "Troubleshoot air mattress inflation issues and pressure alarms on Hillrom Progressa hospital beds with external checks and safe escalation.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-air-mattress.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Verify Bed Power",
      "instructions": "Ensure the bed is plugged into a functional outlet. Check the power switch on the bed’s control panel. Why: The mattress pump requires stable power; intermittent or no power prevents inflation."
    },
    {
      "title": "Check Control Panel Settings",
      "instructions": "Confirm the bed’s mode is set correctly (e.g., therapy mode vs. standard). Verify that the correct patient weight and pressure settings are selected. Why: Incorrect settings can prevent the pump from inflating or trigger alarms."
    },
    {
      "title": "Inspect Mattress Connections",
      "instructions": "Ensure all air hoses are securely connected to the mattress ports. Look for kinks, pinches, or obstructions in the tubing. Why: Even a small leak or disconnected tube can prevent proper inflation."
    },
    {
      "title": "Examine Mattress for Leaks or Damage",
      "instructions": "Visually inspect the mattress surface and seams for punctures or tears. Perform a gentle press on the mattress while listening for hissing sounds. Why: Leaks prevent the mattress from maintaining pressure and trigger alarms."
    },
    {
      "title": "Check Pump and Hose Function",
      "instructions": "Verify that the pump is running when inflation is initiated. Listen for abnormal sounds like grinding or irregular motor operation. Swap hoses with a known working mattress if available. Why: Ensures the pump is capable of delivering air and the hose is not faulty."
    },
    {
      "title": "Reset the Bed System",
      "instructions": "Power off the bed, wait 30–60 seconds, and power it back on. Why: Clears transient faults or software glitches in the control system."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Air mattress not inflating; low-pressure alarm displayed.",
      "Cause": "Hose connections loose and kinked; no power interruption detected.",
      "Resolution": "Reconnected and straightened hoses; verified bed powered on; mattress inflated properly; alarm cleared."
    }
  },
  "helpfulDetails": [
    "Outlet tested with a known device",
    "Bed power switch operational",
    "Mattress hose connections inspected",
    "Alarm codes observed",
    "Mattress surface condition",
    "Pump sounds or vibration",
    "Final device status (inflates/does not inflate)"
  ]
},
  {
  "title": "Hillrom Progressa Bed - Side Rail Controls Not Responding",
  "description": "Guide for troubleshooting unresponsive side rail controls on a Hillrom Progressa bed, focusing on external checks before internal repair.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-side-rails.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure the Bed Is Powered",
      "instructions": "Verify the bed is plugged into a live outlet. Check that the main power switch on the bed (usually near the footboard) is in the ON position. Side rail controls rely on the bed’s main power; a disconnected or switched-off power source will render them inactive."
    },
    {
      "title": "Check the Battery Backup (if equipped)",
      "instructions": "If the bed uses a battery backup, confirm the battery is charged. A completely drained battery can prevent the side rails from responding."
    },
    {
      "title": "Inspect the Control Cable Connection",
      "instructions": "Side rail controls typically connect via a cable to the bed frame. Ensure the connector is fully seated and not damaged. Look for visible wear, bent pins, or frayed wires. Loose or damaged connections are a common cause of unresponsive controls."
    },
    {
      "title": "Test the Nurse/Bedside Control Panel",
      "instructions": "Attempt to operate the bed using the central control or nurse handset. If the bed responds here but not the side rail, the issue is isolated to the side rail control."
    },
    {
      "title": "Clean the Side Rail Buttons",
      "instructions": "Dust or debris can interfere with button contact. Wipe the controls gently with a damp cloth (no solvents). Physical contamination can prevent electrical contact inside the control buttons."
    },
    {
      "title": "Check for Lockout Mode",
      "instructions": "Some Progressa beds have a side rail lockout feature. Verify lockout is not engaged; consult bed labeling or quick guide indicators."
    },
    {
      "title": "Restart the Bed Electronics",
      "instructions": "If safe, power the bed down for 30 seconds, then power back on. Observe if side rail controls respond after reboot."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Side rail controls do not respond when pressed; patient cannot adjust bed.",
      "Cause": "Control cable fully seated but side rail buttons remain unresponsive; central control responds normally.",
      "Resolution": "Bed powered down and re-checked; if still unresponsive, removed from service and labeled Out of Service; service request submitted."
    }
  },
  "helpfulDetails": [
    "Outlet and power verified",
    "Battery status checked",
    "Central control function tested",
    "Side rail buttons cleaned",
    "Lockout mode checked",
    "Bed status: Out of Service"
  ]
},
  {
  "title": "Hillrom Progressa Hospital Bed – Brake or Steering System Faults",
  "description": "Guide for addressing brake or steering faults on a Hillrom Progressa bed, focusing on external causes first.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-brake-or-steering-faults.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Verify Patient Safety",
      "instructions": "Ensure the bed is not occupied or the patient has been safely transferred if troubleshooting requires moving the bed. This prevents accidental injury during manipulation of brakes or wheels."
    },
    {
      "title": "Check Brake Engagement",
      "instructions": "Inspect each wheel to ensure brakes are fully engaged. Manually press the brake pedals and attempt to gently move the bed. Uneven engagement may indicate a misaligned brake or mechanical obstruction."
    },
    {
      "title": "Inspect Wheels and Casters",
      "instructions": "Look for debris, hair, or bedding caught in the casters. Check that all wheels rotate freely when brakes are released. A jammed wheel can cause steering resistance and false brake fault alerts."
    },
    {
      "title": "Check Steering Lock / Directional Caster Function",
      "instructions": "For beds with directional casters, ensure they pivot freely. Verify that the steering lock mechanism (if present) is fully disengaged."
    },
    {
      "title": "Examine Electronic Brake Sensor (if equipped)",
      "instructions": "If the bed has electronic brake sensors, confirm the connectors at the wheels are seated properly. Look for visible damage to wiring harnesses or sensors."
    },
    {
      "title": "Test Bed on Flat Surface",
      "instructions": "Place the bed on a flat, even surface. Test braking and steering while observing for inconsistencies or fault messages. Faults that only occur on certain floor types may indicate caster or sensor sensitivity."
    },
    {
      "title": "Cycle Power (Electronic Beds Only)",
      "instructions": "Disconnect power briefly (unplug AC or remove battery if safe). Reconnect and observe if faults clear. This resets sensor systems without requiring internal repair."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed reports “Brake Fault” on control panel and is difficult to maneuver.",
      "Cause": "Observed debris in rear caster and partial brake pedal engagement; sensors appeared functional after visual inspection.",
      "Resolution": "Cleared debris, fully engaged brakes, and cycled bed power; fault cleared. Bed returned to service."
    }
  },
  "helpfulDetails": [
    "Floor surface during testing",
    "Number of wheels with obstruction or resistance",
    "Alarm or error messages displayed",
    "Visual condition of brake pedals and casters",
    "Any unusual sounds when engaging brakes"
  ]
}
]
