[
  {
  "title": "BD Alaris Infusion Pump - Occlusion Alarms",
  "description": "Guide to troubleshooting occlusion alarms on BD Alaris infusion pumps, focusing on external causes before assuming internal failure.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-occlusion.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Move the patient to an alternative infusion line if possible. Do not attempt troubleshooting on an active patient infusion unless it is safe to pause or clamp the line."
    },
    {
      "title": "Check the Tubing Path",
      "instructions": "Inspect the entire length of the IV tubing for kinks, bends, or pinches. Ensure the tubing is not trapped under bed rails or medical equipment. A kinked or compressed line is the most common cause of occlusion alarms."
    },
    {
      "title": "Verify Pump Cassette Seating",
      "instructions": "Open the pump door and check that the cassette is fully seated and locked. Reseat the cassette if necessary; an unseated cassette can trigger occlusion alarms."
    },
    {
      "title": "Check the Tubing Connections",
      "instructions": "Ensure that all connectors, Y-sites, and Luer locks are secure and tight. Inspect for partial disconnections, clogged filters, or air bubbles that may impede flow."
    },
    {
      "title": "Assess the Infusion Set",
      "instructions": "Confirm that the correct infusion set is loaded according to pump specifications. Some sets have flow sensors that detect backpressure; using an incorrect set may trigger false occlusion alarms."
    },
    {
      "title": "Examine the Pump and Pressure Sensor Area",
      "instructions": "Look for any visible obstructions or residue in the area where tubing contacts the pump mechanism. Clean or replace the tubing if necessary—never disassemble the pump internals yourself."
    },
    {
      "title": "Check Pump Settings and Alarms",
      "instructions": "Verify the programmed flow rate and pressure limits are appropriate. High flow rates or sensitivity settings may cause nuisance occlusion alarms."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump alarming occlusion despite no visible obstruction.",
      "Cause": "Tubing kinked under bedrail and cassette slightly unseated.",
      "Resolution": "Repositioned tubing, reseated cassette, verified alarm cleared, pump returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet and pump placement checked.",
    "Cassette properly seated.",
    "Tubing inspected for kinks, bends, or clogs.",
    "Pressure alarm history and flow rate settings reviewed.",
    "Final device status: returned to service or labeled OOS if unresolved."
  ]
}
]
