[
{
  "title": "Hillrom Progressa Hospital Bed - Bed Won’t Move / Functions Intermittently",
  "description": "Guide for troubleshooting a Hillrom Progressa hospital bed that fails to respond, moves intermittently, or stops functioning.",
  "assetType": "Hospital Bed",
  "manufacturer": "Hillrom",
  "model": "Progressa",
  "url": "guides/hillrom-progressa-wont-move.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Verify Power Connection",
      "instructions": "Confirm the bed is plugged into a live outlet or that its battery is charged. Check that the bed’s power cord is intact and fully seated. Why: Intermittent function is often caused by loose connections or depleted batteries."
    },
    {
      "title": "Check Bed Control Handset and Panel",
      "instructions": "Inspect the handset for visible damage, frayed wires, or stuck buttons. Test all functions to see if some movements work while others don’t. Why: A malfunctioning handset can mimic pump failure."
    },
    {
      "title": "Inspect Fuses and Circuit Breakers",
      "instructions": "Locate and check the bed’s internal fuses or reset any circuit breakers on the bed. Why: A blown fuse can prevent the pump from running or limit certain functions."
    },
    {
      "title": "Observe Mechanical Movement",
      "instructions": "Ensure no bed rails, linens, or accessories are obstructing actuator movement. Check that wheels are properly locked/unlocked depending on intended movement. Why: Mechanical obstructions can prevent the bed from moving even if the pump is working."
    },
    {
      "title": "Test Battery (if applicable)",
      "instructions": "If the bed has a battery pack, verify charge using the built-in indicator. Swap with a known-good battery if available. Why: Weak batteries often cause intermittent operation or slow movement."
    },
    {
      "title": "Listen for Pump Motor Activation",
      "instructions": "Press a function button and listen for any motor sound. No sound may indicate electrical/pump failure. Why: Confirms whether the issue is electrical or mechanical."
    },
    {
      "title": "Inspect Wiring and Connections",
      "instructions": "Check cables between the pump, handset, and motor assembly for loose or disconnected plugs. Why: Disconnected or damaged wires are a common cause of intermittent operation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed fails to respond to handset commands; functions intermittently.",
      "Cause": "Bed confirmed plugged in; handset buttons tested; no visible obstructions; fuses intact; pump motor silent.",
      "Resolution": "Bed removed from service, labeled Out of Service, and sent for repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified live",
    "Handset tested, buttons observed",
    "Fuses/circuit breakers checked",
    "Battery indicator checked",
    "Bed movement obstruction inspected",
    "Motor activation attempted, no sound heard",
    "Final device status: Out of Service"
  ]
}
]
