[
{
        "title": "Welch Allyn Connex 6000 Series – Touchscreen Calibration Off / Dead Spots",
        "description": "Structured troubleshooting guide for touchscreen misalignment or dead spots on a Connex 6000 Series monitor.",
        "assetType": "Vital Signs Monitor",
        "manufacturer": "Welch Allyn",
        "model": "Connex 6000 Series",
        "url": "guides/welch-allyn-connex6000-touchscreen.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Check for Obstructions or Contamination",
            "instructions": "Inspect the screen for dirt, dried disinfectant residue, moisture, or debris. Clean the screen using an approved disinfectant wipe. Allow the screen to fully dry before testing. Ensure no plastic film, tape, labels, or screen protectors are present."
          },
          {
            "title": "Confirm the Monitor Is Not Frozen",
            "instructions": "Press multiple areas of the screen. Attempt to access different menus. Observe whether the display is updating normally or appears stuck. If the screen is frozen but powered on, proceed to a power cycle."
          },
          {
            "title": "Power Cycle the Monitor",
            "instructions": "Turn the monitor off. Wait at least 10 seconds. Power the monitor back on. Allow the unit to complete a full boot sequence before testing touch response."
          },
          {
            "title": "Check for Visible Screen Damage",
            "instructions": "Inspect for cracks, impact points, pressure marks, or discoloration. Lightly touch various areas and document where input is not detected. Note if touches register in the wrong location (misalignment)."
          },
          {
            "title": "Observe and Document the Behavior Pattern",
            "instructions": "Determine whether the issue is: Consistent dead zones in specific areas. Random intermittent non-response. Consistent touch offset (pressing one location activates another area). Complete non-response. Document any on-screen error messages or unusual behavior."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Touchscreen not responding correctly; dead spots on right side of screen.”",
            "Cause": "“Screen cleaned and dried. Unit power cycled. No visible cracks. Touch input remains unresponsive in upper-right quadrant. Suspected touchscreen digitizer failure.”",
            "Resolution": "“Removed from service, labeled Out of Service, sent for repair.” / “Tagged for Clinical Engineering bench evaluation.”"
          }
        },
        "helpfulDetails": [
          "Screen cleaned and dried",
          "Power cycle performed",
          "Specific areas not responding",
          "Misalignment observed (yes/no)",
          "Visible cracks or pressure damage",
          "Screen frozen prior to reboot (yes/no)",
          "Final disposition (returned to service or sent for repair)"
        ]
      },
{
        "title": "Welch Allyn Connex 6000 Series – NIBP Failure / Leaky Hose / Transducer Drift",
        "description": "Step-by-step guide for Clinical Engineering to troubleshoot NIBP errors caused by hose leaks or transducer drift on the Connex 6000 Series.",
        "assetType": "Vital Signs Monitor",
        "manufacturer": "Welch Allyn",
        "model": "Connex 6000 Series",
        "url": "guides/welch-allyn-connex6000-nibp.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Inspect the NIBP Hose",
            "instructions": "Ensure the hose connecting the cuff to the monitor is fully seated at both ends. Examine the hose for cracks, holes, kinks, or wear. Replace the hose if any visible damage or leaks are detected. Even a small leak can prevent proper inflation and trigger an NIBP error."
          },
          {
            "title": "Check the Cuff and Connections",
            "instructions": "Confirm the cuff is the correct size for the patient. Verify the cuff tubing is fully inserted and the hook/Velcro is secure. Inspect the bladder for tears or leaks. A poorly seated or damaged cuff can cause failed or inaccurate readings."
          },
          {
            "title": "Verify the Module / Transducer Seating",
            "instructions": "Ensure the NIBP module is fully inserted in the monitor. Check connector pins for cleanliness, corrosion, or damage. Look for visible moisture or debris around the module. Loose or misaligned transducers can cause drift or persistent errors."
          },
          {
            "title": "Observe the Display",
            "instructions": "Note any error codes (e.g., “NIBP Fail,” “Low Pressure,” “Leak Detected”). Record whether the error occurs immediately or intermittently. Documenting these details helps Clinical Engineering track recurring issues."
          },
          {
            "title": "Try a Simple Reset",
            "instructions": "Remove the cuff and hose from the patient. Power cycle the monitor. Reconnect the hose and cuff, then attempt another measurement. If successful, the issue may have been a temporary connection or seating problem."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If NIBP measurements still fail after completing the above steps, you have already checked the most common and easily verified causes: Hose integrity, Cuff correctness and placement, Module/transducer connections, Simple reset. The issue is now likely internal (transducer drift, module malfunction, or sensor calibration issue) and cannot be resolved at the bedside. Next Steps: Remove the monitor from clinical service. Clearly label it as Out of Service. Send it for repair or bench evaluation."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "NIBP measurement failed; error displayed.",
            "Cause": "Hose inspected and intact, cuff verified, module seated correctly. Measurement still fails. Suspected transducer drift or internal module fault.",
            "Resolution": "Removed monitor from service, labeled Out of Service, sent for repair. Tagged for bench evaluation by CE."
          }
        },
        "helpfulDetails": [
          "Hose checked/replaced",
          "Cuff verified/replaced",
          "Module reseated",
          "Error cleared/persisted",
          "Any visible damage, moisture, or debris",
          "Final device disposition (returned to service or sent for repair)"
        ]
      },
        {
  "title": "Welch Allyn SureTemp Plus 692 Thermometer - Won’t Power On / Random Shutdowns",
  "description": "Guide to troubleshoot power-on failures and random shutdowns in the Welch Allyn SureTemp Plus 692 thermometer, focusing on external causes before assuming internal failure.",
  "assetType": "Thermometer",
  "manufacturer": "Welch Allyn",
  "model": "SureTemp Plus 692",
  "url": "guides/welch-allyn-suretemp-plus-692-power.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Check Battery Condition",
      "instructions": "Remove the battery from the thermometer. Inspect for corrosion, leakage, or swelling. Replace with a fully charged, compatible battery if needed."
    },
    {
      "title": "Inspect Battery Contacts",
      "instructions": "Ensure the contacts inside the battery compartment are clean and free of debris. Lightly clean contacts with a dry cloth or a pencil eraser if corrosion is present."
    },
    {
      "title": "Test with a Known Good Battery",
      "instructions": "Insert a new or verified fully charged battery. Power on the thermometer."
    },
    {
      "title": "Check Power Adapter (if using AC/charging)",
      "instructions": "Verify the AC adapter is rated correctly for the device. Confirm outlet functionality by testing with another device. Inspect adapter and cable for fraying or damage."
    },
    {
      "title": "Inspect Thermometer Housing",
      "instructions": "Check for signs of physical damage or moisture ingress. Ensure the unit is not excessively hot or cold."
    },
    {
      "title": "Reset the Device (if applicable)",
      "instructions": "Some SureTemp 692 models allow a power reset by removing batteries for 1–2 minutes. Reinsert batteries and power on."
    },
    {
      "title": "Observe Operation",
      "instructions": "Power on and monitor for stability. Note any pattern of shutdowns (immediately after powering on, during measurement, or randomly)."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Thermometer will not power on or randomly shuts down during use.",
      "Cause": "Battery contacts were corroded and original battery was weak.",
      "Resolution": "Cleaned battery contacts, replaced with a fully charged battery, device powers on consistently."
    }
  },
  "helpfulDetails": [
    "Battery type and voltage",
    "Presence of any corrosion or leakage",
    "AC adapter voltage and outlet tested",
    "Environmental conditions (temperature, humidity)",
    "Any error codes displayed",
    "Final device status after troubleshooting"
  ]
},
        {
  "title": "Welch Allyn SureTemp Plus 692 Thermometer – Inaccurate Temperature Readings",
  "description": "Guide for troubleshooting inaccurate readings on Welch Allyn SureTemp Plus 692 thermometers, focusing on external causes before assuming internal failure.",
  "assetType": "Thermometer",
  "manufacturer": "Welch Allyn",
  "model": "SureTemp Plus 692",
  "url": "guides/welch-allyn-suretemp-plus-692-inaccurate-readings.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Verify Probe Type and Compatibility",
      "instructions": "Ensure the correct probe is attached (oral, rectal, or axillary). Incompatible or damaged probes can produce inaccurate readings."
    },
    {
      "title": "Inspect Probe Covers",
      "instructions": "Check that probe covers are intact and properly seated. A torn, loose, or reused cover can cause false readings."
    },
    {
      "title": "Check Device Calibration and Recent Verification",
      "instructions": "Review the last calibration or verification date. If overdue, follow facility procedure for recalibration."
    },
    {
      "title": "Test on Known Reference Temperature",
      "instructions": "Use a calibration check source (e.g., water bath or calibration simulator) to verify accuracy. This helps isolate whether the issue is the thermometer or technique."
    },
    {
      "title": "Check Battery / Power Status",
      "instructions": "Low batteries can sometimes cause erratic readings. Replace batteries if low and retest."
    },
    {
      "title": "Examine Probe for Physical Damage or Contamination",
      "instructions": "Look for cracks, debris, or dried fluid on the probe tip. Clean per manufacturer instructions; do not immerse in liquid beyond specifications."
    },
    {
      "title": "Ensure Proper Measurement Technique",
      "instructions": "Follow correct placement and timing instructions per patient site. Patient movement or improper placement can skew readings."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Thermometer giving readings 1–2°C higher than expected on multiple patients.",
      "Cause": "Probe covers intact; device cleaned; calibration overdue; low battery noted.",
      "Resolution": "Replaced batteries, verified readings against calibration source. Out-of-spec readings persisted; device removed from service and labeled OOS for repair."
    }
  },
  "helpfulDetails": [
    "Probe type used (oral/rectal/axillary)",
    "Probe cover integrity",
    "Battery level",
    "Calibration check results",
    "Temperature readings compared to reference source",
    "Device cleaning status",
    "Final device status (removed, repaired, returned to service)"
  ]
},
        {
  "title": "Welch Allyn SureTemp Plus 692 - Thermometer Won’t Take a Reading / Stuck on 'LO' or 'HI'",
  "description": "Guide to troubleshoot a SureTemp Plus 692 thermometer that fails to take readings or displays 'LO'/'HI'.",
  "assetType": "Thermometer",
  "manufacturer": "Welch Allyn",
  "model": "SureTemp Plus 692",
  "url": "guides/welch-allyn-suretemp-plus-692-stuck-on-lo-hi.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Verify Correct Probe and Probe Cover",
      "instructions": "Ensure you are using a Welch Allyn-approved disposable probe cover on the appropriate probe. Using incorrect or no cover can cause inaccuracies or failed readings.\nConfirm the correct probe type (oral/axillary or rectal) is installed for the intended measurement site."
    },
    {
      "title": "Check Probe Seating and Connection",
      "instructions": "Remove the probe from the probe well and then firmly reseat it until it clicks.\nInspect the probe cable and connector for damage, kinks, or corrosion.\nA poorly seated or damaged probe often prevents valid readings."
    },
    {
      "title": "Inspect Ambient Conditions",
      "instructions": "Make sure the thermometer and probe are within their operating temperature range. If the ambient temperature is too low or too high, the device may display an error instead of reading. Move the device into a normal room environment and allow it to stabilize for a few minutes."
    },
    {
      "title": "Battery Check",
      "instructions": "Weak batteries can cause erratic behavior or failure to complete prediction cycles. Replace all three AA batteries with fresh alkaline batteries and retry."
    },
    {
      "title": "Try a New or Known‑Good Probe",
      "instructions": "If available, swap in a different Welch Allyn probe and well assembly. Probe thermistors can fail or drift, leading to LO/HI readings; a good probe will isolate whether the probe assembly or the main unit is at fault."
    },
    {
      "title": "Confirm Proper Measurement Technique",
      "instructions": "Ensure the probe is in firm contact with the patient’s tissue and held steadily during the measurement cycle.\nIf taking axillary temperatures, the arm should be snug against the body to minimize ambient air exposure."
    },
    {
      "title": "Attempt a Cycle Reset",
      "instructions": "Eject the probe from the well and then reinsert it. This can sometimes “reset” the measurement cycle and clear transient errors."
    },
    {
      "title": "Check for Device Security States",
      "instructions": "Model 692 has security features that can disable operation (e.g., temperature count exhausted) showing messages rather than temperatures. Refer to the manual if SEC or other security indicators appear."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reports that the SureTemp Plus 692 displays “LO”/“HI” and fails to complete a temperature reading.",
      "Cause": "Verified poor probe contact, out‑of‑range ambient conditions, and low batteries were ruled out; error remained after trying a known‑good probe and fresh batteries.",
      "Resolution": "Unit removed from service, labeled Out of Service, and sent to authorized service center for repair."
    }
  },
  "helpfulDetails": [
    "Alarm behavior",
    "Probe type used",
    "Battery status",
    "Environmental conditions",
    "Final device status"
  ]
}
]
