[
 {
        "title": "Philips V60 Ventilator - Fails Self-Test / Leak Detected",
        "description": "Provides a structured Clinical Engineering approach to troubleshoot a leak detected during self-test on a Philips V60 ventilator.",
        "assetType": "Ventilator",
        "manufacturer": "Philips",
        "model": "V60",
        "url": "guides/philips-v60-leak-fail.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Check the Patient Circuit and Tubing",
            "instructions": "Ensure all connections are fully seated. Inspect for cracks, holes, or loose fittings. Verify the circuit is properly attached to the ventilator outlet. Reason: Even a small gap can cause a leak detection during self-test."
          },
          {
            "title": "Inspect the Exhalation Port and Filter",
            "instructions": "Confirm the exhalation port is installed correctly. Check the filter is present, seated properly, and unobstructed. Look for moisture buildup or blockages. Reason: Improper installation or obstruction can trigger a leak error."
          },
          {
            "title": "Check the Humidifier (If Installed)",
            "instructions": "Ensure the humidifier chamber is seated correctly and intact. Inspect tubing connections for tightness and leaks. Reason: Humidifier leaks are a common cause of self-test failure."
          },
          {
            "title": "Inspect the Mask or Test Plug",
            "instructions": "If a mask is attached, ensure a proper seal. If running a self-test without a patient, verify the test plug or circuit cap is secure. Reason: Any open patient interface will cause the ventilator to detect a leak."
          },
          {
            "title": "Perform a Simple Reset",
            "instructions": "Power the ventilator off. Re-seat the patient circuit, exhalation port, and humidifier connections. Power the ventilator back on and rerun the self-test. Reason: Resetting can clear temporary errors caused by connection issues."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the ventilator continues to fail the self-test after completing all external checks: The most common causes have been ruled out. The issue is likely internal (e.g., valve failure, internal leak). Next Steps: Remove the ventilator from clinical service. Clearly label it as Out of Service. Send for repair or bench evaluation. Clinical Engineering Note: Knowing when to stop is an essential part of proper troubleshooting and patient safety."
          },
          {
            "title": "Clinical Use Tip",
            "instructions": "Do not troubleshoot on an active patient; move the patient to another ventilator if possible. Only run self-tests when safe and with no patient attached or appropriately capped. Ensure all bedside staff are aware that the ventilator is being evaluated."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Ventilator fails self-test; leak detected.",
            "Cause": "Patient circuit, exhalation port, and humidifier inspected and reseated. No visible damage noted. Self-test continues to fail with leak detected. Suspected internal leak or valve failure.",
            "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
          }
        },
        "helpfulDetails": [
          "Circuit inspected or replaced",
          "Exhalation port reseated",
          "Humidifier chamber checked",
          "Self-test result (pass/fail)",
          "Visible damage or moisture",
          "Final device disposition (returned to service or sent for repair)"
        ]
      },
{
        "title": "Philips V60 Ventilator - Fails Self-Test / Flow Sensor Error",
        "description": "Structured Clinical Engineering troubleshooting guide for Philips V60 ventilator flow sensor errors or self-test failures.",
        "assetType": "Ventilator",
        "manufacturer": "Philips",
        "model": "V60",
        "url": "guides/philips-v60-flow-error.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Inspect the Patient Circuit",
            "instructions": "Ensure all tubing connections are secure and fully seated. Check for cracks, holes, or loose fittings. Confirm there are no kinks or obstructions. Why: Even a small leak or disconnection can trigger a flow sensor error."
          },
          {
            "title": "Check the Flow Sensor Module",
            "instructions": "Locate the flow sensor (usually near the patient connection or ventilator port). Verify it is properly installed and seated. Inspect for visible damage, moisture, or condensation. Why: A loose or wet sensor prevents accurate flow readings."
          },
          {
            "title": "Verify Humidifier and Additional Circuit Components",
            "instructions": "Ensure the humidifier is seated correctly and tubing is fully connected. Check other inline devices (filters, adapters) for leaks or added resistance. Why: Extra resistance or leaks can trigger flow sensor alarms."
          },
          {
            "title": "Observe the Ventilator Display",
            "instructions": "Note the error code and any accompanying messages. Document the error for Clinical Engineering tracking."
          },
          {
            "title": "Attempt a Simple Reset",
            "instructions": "Power off the ventilator. Reseat the circuit and flow sensor connections. Power on and rerun the self-test. Why: Sometimes a simple reseating clears false errors."
          },
          {
            "title": "If the Flow Sensor Error Persists",
            "instructions": "After completing the above steps, if the ventilator still reports a flow sensor error: Common external causes have been ruled out. The issue is likely internal (flow sensor module, electronics, or calibration). Next steps: Remove the ventilator from clinical service. Label as Out of Service. Send for repair or bench evaluation."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Ventilator fails self-test; flow sensor error.",
            "Cause": "Circuit and flow sensor inspected and reseated, humidifier checked, no visible damage. Error persists. Suspected internal flow sensor or electronics issue.",
            "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
          }
        },
        "helpfulDetails": [
          "Circuit inspected or replaced",
          "Flow sensor reseated",
          "Humidifier and inline devices checked",
          "Error cleared or persisted",
          "Any visible damage, moisture, or condensation",
          "Final disposition (returned to service or sent for repair)"
        ]
      }
]
