[
  {
  "title": "BD Alaris Infusion Pump - Occlusion Alarms",
  "description": "Guide to troubleshooting occlusion alarms on BD Alaris infusion pumps, focusing on external causes before assuming internal failure.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-occlusion.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Move the patient to an alternative infusion line if possible. Do not attempt troubleshooting on an active patient infusion unless it is safe to pause or clamp the line."
    },
    {
      "title": "Check the Tubing Path",
      "instructions": "Inspect the entire length of the IV tubing for kinks, bends, or pinches. Ensure the tubing is not trapped under bed rails or medical equipment. A kinked or compressed line is the most common cause of occlusion alarms."
    },
    {
      "title": "Verify Pump Cassette Seating",
      "instructions": "Open the pump door and check that the cassette is fully seated and locked. Reseat the cassette if necessary; an unseated cassette can trigger occlusion alarms."
    },
    {
      "title": "Check the Tubing Connections",
      "instructions": "Ensure that all connectors, Y-sites, and Luer locks are secure and tight. Inspect for partial disconnections, clogged filters, or air bubbles that may impede flow."
    },
    {
      "title": "Assess the Infusion Set",
      "instructions": "Confirm that the correct infusion set is loaded according to pump specifications. Some sets have flow sensors that detect backpressure; using an incorrect set may trigger false occlusion alarms."
    },
    {
      "title": "Examine the Pump and Pressure Sensor Area",
      "instructions": "Look for any visible obstructions or residue in the area where tubing contacts the pump mechanism. Clean or replace the tubing if necessary—never disassemble the pump internals yourself."
    },
    {
      "title": "Check Pump Settings and Alarms",
      "instructions": "Verify the programmed flow rate and pressure limits are appropriate. High flow rates or sensitivity settings may cause nuisance occlusion alarms."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump alarming occlusion despite no visible obstruction.",
      "Cause": "Tubing kinked under bedrail and cassette slightly unseated.",
      "Resolution": "Repositioned tubing, reseated cassette, verified alarm cleared, pump returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet and pump placement checked.",
    "Cassette properly seated.",
    "Tubing inspected for kinks, bends, or clogs.",
    "Pressure alarm history and flow rate settings reviewed.",
    "Final device status: returned to service or labeled OOS if unresolved."
  ]
},
  {
  "title": "BD Alaris Infusion Pump – Door Won’t Latch / “Close Door” Error",
  "description": "Troubleshooting guide for BD Alaris infusion pump door latch issues and persistent Close Door errors using logical external checks before escalation.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-door-latch.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the pump is actively infusing, transfer the patient to another pump before troubleshooting. Do not force the door closed while connected to a patient. This prevents therapy interruption or cassette damage."
    },
    {
      "title": "Power Cycle the Pump",
      "instructions": "Remove from AC power. Turn the pump OFF. Wait 10–15 seconds. Power back ON. A software glitch can occasionally cause a false “Close Door” message even when the latch is engaged."
    },
    {
      "title": "Remove and Reinstall the IV Set",
      "instructions": "Open the door fully. Remove the tubing/cassette completely. Inspect for twisted tubing, improper cassette seating, and plastic warping. Reinstall per proper loading procedure. Improperly seated tubing is the most common cause of door latch errors."
    },
    {
      "title": "Inspect the Door Latch Mechanism",
      "instructions": "Visually inspect the latch hook, the latch receiver, and spring tension. Look for cracks, bent plastic, broken latch tab, and weak or no spring tension. Do not disassemble the door. If the latch does not “snap” into place firmly, the mechanical latch may be worn."
    },
    {
      "title": "Check for Debris or Obstruction",
      "instructions": "Inspect the door channel and latch area. Look for dried medication, tape residue, label fragments, and cracked plastic pieces. Clean gently with approved cleaning solution if contamination is present. Debris can prevent the door sensor from recognizing a closed state."
    },
    {
      "title": "Verify Door Alignment",
      "instructions": "With no tubing installed, close the door slowly. Observe alignment between latch and receiver. Ensure the door sits flush with the pump body. If the door appears uneven or requires pressure to align, hinge wear or structural damage may be present."
    },
    {
      "title": "Check for “Close Door” Message Without Mechanical Issue",
      "instructions": "If the door latches firmly, the door sits flush, and no visible damage exists but the error persists, this suggests door sensor failure, internal switch misalignment, or main board input issue. These are not field-repairable at the department level."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports pump displays ‘Close Door’ and infusion will not start. Door appears shut.",
      "Cause": "IV set improperly seated, preventing latch from fully engaging. No mechanical damage observed.",
      "Resolution": "Reseated tubing properly, confirmed firm latch engagement. Performed operational test. Pump functioning normally."
    }
  },
  "helpfulDetails": [
    "Was tubing installed during testing?",
    "Did latch click firmly?",
    "Was door flush with housing?",
    "Any visible cracks?",
    "Debris present?",
    "Error cleared after reseating?",
    "Final functional status"
  ]
},
  {
  "title": "BD Alaris Infusion Pump – Air-in-Line Alarms",
  "description": "Troubleshooting repeated or unexpected air-in-line alarms on a BD Alaris infusion pump using a structured, external-first approach.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-air-in-line.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the pump is actively infusing, pause the infusion. Move the patient to a backup pump if therapy cannot be safely interrupted. Do not troubleshoot while medication is actively infusing unless clinically appropriate."
    },
    {
      "title": "Inspect the IV Bag or Fluid Container",
      "instructions": "Confirm the bag is not empty or nearly empty. Ensure the spike is fully seated in the bag port. Check for air entering through a loose connection. Why this matters: Low fluid levels or loose spikes are common causes of air introduction."
    },
    {
      "title": "Inspect the Tubing from Bag to Pump",
      "instructions": "Look for visible air bubbles in the tubing. Check for loose luer connections. Ensure there are no cracks in the tubing. Verify all clamps are open and fluid is flowing freely. If air is present: Re-prime the tubing per facility protocol. Replace the tubing if repeated bubbles appear."
    },
    {
      "title": "Check the Pump Segment in the Mechanism",
      "instructions": "Open the pump door and inspect the cassette/administration set section. Confirm tubing is fully seated in the channel. Ensure the tubing is not twisted or misaligned over the air sensor. Close the door firmly until it latches. Why this matters: Misalignment over the ultrasonic air sensor can falsely trigger alarms."
    },
    {
      "title": "Inspect the Air Sensor Area",
      "instructions": "Look for dried fluid, tape residue, or debris in the air detection area. Clean the exterior sensor area with approved disinfectant (avoid excessive moisture). Do not disassemble the pump."
    },
    {
      "title": "Replace the Administration Set",
      "instructions": "If alarms continue: Replace the entire IV set with a new one. Fully prime the new tubing before loading. This rules out micro-fractures or manufacturing defects in the tubing."
    },
    {
      "title": "Test the Pump Off-Patient",
      "instructions": "Load a properly primed new set. Run fluid into a test receptacle. Observe for recurring air alarms. If the alarm persists under controlled testing, the issue may be internal."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nurse reports repeated air-in-line alarms during infusion despite full IV bag.",
      "Cause": "Visible air bubbles noted in tubing due to incomplete priming. Tubing replaced and properly primed. No further alarms observed during functional test.",
      "Resolution": "Replaced administration set, re-primed line, verified proper seating in pump channel. Performed off-patient functional test. Pump returned to service."
    }
  },
  "helpfulDetails": [
    "Was outlet tested (if using module system)?",
    "Tubing replaced?",
    "Alarm reproducible off-patient?",
    "Sensor area cleaned?",
    "Any visible air observed?",
    "Final operational status"
  ]
},
  {
  "title": "BD Alaris Infusion Pump – Battery Won’t Hold Charge / Won’t Power On",
  "description": "Troubleshooting guide for BD Alaris infusion pumps that will not power on, shut down when unplugged, or fail to hold a battery charge.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-battery.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure the Patient Is Safe",
      "instructions": "If the pump is in active use, move the patient to another functioning pump first. Do not troubleshoot a power issue on a live infusion. Patient safety always comes before device evaluation."
    },
    {
      "title": "Verify AC Power Source",
      "instructions": "Confirm the outlet is functional (test with another device or outlet tester). Avoid switched outlets. Ensure the hospital-grade power cord is fully inserted into both the wall outlet and the rear of the pump PC unit. If the pump is not truly receiving AC power, the battery will not charge and may appear defective."
    },
    {
      "title": "Check AC Indicator Lights",
      "instructions": "Confirm AC power indicator is illuminated on the pump. If no AC indicator is present, swap the power cord with a known-good cord and move to a known-good outlet. If AC is restored and the unit powers on, the issue was external (cord or outlet)."
    },
    {
      "title": "Attempt Power-On with AC Connected",
      "instructions": "Connect to verified AC power and attempt to power on the PC unit. If the unit does not power on even with confirmed AC power, suspect internal power supply failure and remove from service."
    },
    {
      "title": "Allow Adequate Charge Time",
      "instructions": "If the pump powers on while plugged in but shuts down when unplugged, leave the pump plugged into AC for at least 4–6 hours and confirm battery indicator increases appropriately. Deeply discharged batteries may require extended charge time before stabilizing."
    },
    {
      "title": "Inspect for Physical Clues",
      "instructions": "Check for excessive heat near battery area, burn smell, swollen casing, corrosion near battery compartment, and repeated low-battery alarms. Any of these suggest internal battery failure."
    },
    {
      "title": "Confirm Module Seating (if applicable)",
      "instructions": "Ensure infusion modules are properly seated to the PC unit. Remove and reseat modules and attempt power cycle again. Improper module seating can occasionally create abnormal power behavior."
    },
    {
      "title": "Perform Battery Test (If Supported by Facility Policy)",
      "instructions": "If your department performs battery capacity tests during PM, run a controlled discharge test and compare runtime to manufacturer specification. If runtime is significantly below spec, battery replacement is indicated. Do not open the unit unless authorized for internal battery replacement."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports pump shuts off when unplugged and will not run on battery.",
      "Cause": "Unit powered on with AC present but shut down immediately when disconnected. After 6-hour charge, battery runtime was less than 2 minutes. Battery failed capacity check.",
      "Resolution": "Removed from service. Replaced internal battery per department policy. Verified normal battery charge and runtime. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "Power cord swapped",
    "AC indicator status",
    "Battery charge indicator behavior",
    "Approximate runtime on battery",
    "Any heat or odor observed",
    "Final operational status"
  ]
},
  {
  "title": "BD Alaris Infusion Pump – Keypad / Buttons Not Responding",
  "description": "Troubleshooting guide for non-responsive or intermittently responsive keypad buttons on a BD Alaris infusion pump.",
  "assetType": "Infusion Pump",
  "manufacturer": "BD",
  "model": "Alaris",
  "url": "guides/bd-alaris-keypad.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure the Patient Is Safe",
      "instructions": "If the pump is actively infusing and the keypad is non-responsive, move the patient to another pump first. Do not attempt prolonged troubleshooting on an active infusion. Patient safety always comes first."
    },
    {
      "title": "Check Power Source and Stability",
      "instructions": "Confirm the pump is connected to a known-good hospital outlet. Verify the AC power indicator is illuminated. If on battery power, check battery status. Low voltage conditions or unstable power can cause the processor to partially lock up, making the keypad appear unresponsive. If needed, plug into AC and allow the pump to stabilize."
    },
    {
      "title": "Perform a Controlled Power Cycle",
      "instructions": "Turn the pump off completely. Wait 10–15 seconds. Power it back on. Observe whether the keypad responds during boot-up and whether all buttons register normally after restart. If functionality returns, the issue may have been a temporary software freeze."
    },
    {
      "title": "Check for Keypad Lockout or Software State",
      "instructions": "Confirm the pump is not in a clinical lock mode. Verify the pump is not stuck in an alarm state requiring acknowledgement. Check if the channel module is awaiting a specific input that limits keypad interaction. Some states limit button functionality intentionally."
    },
    {
      "title": "Inspect for Physical Obstruction or Damage",
      "instructions": "Examine the keypad surface closely for cracked overlay, fluid intrusion, sticky residue, or worn membrane areas. Lightly press each button and check for tactile feedback. If buttons feel flat, mushy, or inconsistent, the membrane may be failing."
    },
    {
      "title": "Reseat Modules (If Applicable)",
      "instructions": "If this is part of a modular Alaris system, power down the unit, remove and reseat the affected module, and inspect connection rails for debris or bent contacts. Poor communication between modules can mimic keypad failure."
    },
    {
      "title": "Observe Display Behavior",
      "instructions": "Determine whether the screen is responsive while the keypad is not, whether the screen is frozen as well, and whether alarm tones are functioning. If both display and keypad are unresponsive, suspect system-level freeze rather than keypad-only failure."
    },
    {
      "title": "Check for Signs of Fluid Intrusion",
      "instructions": "Inspect around the keypad seam. Check underside for corrosion or staining. Look for unusual odor or residue. Fluid damage is a common cause of keypad failure in infusion pumps. Do not open the unit in clinical areas."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reported keypad buttons not responding on Channel A. Unable to program infusion.",
      "Cause": "Power stable. Unit rebooted. Keypad remained non-responsive. Physical inspection revealed worn and partially lifted keypad membrane. No response to multiple button presses.",
      "Resolution": "Removed pump from service. Labeled Out of Service. Sent to vendor for keypad replacement and internal inspection."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Battery status at time of issue",
    "Reboot attempted (yes/no)",
    "Alarm behavior",
    "Display response status",
    "Physical condition of keypad",
    "Final device status"
  ]
}
]
