[
{
  "title": "Puritan Bennett 980 Ventilator – O₂ Sensor Errors / Low or Unstable FiO₂",
  "description": "Troubleshooting guide for O₂ sensor errors, low FiO₂ readings, or unstable oxygen delivery on the Puritan Bennett 980 ventilator using a logical external-first approach.",
  "assetType": "Ventilator",
  "manufacturer": "Puritan Bennett",
  "model": "980",
  "url": "guides/puritan-bennett-980-oxygen-sensor-errors.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the ventilator is alarming for low FiO₂ and the patient is connected, immediately assess the patient. Confirm SpO₂ and clinical stability. If oxygen delivery is questionable, transfer the patient to another ventilator or manual resuscitation device with verified O₂ source before continuing troubleshooting. Patient safety always comes first."
    },
    {
      "title": "Verify Oxygen Wall Source",
      "instructions": "Confirm the oxygen hose is firmly connected to the wall outlet and ventilator inlet. Check that the wall outlet is active and labeled correctly. Listen for gas flow and confirm normal pipeline pressure (typically ~50 psi in most facilities). Swap to a known-good wall outlet if unsure. Low or unstable pipeline pressure can cause inaccurate FiO₂ readings or O₂ supply alarms."
    },
    {
      "title": "Inspect the High-Pressure O₂ Hose",
      "instructions": "Check for kinks, cracks, or loose fittings. Swap the hose with a known-good hose if available. Ensure DISS fittings are tight and not cross-threaded. A leaking or partially restricted hose can cause fluctuating FiO₂ readings."
    },
    {
      "title": "Confirm Air Supply",
      "instructions": "Verify compressed air is connected and at proper pressure. Loss of air supply can cause incorrect blending and FiO₂ instability. The ventilator blends air and oxygen. If one source is unstable, FiO₂ readings will be unstable."
    },
    {
      "title": "Check for Active O₂ Sensor Calibration Alerts",
      "instructions": "Navigate to the ventilator’s sensor or calibration menu. Determine whether the error is calibration overdue, sensor drift, or sensor failure. If calibration is required, follow on-screen calibration procedure using room air or 100% O₂ as instructed. Ensure gas sources are stable during calibration. O₂ sensors naturally drift over time and require periodic calibration."
    },
    {
      "title": "Inspect the O₂ Sensor Module",
      "instructions": "Confirm the sensor is properly seated and connected. Check for moisture contamination or condensation. Inspect for physical damage or corrosion at the contacts. If the sensor is replaceable, install a known-good O₂ sensor and perform calibration after replacement. Do not attempt internal board-level repair."
    },
    {
      "title": "Check for Excessive Moisture in the System",
      "instructions": "Inspect water traps and expiratory filters. Look for heavy condensation in tubing near the sensor pathway. Replace saturated filters if needed. Moisture contamination can cause inaccurate O₂ readings."
    },
    {
      "title": "Verify Alarm Behavior",
      "instructions": "Document the exact alarm message. Determine whether FiO₂ is reading consistently low or fluctuating. Compare displayed FiO₂ to analyzer readings (if available). Note any unusual noises or gas flow irregularities. Using an external oxygen analyzer (if available) can help confirm whether the issue is sensor-related or actual delivery-related."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator alarming ‘O₂ Sensor Error’ with low FiO₂ reading at 40% despite 60% setting.",
      "Cause": "Found O₂ pipeline hose leaking at DISS fitting. FiO₂ unstable due to fluctuating oxygen pressure.",
      "Resolution": "Replaced high-pressure O₂ hose, verified 50 psi pipeline pressure, recalibrated O₂ sensor. FiO₂ stabilized and passed operational check."
    }
  },
  "helpfulDetails": [
    "Wall outlet tested",
    "Pipeline pressure verified",
    "O₂ hose swapped",
    "Air source verified",
    "Sensor recalibrated",
    "Sensor replaced (if applicable)",
    "Moisture inspected",
    "External analyzer comparison performed",
    "Final operational check completed",
    "Final device status (Returned to Service or Sent to Repair)"
  ]
},
  {
  "title": "Puritan Bennett 980 Ventilator – Flow Sensor Errors / Inaccurate Volumes",
  "description": "Troubleshooting guide for flow sensor errors and inaccurate volume readings on the Puritan Bennett 980 ventilator, focusing on external causes before internal failure.",
  "assetType": "Ventilator",
  "manufacturer": "Puritan Bennett",
  "model": "980",
  "url": "guides/philips-v60-flow-error.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Move the patient to another ventilator if needed. Do not troubleshoot flow sensor issues while actively ventilating a patient unless clinically cleared. Flow measurement errors can directly affect delivered volumes."
    },
    {
      "title": "Verify the Correct Circuit Is Installed",
      "instructions": "Confirm adult vs. pediatric circuit matches ventilator configuration. Confirm the circuit type selected in the ventilator settings matches the physical circuit. Incorrect circuit selection can result in inaccurate volume calculations and flow sensor alarms."
    },
    {
      "title": "Inspect the Flow Sensor Placement",
      "instructions": "Confirm the proximal flow sensor is installed in the correct orientation. Ensure arrows (if present) align with flow direction. Verify it is securely seated and fully connected. Loose or reversed sensors commonly cause flow sensor errors."
    },
    {
      "title": "Check for Moisture or Condensation",
      "instructions": "Inspect the flow sensor for visible moisture. Check the circuit for water accumulation. Drain water traps if present. Replace the flow sensor if contaminated. Moisture alters flow measurement and is one of the most common causes of inaccurate volumes."
    },
    {
      "title": "Inspect the Patient Circuit for Leaks",
      "instructions": "Check all connections (wye, humidifier, filters, HME, expiratory limb). Inspect for cracked tubing or loose fittings. Confirm the exhalation valve assembly is properly seated. Leaks can cause volume discrepancies and false flow alarms."
    },
    {
      "title": "Perform a System Check / Calibration",
      "instructions": "Remove the patient from the circuit. Perform a full ventilator self-test or extended system check. Ensure calibration completes without error. This allows the ventilator to recalibrate internal flow measurement baselines."
    },
    {
      "title": "Replace the Flow Sensor",
      "instructions": "If errors persist, install a new, known-good flow sensor. Re-run system check. Disposable sensors are consumables and can drift or fail over time."
    },
    {
      "title": "Evaluate Alarm Behavior",
      "instructions": "Document exact alarm message. Document intermittent vs. constant behavior. Document whether measured tidal volume matches set volume. Document any trending discrepancies. Consistent error after external checks may indicate internal sensing hardware or signal processing issues."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator displaying ‘Flow Sensor Error’ and reported tidal volumes lower than set volume during use in ICU.",
      "Cause": "Moisture observed inside proximal flow sensor. System check initially failed calibration. Sensor replaced and circuit drained.",
      "Resolution": "Replaced proximal flow sensor, drained condensation from circuit, performed full system check. Calibration passed and volume readings returned to normal. Ventilator returned to service."
    }
  },
  "helpfulDetails": [
    "Circuit type verified",
    "Moisture present (yes/no)",
    "Sensor replaced (yes/no)",
    "Leak test result",
    "Calibration pass/fail",
    "Alarm text",
    "Final operational status"
  ]
},
  {
  "title": "Puritan Bennett 980 Ventilator Fails Pre-Use Check / Circuit Leak Detected",
  "description": "Troubleshooting guide for Puritan Bennett 980 ventilator failing pre-use check due to circuit leak detection, focusing on external causes before internal pneumatic failure.",
  "assetType": "Ventilator",
  "manufacturer": "Puritan Bennett",
  "model": "980",
  "url": "guides/puritan-bennett-980-fails-pre-use-check.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm the ventilator is not connected to a patient. Ensure the ventilator is disconnected from the patient before performing any troubleshooting. Leak tests should only be performed with a test lung."
    },
    {
      "title": "Verify Correct Circuit Type Selection",
      "instructions": "Confirm that the selected circuit type in the ventilator settings matches the actual circuit installed (adult, pediatric, single limb vs dual limb). A mismatch can cause the ventilator to interpret normal compliance as a leak."
    },
    {
      "title": "Inspect Circuit Assembly from Ventilator to Test Lung",
      "instructions": "Check for loose connections at the inspiratory and expiratory ports. Check for partially seated tubing. Check for missing or cracked adapters. Check for improperly installed expiratory filters. Remove and firmly reseat each connection one at a time. Many leaks are caused by incomplete connections."
    },
    {
      "title": "Check the Test Lung and Port Cap",
      "instructions": "Ensure the test lung is intact (no tears or loose fittings). Ensure the patient wye is securely attached. Ensure any unused ports are capped. A cracked test lung or open sampling port will trigger a leak failure."
    },
    {
      "title": "Inspect the Humidifier Setup (If Installed)",
      "instructions": "If a humidifier is in line, confirm the chamber is properly seated. Check that water chamber seals are intact. Inspect for cracks in the chamber. Ensure temperature probe ports are capped if unused. Temporarily bypass the humidifier with a dry circuit if necessary to isolate the issue."
    },
    {
      "title": "Examine the Expiratory Filter and Valve Area",
      "instructions": "Ensure the expiratory filter is installed correctly. Ensure it is not cross-threaded. Ensure it is not damaged. Ensure it is fully tightened. A misaligned filter or debris at the seal can cause leak detection during self-test."
    },
    {
      "title": "Check for Cracked or Worn Tubing",
      "instructions": "Run your hand along the tubing and visually inspect for small splits near connectors. Inspect for stress cracks. Inspect for loose swivel joints. Swap with a known-good circuit if available to rule out disposable component failure."
    },
    {
      "title": "Repeat Pre-Use Check After Corrections",
      "instructions": "After reseating connections or replacing components, rerun the pre-use check. If the ventilator passes, return it to service."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator failed pre-use check with ‘Circuit Leak Detected’ alarm in ICU prior to patient use.",
      "Cause": "Loose connection identified at expiratory filter housing. Filter not fully seated, allowing leak during self-test.",
      "Resolution": "Reseated expiratory filter, verified tight seal, reran pre-use check. Ventilator passed all tests and returned to service."
    }
  },
  "helpfulDetails": [
    "Circuit type selected",
    "Humidifier in use (yes/no)",
    "Test lung condition",
    "Expiratory filter condition",
    "Alarm wording exactly as displayed",
    "Whether a known-good circuit was tested",
    "Final device status (Passed pre-use / Sent to repair)"
  ]
}
]
