[
  {
  "title": "Dräger Fabius Anesthesia Machine - Ventilator Fails Self-Test / Won’t Start",
  "description": "Guide for troubleshooting a Fabius anesthesia machine ventilator that fails self-test or won't start, focusing on external causes and patient safety.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-fails-self-test.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Power Supply and Connection",
      "instructions": "Confirm the machine is plugged into a verified hospital-grade outlet. Check that the main power switch is ON. Inspect the power cord for damage. Why it matters: Anesthesia machines will not complete self-tests without stable power."
    },
    {
      "title": "Check Backup Battery Status",
      "instructions": "If the machine uses a battery, verify it is charged and properly seated. Some Fabius models require a battery to be functional to pass self-test."
    },
    {
      "title": "Verify Gas Supply and Hoses",
      "instructions": "Ensure all medical gases (O₂, N₂O, air) are connected and pressure is within specification. Confirm that the hoses are properly attached and there are no leaks. Why it matters: Gas pressure sensors can prevent self-test completion if insufficient."
    },
    {
      "title": "Inspect Breathing Circuit and Accessories",
      "instructions": "Remove any patient circuit attachments, filters, or breathing bags that may obstruct the system. Ensure that the ventilator circuit is properly mounted and clamps are released. Why it matters: Obstructions or misaligned components can cause self-test failure."
    },
    {
      "title": "Check for Active Alarms or Fault Indicators",
      "instructions": "Review the display for messages that may indicate sensor errors, disconnected components, or service reminders."
    },
    {
      "title": "Power Cycle the Machine",
      "instructions": "Turn off the machine, wait 30–60 seconds, and restart. Why it matters: A simple reset often clears temporary faults in software or sensors."
    },
    {
      "title": "Run Self-Test with Minimal Configuration",
      "instructions": "Disconnect optional modules or accessories. Run self-test again to see if the issue persists."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails self-test and will not start; machine displays error code during pre-use check.",
      "Cause": "Power supply and gas connections verified; breathing circuit removed; self-test continues to fail, suggesting internal ventilator or sensor fault.",
      "Resolution": "Machine removed from service, labeled Out of Service, and sent for Dräger bench evaluation/service."
    }
  },
  "helpfulDetails": [
    "Outlet tested with another device.",
    "Power cord inspected.",
    "Gas pressures verified.",
    "Breathing circuit removed for testing.",
    "Display error codes captured (if any).",
    "Machine status: Out of Service pending repair."
  ]
}
]
