[
  {
  "title": "Dräger Fabius Anesthesia Machine - Ventilator Fails Self-Test / Won’t Start",
  "description": "Guide for troubleshooting a Fabius anesthesia machine ventilator that fails self-test or won't start, focusing on external causes and patient safety.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-fails-self-test.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Power Supply and Connection",
      "instructions": "Confirm the machine is plugged into a verified hospital-grade outlet. Check that the main power switch is ON. Inspect the power cord for damage. Why it matters: Anesthesia machines will not complete self-tests without stable power."
    },
    {
      "title": "Check Backup Battery Status",
      "instructions": "If the machine uses a battery, verify it is charged and properly seated. Some Fabius models require a battery to be functional to pass self-test."
    },
    {
      "title": "Verify Gas Supply and Hoses",
      "instructions": "Ensure all medical gases (O₂, N₂O, air) are connected and pressure is within specification. Confirm that the hoses are properly attached and there are no leaks. Why it matters: Gas pressure sensors can prevent self-test completion if insufficient."
    },
    {
      "title": "Inspect Breathing Circuit and Accessories",
      "instructions": "Remove any patient circuit attachments, filters, or breathing bags that may obstruct the system. Ensure that the ventilator circuit is properly mounted and clamps are released. Why it matters: Obstructions or misaligned components can cause self-test failure."
    },
    {
      "title": "Check for Active Alarms or Fault Indicators",
      "instructions": "Review the display for messages that may indicate sensor errors, disconnected components, or service reminders."
    },
    {
      "title": "Power Cycle the Machine",
      "instructions": "Turn off the machine, wait 30–60 seconds, and restart. Why it matters: A simple reset often clears temporary faults in software or sensors."
    },
    {
      "title": "Run Self-Test with Minimal Configuration",
      "instructions": "Disconnect optional modules or accessories. Run self-test again to see if the issue persists."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails self-test and will not start; machine displays error code during pre-use check.",
      "Cause": "Power supply and gas connections verified; breathing circuit removed; self-test continues to fail, suggesting internal ventilator or sensor fault.",
      "Resolution": "Machine removed from service, labeled Out of Service, and sent for Dräger bench evaluation/service."
    }
  },
  "helpfulDetails": [
    "Outlet tested with another device.",
    "Power cord inspected.",
    "Gas pressures verified.",
    "Breathing circuit removed for testing.",
    "Display error codes captured (if any).",
    "Machine status: Out of Service pending repair."
  ]
},
  {
  "title": "Dräger Fabius Alarm Failures / False Alarms",
  "description": "Guide for troubleshooting false alarms or alarm failures on Dräger Fabius anesthesia machines.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-alarm-failures.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Machine Power and Backup",
      "instructions": "Ensure the machine is plugged into a verified working outlet and powered on. Check battery status if operating on internal battery."
    },
    {
      "title": "Inspect Alarm and Sensor Connections",
      "instructions": "Verify that all breathing circuits, O₂ sensors, pressure lines, and flow sensors are properly connected. Check that connectors are clean, dry, and free of damage."
    },
    {
      "title": "Check Gas Supply and Flow",
      "instructions": "Confirm that O₂, N₂O, and air supply lines are connected and pressure is within normal operating range. Verify that flowmeters are not blocked or leaking."
    },
    {
      "title": "Examine Breathing Circuit Setup",
      "instructions": "Ensure correct circuit type (adult, pediatric) is selected in the machine settings. Check for leaks or obstructions in the circuit and endotracheal tube connections."
    },
    {
      "title": "Confirm Alarm Configuration and Limits",
      "instructions": "Review the alarm limits set in the machine for O₂, CO₂, airway pressure, tidal volume, etc. Ensure that alarm mute buttons are not inadvertently engaged."
    },
    {
      "title": "Perform a Self-Test / System Check",
      "instructions": "Run the machine’s built-in self-test (Dräger Fabius includes an automated check). Observe any errors or warnings reported."
    },
    {
      "title": "Environmental Factors",
      "instructions": "Ensure the machine is not exposed to extreme temperatures, moisture, or electrical interference. Remove any nearby equipment that could interfere with sensors."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reports frequent false alarms and occasional alarm failures on the Fabius machine.",
      "Cause": "Upon inspection, some sensor connectors were loose, and alarm limits were improperly set.",
      "Resolution": "Reconnected sensors securely, verified all connections, reset alarm limits, ran self-test, and confirmed alarms functioning correctly."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes/No",
    "Sensor connections checked: Yes/No",
    "Alarm configuration verified: Yes/No",
    "Self-test completed: Yes/No",
    "Any unusual sounds or smells: Describe",
    "Final device status: Operational / OOS"
  ]
},
  {
  "title": "Dräger Fabius Anesthesia Machine - Low Oxygen Pressure / O₂ Flush Issues",
  "description": "Guide for troubleshooting low oxygen pressure or O₂ flush issues on a Dräger Fabius anesthesia machine.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-low-oxygen-pressure.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Oxygen Supply",
      "instructions": "Check that the oxygen cylinder or pipeline supply is full and turned on. Confirm the correct pressure at the machine inlet using the pressure gauge. Why it matters: Low or empty supply is the most common cause of low oxygen pressure alarms."
    },
    {
      "title": "Inspect Hoses and Connections",
      "instructions": "Visually inspect the oxygen hose from the source to the machine. Ensure all connections are tight and free of kinks, cracks, or leaks. Why it matters: Even small leaks can reduce pressure and prevent the O₂ flush from functioning properly."
    },
    {
      "title": "Check the Oxygen Flowmeter",
      "instructions": "Verify that the flowmeter knob is in the correct position. Ensure the flowmeter tube and bobbin move freely. Why it matters: Obstructions or misalignment can prevent proper flow and pressure."
    },
    {
      "title": "Test O₂ Flush Function",
      "instructions": "Press the O₂ flush button briefly. Observe whether the oxygen flows rapidly into the circuit. If the flush is weak or absent, note any unusual sounds or behavior. Why it matters: A faulty flush valve or blocked pathway may indicate internal components need servicing."
    },
    {
      "title": "Check for Machine Alarms or Messages",
      "instructions": "Review the display panel for any error messages related to oxygen supply or pressure. Follow any suggested external corrective actions listed by the machine."
    },
    {
      "title": "Power Cycle the Machine",
      "instructions": "Turn the machine off and back on per manufacturer instructions. Confirm if the low oxygen pressure alarm persists. Why it matters: Some sensors or valves may reset after power cycling."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Low oxygen pressure alarm and weak O₂ flush observed.",
      "Cause": "Oxygen cylinder was low and supply hose had a minor kink reducing flow.",
      "Resolution": "Replaced cylinder, straightened hose, verified O₂ flush function; machine returned to service."
    }
  },
  "helpfulDetails": [
    "Supply pressure at machine inlet",
    "Oxygen cylinder status (full/empty)",
    "Condition of hoses and connections",
    "Alarm type and behavior",
    "O₂ flush response (strong/weak/absent)",
    "Final machine status after troubleshooting"
  ]
}
]
