[
 {
        "title": "GE CARESCAPE Canvas Monitor – Power Issue",
        "description": "Structured Clinical Engineering guide for a GE CARESCAPE Canvas monitor that will not power on.",
        "assetType": "Patient Monitor",
        "manufacturer": "GE Healthcare",
        "model": "CARESCAPE Canvas",
        "url": "guides/ge-carescape-canvas-power.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the monitor is in clinical use: Transfer the patient to a functioning monitor first. Do not troubleshoot while the monitor is actively required for patient care. Confirm the device is safe to remove from service before proceeding."
          },
          {
            "title": "Verify AC Power at the Outlet",
            "instructions": "Confirm the monitor is connected to a known-working hospital-grade outlet. Test the outlet with a known-good device (lamp, outlet tester, etc.). If plugged into a power strip, isolation transformer, or UPS, verify that device is powered on and functioning. If available, try a different known-working wall outlet. Why this matters: Loss of upstream power is the most common and simplest cause of a “dead” monitor."
          },
          {
            "title": "Inspect and Reseat the Power Cord",
            "instructions": "Visually inspect the power cord for cuts or fraying, bent or damaged prongs, and loose connector ends. Reseat the cord firmly at the wall outlet and the rear AC inlet of the monitor. If available, swap with a known-good hospital-grade power cord and attempt to power on again. Why this matters: A loose or internally failed cord can mimic total device failure."
          },
          {
            "title": "Confirm the Rear Power Switch Position",
            "instructions": "Verify the rear power rocker switch is in the ON position. Then press the front power button. Do not assume the switch position without physically checking it."
          },
          {
            "title": "Observe for Any Signs of Activity",
            "instructions": "When attempting to power on, closely observe front LED indicators, brief screen flash, audible fan noise, or clicking sounds. Even minimal activity suggests partial power presence and helps narrow down whether the failure is complete or localized."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the monitor shows no indicator lights, no fan noise, no display activity, and no response with known-good outlet and power cord, then common external causes have been ruled out. At this point, the issue is likely internal (power supply board, internal fuse, or power distribution failure). Remove the monitor from service, label clearly as Out of Service, and send for repair or bench evaluation. Knowing when to stop prevents unnecessary downtime and protects patient safety. Escalation after logical checks is proper troubleshooting."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Monitor will not power on.",
            "Cause": "Unit does not power on with known-working outlet and known-good power cord. Rear switch verified ON. No indicator lights, fan noise, or display activity observed. Suspected internal power supply failure.",
            "Resolution": "Removed from service and tagged Out of Service. Sent to Biomed shop for bench evaluation. Dispatched for vendor repair."
          }
        },
        "helpfulDetails": [
          "Outlet tested (yes/no)",
          "Alternate outlet attempted",
          "Power cord swapped (yes/no)",
          "Rear switch position confirmed",
          "Indicator light behavior",
          "Fan noise present/absent",
          "Any unusual odor or heat",
          "Final device status (returned to service or sent for repair)"
        ]
      },
          {
        "title": "GE Healthcare MAC VU360 – Leads Not Detected / Noisy ECG",
        "description": "Structured ECG troubleshooting for lead-off messages and noisy waveform conditions.",
        "assetType": "Electrocardiograph (EKG) Machine",
        "manufacturer": "GE Healthcare",
        "model": "MAC VU360",
        "url": "guides/ge-mac-vu360-leads-noisy-ecg.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Check Electrode Placement and Skin Prep",
            "instructions": "Ensure electrodes are positioned according to standard ECG guidelines. Confirm the patient’s skin is clean, dry, and free of oils or lotion. If necessary, gently prep the skin to improve adhesion. Replace any dried, expired, or loose electrodes."
          },
          {
            "title": "Inspect Lead Wires and Connections",
            "instructions": "Verify each lead wire is firmly snapped onto the electrode. Check for loose, bent, or damaged connectors. Inspect the patient cable for cracks, exposed wires, or signs of strain. Confirm the trunk cable is securely connected to the device."
          },
          {
            "title": "Reduce Electrical Interference",
            "instructions": "Route ECG cables away from power cords and other electrical equipment. Ensure the patient is not touching metal surfaces. Minimize cable looping or tangling."
          },
          {
            "title": "Confirm Proper Lead Selection",
            "instructions": "Verify the correct lead set configuration (3-lead, 5-lead, or 10-lead). Ensure the selected mode matches the cable type in use."
          },
          {
            "title": "Test with Known-Good Cable",
            "instructions": "Swap the patient cable with a verified, known-good cable if available. Reconnect electrodes and reassess waveform quality."
          },
          {
            "title": "Perform Simulator Test",
            "instructions": "Connect an ECG simulator and run a standard rhythm simulation. If the waveform is stable and clear, the issue is likely external (electrodes or cable). If the simulator tracing remains noisy or leads are not detected, suspect an internal problem."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If leads remain undetected or the ECG remains noisy after completing the above steps, the issue may involve the patient cable assembly or internal acquisition board. Remove the unit from service. Label as Out of Service. Send for further diagnostic evaluation. Knowing when to stop is an essential part of proper troubleshooting."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Example: “Multiple leads not detected and ECG waveform very noisy.”",
            "Cause": "Example: “Loose/dried electrodes and intermittent patient cable connection causing lead-off detection and artifact.”",
            "Resolution": "“Replaced electrodes and secured cable connections. Tested with simulator — unit operating normally.” “Failed simulator test. Removed from service for further evaluation.”"
          }
        },
        "helpfulDetails": [
          "Electrode condition and type",
          "Cable and connector condition",
          "Simulator test results",
          "Specific leads affected",
          "Final device status"
        ]
      },
 {
  "title": "GE Carescape B450 – Won’t Power On / Random Shutdowns",
  "description": "Structured Clinical Engineering guide for a GE Healthcare B450 patient monitor that fails to power on or experiences random shutdowns.",
  "assetType": "Patient Monitor",
  "manufacturer": "GE Healthcare",
  "model": "B450",
  "url": "guides/ge-b450-power.html",
  "dateAdded": "2026-02-19",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Confirm the outlet is live using a known-working device. If connected via a power strip or extension cord, plug the monitor directly into the wall outlet. Why: Many power issues are caused by outlets or strips not supplying consistent voltage."
    },
    {
      "title": "Check Power Cord and Connections",
      "instructions": "Inspect the power cord for cuts, fraying, or bent prongs. Ensure the cord is fully seated in both the monitor and the wall outlet. Why: Loose or damaged cords are a common cause of power failures and intermittent shutdowns."
    },
    {
      "title": "Inspect Battery and Charging",
      "instructions": "Confirm the monitor battery is installed correctly and seated properly. If the battery is removable, check for swelling, leakage, or corrosion. Try powering the monitor with AC only (battery removed) to isolate battery vs. AC issues. Why: A failing battery can prevent startup or cause random shutdowns even when AC power is applied."
    },
    {
      "title": "Observe Power Indicators",
      "instructions": "Note LED behavior when attempting to power on: steady, blinking, or no light. Compare with monitor documentation to interpret indicator patterns. Why: LED status can indicate battery issues, AC failure, or internal faults."
    },
    {
      "title": "Attempt Soft Reset (If Supported)",
      "instructions": "Some B450 units have a reset procedure—usually holding the power button for a set duration. Only perform this if safe and per manufacturer guidance. Why: Temporary software glitches can sometimes prevent proper startup."
    },
    {
      "title": "Check Environmental Factors",
      "instructions": "Ensure monitor is not exposed to extreme temperatures, moisture, or liquids. Confirm ventilation is clear—overheating can cause shutdowns."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "After completing the above, if the monitor still won’t power on or shuts down randomly: Remove the monitor from service. Label it Out of Service. Send it for vendor repair or bench evaluation. Why: Continuing to troubleshoot internally without proper tools or schematics risks patient safety and further damage."
    },
    {
      "title": "Clinical Use Tip",
      "instructions": "Never troubleshoot a monitor while it is connected to a patient. If a patient requires monitoring, move them to another verified working monitor first. Only perform troubleshooting in a safe, non-patient environment."
    },
    {
      "title": "Work Order Documentation (CCR Method)",
      "instructions": "Complaint: “Monitor will not power on / randomly shuts down during use.” Cause: “Power cord inspected and seated properly. Battery removed and tested separately; LED indicator remains off. AC outlet verified as live. Environmental conditions normal. Issue persists.” Resolution: “Monitor removed from service, labeled Out of Service, and sent for vendor repair. Patient transferred to another monitor.”"
    },
    {
      "title": "Helpful Details to Include",
      "instructions": "Outlet tested with multimeter or known device. Power cord swapped or inspected. Battery removed/tested. LED behavior recorded. Monitor environment checked for temperature, moisture, and ventilation. Final status: Out of Service."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor will not power on / randomly shuts down during use.",
      "Cause": "Power cord inspected and seated properly. Battery removed and tested separately; LED indicator remains off. AC outlet verified as live. Environmental conditions normal. Issue persists.",
      "Resolution": "Monitor removed from service, labeled Out of Service, and sent for vendor repair. Patient transferred to another monitor."
    }
  },
  "helpfulDetails": [
    "Outlet tested with multimeter or known device",
    "Power cord swapped or inspected",
    "Battery removed/tested",
    "LED behavior recorded",
    "Monitor environment checked for temperature, moisture, and ventilation",
    "Final status: Out of Service"
  ]
},
          {
        "title": "GE MAC VU360 – Printer Issue – Not Printing / Poor Print Quality",
        "description": "Structured troubleshooting for a GE MAC VU360 ECG machine experiencing printer failures or poor print quality.",
        "assetType": "Electrocardiograph (EKG) Machine",
        "manufacturer": "GE Healthcare",
        "model": "MAC VU360",
        "url": "guides/ge-mac-vu360-printer.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the device is actively being used for patient testing, complete or transfer the study to another ECG machine before troubleshooting. Do not disassemble or manipulate the printer while connected to a patient."
          },
          {
            "title": "Confirm Printer Is Enabled",
            "instructions": "Access the system menu and verify the internal printer function is enabled. If disabled, enable the printer and initiate a controlled print test. This rules out configuration-related causes."
          },
          {
            "title": "Verify Paper Type and Installation",
            "instructions": "Open the printer compartment and confirm: Correct thermal ECG paper is installed. Paper is loaded in the proper orientation. Paper is not curled, faded, or contaminated. Thermal printers require proper paper orientation; incorrect loading will result in blank output."
          },
          {
            "title": "Inspect Paper Path and Compartment",
            "instructions": "Check for: Torn paper fragments. Dust buildup. Obstructions in the paper feed path. Gently clean with a dry lint-free cloth or compressed air. Do not use liquid cleaners on the thermal head."
          },
          {
            "title": "Check Print Density / Contrast Settings",
            "instructions": "Navigate to print settings and verify density is set to default or appropriate levels. If output is faint, increase density slightly and re-test. Reset to default if necessary to rule out user adjustment."
          },
          {
            "title": "Perform Printer Self-Test",
            "instructions": "Access the internal printer self-test through the system menu. Observe: Does paper feed properly? Is the test pattern clear and complete? Is output blank despite correct paper? If the self-test fails or prints poorly, this indicates likely internal printer or thermal head failure."
          },
          {
            "title": "Check for System Error Messages",
            "instructions": "Review the display for printer-related error codes. Document exact wording of the message. Do not attempt board-level repair based on codes; this is for documentation and escalation."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“ECG prints blank pages.” or “Printout is very faint and unreadable.”",
            "Cause": "“Printer enabled and correct thermal paper loaded. Density adjusted with no improvement. Printer self-test prints blank output. Suspected thermal print head failure.”",
            "Resolution": "“Removed unit from service and sent for repair.” or “Printer assembly replaced on bench. Self-test passed. Returned to service.”"
          }
        },
        "helpfulDetails": [
          "Paper type verified",
          "Paper orientation confirmed",
          "Density setting checked",
          "Printer self-test result",
          "Error messages displayed",
          "Paper feed behavior",
          "Final device status (returned to service or sent for repair)"
        ]
      },
{
        "title": "GE CARESCAPE B850 – Will Not Turn On",
        "description": "Basic power troubleshooting for a GE CARESCAPE B850 patient monitor.",
        "assetType": "Patient Monitor",
        "manufacturer": "GE Healthcare",
        "model": "B850",
        "url": "guides/ge-b850-power.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the monitor is in clinical use: transfer the patient to a functioning monitor first. Do not troubleshoot while the monitor is actively required for patient care. Confirm the device is safe to remove from service before proceeding."
          },
          {
            "title": "Verify AC Power at the Outlet",
            "instructions": "Confirm the monitor is connected to a known-working hospital-grade outlet. Test the outlet with a known-good device (lamp, outlet tester, etc.). If plugged into a power strip, isolation transformer, or UPS, verify that device is powered on and functioning. If available, try a different known-working wall outlet. Why this matters: Loss of upstream power is the most common and simplest cause of a “dead” monitor."
          },
          {
            "title": "Inspect and Reseat the Power Cord",
            "instructions": "Visually inspect the power cord for cuts, fraying, bent or damaged prongs, and loose connector ends. Reseat the cord firmly at the wall outlet and the rear AC inlet of the monitor. If available, swap with a known-good hospital-grade power cord and attempt to power on again. Why this matters: A loose or internally failed cord can mimic total device failure."
          },
          {
            "title": "Confirm the Rear Power Switch Position",
            "instructions": "Verify the rear power rocker switch is in the ON position. Then press the front power button. Do not assume the switch position without physically checking it."
          },
          {
            "title": "Observe for Any Signs of Activity",
            "instructions": "When attempting to power on, closely observe front LED indicators, brief screen flash, audible fan noise, or clicking sounds. Even minimal activity suggests partial power presence and helps narrow down whether the failure is complete or localized."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the monitor shows no indicator lights, no fan noise, no display activity, and no response with known-good outlet and power cord, then common external causes have been ruled out. At this point, the issue is likely internal (power supply board, internal fuse, or power distribution failure). Remove the monitor from service, label clearly as Out of Service, and send for repair or bench evaluation. Knowing when to stop prevents unnecessary downtime and protects patient safety. Escalation after logical checks is proper troubleshooting."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Monitor will not power on.",
            "Cause": "Unit does not power on with known-working outlet and known-good power cord. Rear switch verified ON. No indicator lights, fan noise, or display activity observed. Suspected internal power supply failure.",
            "Resolution": "Removed from service and tagged Out of Service. Sent to Biomed shop for bench evaluation. Dispatched for vendor repair."
          }
        },
        "helpfulDetails": [
          "Outlet tested (yes/no)",
          "Alternate outlet attempted",
          "Power cord swapped (yes/no)",
          "Rear switch position confirmed",
          "Indicator light behavior",
          "Fan noise present/absent",
          "Any unusual odor or heat",
          "Final device status (returned to service or sent for repair)"
        ]
      }
]
