[
{
  "title": "Kangaroo OMNI Feeding Pump – Air-in-Line Alarms",
  "description": "Structured Clinical Engineering troubleshooting guide for Kangaroo Omni Air-in-Line alarms.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo OMNI",
  "url": "guides/kangaroo-omni-pump-air-in-line.html",
  "dateAdded": "2026-02-18",
  "steps": [
    {
      "title": "Ensure the Patient Is Safe",
      "instructions": "Confirm the feeding has been paused appropriately and the patient is clinically stable. If needed, transition the patient to another feeding pump before continuing troubleshooting."
    },
    {
      "title": "Verify the Feeding Bag Is Not Empty",
      "instructions": "Check the formula bag. A nearly empty or empty bag is the most common cause of air entering the tubing. If empty, replace the bag and re-prime the set."
    },
    {
      "title": "Inspect the Tubing for Visible Air",
      "instructions": "Visually inspect the entire length of tubing from bag to patient. Look for: Air gaps. Large bubbles. Foam (common with certain formulas). Even small air pockets near the cassette can trigger the sensor."
    },
    {
      "title": "Re-Prime the Feeding Set",
      "instructions": "Use the pump’s prime function to fully purge air from the tubing. Ensure formula completely fills the tubing with no visible bubbles before reconnecting to the patient."
    },
    {
      "title": "Check Cassette Seating",
      "instructions": "Open the pump access panel and remove the feeding set cassette. Inspect for: Improper seating. Kinked tubing within the cassette path. Residual formula preventing proper alignment. Reseat the cassette firmly and close the panel completely."
    },
    {
      "title": "Inspect All Luer and Tubing Connections",
      "instructions": "Check for loose connections between: Feeding bag and tubing. Tubing and extension sets. Extension set and patient tube. Loose fittings can draw air into the line without visible leakage."
    },
    {
      "title": "Evaluate Formula Type and Foam",
      "instructions": "Some formulas produce foam during shaking or transport. If foam is present: Allow the bag to sit upright for several minutes. Avoid aggressive squeezing or shaking. Re-prime slowly."
    },
    {
      "title": "Swap the Feeding Set (If Needed)",
      "instructions": "If alarms persist after proper priming and inspection, replace the disposable feeding set. Micro-leaks or manufacturing defects can introduce air intermittently."
    },
    {
      "title": "Test the Pump Without a Patient",
      "instructions": "After corrections, run the pump briefly off the patient into a container to confirm the alarm does not recur before returning to service."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports pump alarming “Air in Line” repeatedly and feeding will not continue.",
      "Cause": "Air observed in tubing near cassette. Feeding bag nearly empty. Foam present in formula. or No visible air. Alarm persisted after re-priming. Suspected internal air sensor issue.",
      "Resolution": "Replaced feeding bag and fully re-primed tubing. Alarm cleared. Pump tested and returned to service. or Replaced feeding set and verified proper cassette seating. Alarm resolved. or Removed pump from service for further evaluation after repeated alarms with no visible air source."
    }
  },
  "helpfulDetails": [
    "Was the bag empty or low?",
    "Was visible air present?",
    "Was tubing re-primed?",
    "Was feeding set replaced?",
    "Cassette reseated?",
    "Formula type noted?",
    "Alarm behavior (continuous vs intermittent)?",
    "Final device status (returned to service or sent for repair)?"
  ]
},
        {
  "title": "Kangaroo OMNI Feeding Pump – Occlusion Alarms",
  "description": "Structured Clinical Engineering guide for troubleshooting occlusion alarms on the Kangaroo Omni feeding pump, focusing on external and easily verifiable causes.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo OMNI",
  "url": "guides/kangaroo-omni-pump-occlusion-alarms.html",
  "dateAdded": "2026-02-18",
  "steps": [
    {
      "title": "Ensure the Patient Is Safe First",
      "instructions": "Before troubleshooting, confirm the patient has been transitioned to an alternate feeding method or backup pump if continuous feeding is required. Do not troubleshoot on an actively dependent patient."
    },
    {
      "title": "Verify the Alarm Message",
      "instructions": "Confirm whether the alarm indicates upstream occlusion (feeding bag side) or downstream occlusion (patient side). This determines where you begin your inspection."
    },
    {
      "title": "Inspect the Administration Set Installation",
      "instructions": "Open the pump door and verify the correct Kangaroo Omni-compatible set is being used. Ensure the tubing is fully seated in the pump channel and there are no twists, misalignment, or tension in the tubing. Improper loading is one of the most common causes of occlusion alarms."
    },
    {
      "title": "Check for Kinks or Clamps",
      "instructions": "Trace the entire line from feeding bag through pump to patient. Look for closed roller clamps, kinked tubing, tubing caught in bed rails, or compression under the patient."
    },
    {
      "title": "Assess the Feeding Bag and Formula",
      "instructions": "Ensure the bag is properly vented if required. Confirm the formula is not excessively thick. Check for formula that has separated or clotted. High-viscosity formulas can trigger downstream occlusion alarms, especially at higher programmed rates."
    },
    {
      "title": "Verify Patient Tube Patency (Clinical Coordination Required)",
      "instructions": "Coordinate with nursing staff to confirm the feeding tube has been flushed per protocol and there is no suspected clog in the enteral tube. Clinical Engineering should not manipulate patient tubes directly unless policy allows and it is clinically appropriate."
    },
    {
      "title": "Review Pump Settings",
      "instructions": "Confirm programmed rate is appropriate and check for recent rate increases. Higher flow rates increase pressure and can trigger alarms in marginal setups."
    },
    {
      "title": "Test with a New Administration Set",
      "instructions": "If no visible restriction is found, replace the feeding set with a new one. Reprime and test operation using water (if off patient). Internal check valves in disposable sets can occasionally malfunction."
    },
    {
      "title": "Perform Functional Test Off Patient",
      "instructions": "With a test bag of water, run the pump at a moderate rate. Observe for recurring occlusion alarms. If alarms continue under test conditions with new tubing, internal pressure sensing or pump mechanism issues may be present."
    },
    {
      "title": "If the Problem Persists",
      "instructions": "If tubing, formula, setup, and patient-related causes have been ruled out, the issue is likely internal (pressure sensor calibration drift, drive mechanism resistance, or internal obstruction). Remove the device from service, label it Out of Service, and send for bench evaluation or authorized repair."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports feeding pump repeatedly alarming “Occlusion” and stopping feed. Example: “Unit reports Kangaroo Omni alarming occlusion every 5–10 minutes during continuous feed.”",
      "Cause": "Determined tubing kinked under bed rail / clogged feeding set / malfunctioning administration set / internal pump fault. Example: “Found downstream tubing kinked at bed frame causing back pressure.” or “Alarm persisted with new set and water test; suspect internal pressure sensing issue.”",
      "Resolution": "Corrected external cause or removed from service. Examples: “Replaced feeding set, reprime completed, tested normal operation.” “Adjusted tubing routing; no further alarms during 15-minute test.” “Removed from service and sent to vendor for evaluation.”"
    }
  },
  "helpfulDetails": [
    "Upstream or downstream alarm type",
    "Feeding rate programmed",
    "Formula type and viscosity",
    "Tubing replaced (yes/no)",
    "Test performed with water (yes/no)",
    "Alarm frequency",
    "Any unusual noise or mechanical resistance",
    "Final device status (Returned to Service / Sent to Repair)"
  ]
},
        {
  "title": "Kangaroo OMNI Feeding Pump – Set Not Recognized",
  "description": "Structured Clinical Engineering guide for a Kangaroo OMNI feeding pump displaying a 'Set Not Recognized' message.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo OMNI",
  "url": "guides/kangaroo-omni-pump-set-not-recognized.html",
  "dateAdded": "2026-02-18",
  "steps": [
    {
      "title": "Ensure Patient Safety",
      "instructions": "If feeding is active, transition the patient to another pump before troubleshooting. Do not troubleshoot while connected to a patient."
    },
    {
      "title": "Verify Correct Feeding Set",
      "instructions": "Confirm the set is approved for Kangaroo Omni use. Verify the set is not expired. Inspect the cassette for cracks, warping, or visible damage. Incompatible or damaged sets commonly trigger this error."
    },
    {
      "title": "Remove and Reinstall the Feeding Set",
      "instructions": "Fully remove the cassette from the pump. Reinsert it into the molded receptacle. Ensure it sits flush and fully engages the retention mechanism. Improper alignment prevents the internal sensor from recognizing the set."
    },
    {
      "title": "Inspect the Cassette Interface",
      "instructions": "Check for dried formula or debris inside the receptacle. Clean gently with an approved disinfectant wipe. Ensure no moisture enters the housing. Contamination can interfere with cassette detection."
    },
    {
      "title": "Power Cycle the Pump",
      "instructions": "Turn the pump off. Disconnect AC power. Wait 30 seconds. Restart the pump and retest."
    },
    {
      "title": "Install a New Feeding Set",
      "instructions": "Open a new compatible set. Install carefully and confirm proper seating. If the pump recognizes the new set, the original set was likely defective."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Pump displays ‘Set Not Recognized’ when attempting to start feeding.”",
      "Cause": "Disposable feeding set not fully seated in cassette receptacle. OR Defective disposable set. OR Suspected internal cassette recognition sensor failure after external checks completed.",
      "Resolution": "Removed and reinstalled feeding set. Verified proper seating and normal operation. OR Replaced disposable set with new compatible set. Pump functioning normally. OR Removed pump from service and sent for repair for suspected internal fault."
    }
  },
  "helpfulDetails": [
    "Feeding set type",
    "Lot number and expiration date",
    "Whether new set resolved issue",
    "Cassette alignment observation",
    "Debris found in receptacle",
    "Power cycle performed",
    "Final device status"
  ]
},
{
        "title": "Kendall SCD 700 Series - Display / Control Panel Malfunction",
        "description": "Structured Clinical Engineering approach for display or control panel malfunctions on Kendall SCD 700 Series units.",
        "assetType": "Sequential Compression Device (SCD)",
        "manufacturer": "Cardinal Health",
        "model": "Kendall SCD 700 Series",
        "url": "guides/kendall-scd700-display-control.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the device is actively being used on a patient: Transfer the patient to another functioning SCD unit first. Do not troubleshoot a malfunctioning control panel on an active patient unless therapy is confirmed safe and uninterrupted. Patient safety takes priority over equipment evaluation."
          },
          {
            "title": "Confirm the Unit Has Power",
            "instructions": "Verify the unit is plugged into a known good outlet. Confirm the power switch is in the ON position. Listen for internal startup sounds (pump initialization or fan noise). Observe any LED indicators. If there are no lights and no startup sounds, the issue may be power-related rather than display-related. Refer to the 'Will Not Turn On' troubleshooting process if needed. A blank screen is often a power issue."
          },
          {
            "title": "Assess Screen Visibility",
            "instructions": "Observe the screen closely in normal lighting. Shine a flashlight at an angle across the screen. Look for faint text or graphics. If text becomes visible under a flashlight, this strongly suggests backlight failure rather than full display failure. If the screen briefly lights and then goes dark, this may indicate a failing backlight or power regulation issue."
          },
          {
            "title": "Check for a Frozen Interface",
            "instructions": "Press multiple buttons. Observe whether indicator LEDs respond. Confirm whether sleeves continue inflating and cycling. If therapy continues but controls are unresponsive, this may indicate: Software logic freeze, Keypad membrane failure, Control board issue. If nothing responds at all, suspect a deeper display/control failure."
          },
          {
            "title": "Power Cycle the Unit",
            "instructions": "Turn the unit OFF. Unplug from the wall (if applicable). Wait at least 10 seconds. Restore power and allow full startup sequence. Temporary logic faults can cause display freezing or keypad lockout. A proper power cycle may restore normal function. Observe startup behavior carefully: Does the screen briefly flash? Is there a normal startup beep? Are partial segments visible? These details are important for documentation."
          },
          {
            "title": "Inspect for Physical Damage",
            "instructions": "Visually inspect the front panel: Cracks in the display window, Signs of liquid intrusion, Warping or pressure marks, Sticky or physically stuck buttons. Gently press each button to check for tactile feedback. Physical damage commonly causes intermittent or non-responsive controls."
          },
          {
            "title": "Check for Intermittent Behavior",
            "instructions": "With the unit powered on: Gently move the device. Lightly tap near the display area. Observe whether the screen flickers or partially returns. Intermittent flickering may indicate a loose internal ribbon cable or failing connection. Do not open the unit unless authorized and within scope of practice."
          },
          {
            "title": "If the Display or Controls Remain Malfunctioning",
            "instructions": "After completing the steps above, you have: Verified incoming power, Ruled out brightness/backlight visibility issues, Attempted power cycling, Checked for physical damage, Observed startup behavior, Confirmed therapy operation status. At this point, the issue is likely internal, such as: Display panel failure, Backlight failure, Keypad membrane failure, Internal control board malfunction, Ribbon cable connection issue. These are not bedside-correctable issues. The unit should be: Removed from service, Clearly labeled Out of Service, Sent for bench evaluation by Clinical Engineering."
          },
          {
            "title": "Clinical Use Tip",
            "instructions": "Never rely on a unit with a non-functional display or control panel for active therapy. If settings cannot be verified or adjusted, therapy parameters cannot be confirmed. Always transfer the patient to a functioning device before removing a malfunctioning unit from service."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Document what was reported by clinical staff. Examples: 'Display blank; unit powers on but no visible text.' 'Control buttons unresponsive; sleeves inflate but panel frozen.'",
            "Cause": "Document what you verified and observed. Examples: 'Power verified. Unit power cycled. No visible backlight or response from control panel. Suspected display/backlight failure.' 'Therapy running but control panel non-responsive after power cycle. Suspected internal control board or keypad failure.'",
            "Resolution": "Document the final action taken. Examples: 'Removed device from service; labeled Out of Service; sent to CE shop for bench evaluation.' 'Tagged Out of Service due to display/control malfunction; awaiting internal repair.'"
          }
        },
        "helpfulDetails": [
          "Outlet verified functional",
          "Startup beep present (yes/no)",
          "Screen completely blank or faint image visible",
          "Buttons responsive (yes/no)",
          "Therapy running despite display issue (yes/no)",
          "Visible physical damage present (yes/no)",
          "Unit removed from service (yes/no)",
          "Final device status"
        ]
      },
          {
        "title": "Kendall SCD 700 Series – Alarms Going Off Unnecessarily",
        "description": "Structured Clinical Engineering troubleshooting guide for frequent or unnecessary alarms on a Kendall SCD 700 Series Sequential Compression Device.",
        "assetType": "Sequential Compression Device (SCD)",
        "manufacturer": "Cardinal Health",
        "model": "Kendall SCD 700 Series",
        "url": "guides/kendall-scd700-alarms.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "Before manipulating tubing or sleeves: Confirm therapy can be safely paused. If the device is actively in use on a patient, coordinate with clinical staff. Do not troubleshoot aggressively while connected to a patient. Patient safety comes first."
          },
          {
            "title": "Identify the Exact Alarm Message",
            "instructions": "Read and document the exact alarm wording. Determine whether the alarm is constant or intermittent. Note which side (left/right) is indicated, if applicable. Precise wording helps determine whether the issue is leak-related, pressure-related, or sensor-related."
          },
          {
            "title": "Check All Tubing Connections",
            "instructions": "Disconnect and fully reseat all tubing connectors. Ensure connectors are firmly inserted. Gently tug to confirm secure seating. Loose or partially seated connectors are the most common cause of nuisance alarms."
          },
          {
            "title": "Inspect Tubing for Micro-Leaks or Kinks",
            "instructions": "Inspect the full length of tubing for: Hairline cracks, Pinholes, Soft spots, Sharp bends or kinks, Compression under bed rails or wheels. Even very small leaks can cause repeated leak or pressure alarms."
          },
          {
            "title": "Inspect Sleeves",
            "instructions": "Check sleeves for: Torn seams, Worn or weak Velcro, Uneven wrapping, Incorrect size. Ensure sleeves are wrapped snugly and evenly. Improper application can create inconsistent pressure readings and false alarms."
          },
          {
            "title": "Swap Sleeves and Tubing (Isolation Step)",
            "instructions": "If available, replace sleeves with a known-good set. You may also: Swap left and right sleeves. Swap tubing sets. Observe results: If the alarm follows the sleeve/tubing → Accessory issue. If the alarm stays on the same port → Possible internal valve or sensor issue. This step helps isolate accessory versus device failure."
          },
          {
            "title": "Observe Pump and Inflation Behavior",
            "instructions": "During operation, observe: Does the pump sound smooth and consistent? Do sleeves inflate and deflate fully? When does the alarm trigger (inflation, hold, or deflation)? Normal pump sound with full inflation often suggests minor leaks or sensor sensitivity rather than major pump failure."
          },
          {
            "title": "Power Cycle the Unit",
            "instructions": "Turn the unit off. Wait at least 10 seconds. Restart therapy. Temporary software or logic faults can occasionally cause nuisance alarms."
          },
          {
            "title": "Evaluate the Environment",
            "instructions": "Confirm: Tubing is not being repeatedly flexed or pulled. The unit is positioned securely. No condensation or fluid contamination is present at connectors. The device is not located where tubing is constantly stressed. Environmental factors can intermittently break the air seal and trigger alarms."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Repeated leak alarm despite tubing appearing fully connected.”",
            "Cause": "“Tubing reseated and sleeves swapped. Alarm persisted on right port. Suspected internal pressure sensor or valve issue.” “Alarm followed sleeve when swapped. Leak identified at sleeve seam.”",
            "Resolution": "“Replaced defective sleeve; unit tested and returned to service.” “Removed from service and sent for bench evaluation due to persistent pressure alarm.”"
          }
        },
        "helpfulDetails": [
          "Exact alarm message",
          "Intermittent or constant",
          "Which side affected",
          "Sleeves swapped (yes / no)",
          "Tubing replaced (yes / no)",
          "Pump sounds normal (yes / no)",
          "Power cycled (yes / no)",
          "Environmental factors observed",
          "Final device status"
        ]
      },
          {
        "title": "Kendall SCD 700 Series – Pressure Too Low or Inconsistent",
        "description": "Structured troubleshooting guide for low or inconsistent compression pressure on a Kendall SCD 700 Series.",
        "assetType": "Sequential Compression Device (SCD)",
        "manufacturer": "Cardinal Health",
        "model": "Kendall SCD 700 Series",
        "url": "guides/kendall-scd700-pressure-low.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "1. Confirm Therapy Mode and Active Cycle",
            "instructions": "Verify correct therapy mode (calf vs. thigh). Confirm therapy is actively running and not paused or in standby. Observe at least one full inflation/deflation cycle."
          },
          {
            "title": "2. Check Sleeve Application and Fit",
            "instructions": "Ensure sleeves are wrapped snugly and evenly. Confirm proper sleeve size for the patient. Verify hook-and-loop closures are fully secured. Check that bladders are aligned correctly with the limb."
          },
          {
            "title": "3. Inspect Tubing for Leaks or Obstructions",
            "instructions": "Examine entire tubing length for cracks, splits, or pinholes. Check for loose fittings at both ends. Look for kinks, sharp bends, or compression under bed rails or equipment. Inspect for partially disconnected quick-connect fittings."
          },
          {
            "title": "4. Reseat All Connections at the Ports",
            "instructions": "Fully disconnect and reconnect tubing at both device ports. Ensure connectors click or seat completely. Listen for escaping air during inflation. Gently move connectors while the unit is inflating to check for intermittent leaks."
          },
          {
            "title": "5. Swap Sleeves and Tubing",
            "instructions": "Swap left and right sleeves. Replace tubing with a known-good set if available. Observe results: If the issue follows the sleeve → sleeve likely leaking. If the issue follows the tubing → tubing defective. If the issue remains on the same device port → possible internal valve or channel issue."
          },
          {
            "title": "6. Listen to Pump Operation",
            "instructions": "During inflation: Pump sound should be smooth and consistent. No excessive strain, grinding, or rapid short cycling. No unusually loud or weak-sounding motor activity."
          },
          {
            "title": "7. Check for Alarms or Error Messages",
            "instructions": "Look for: Leak detected. Pressure fault. System error. Record the exact alarm wording for documentation."
          },
          {
            "title": "8. Compare Both Channels",
            "instructions": "Swap tubing between ports. Observe whether low pressure follows the tubing or remains with the device port. If the issue remains isolated to one port after accessory swaps, internal channel components are likely involved."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Compression pressure weak and inconsistent on left leg.”",
            "Cause": "“Sleeves and tubing inspected and swapped; issue remained on left port. Suspected internal valve or pump degradation.”",
            "Resolution": "“Removed device from service and sent for bench evaluation due to suspected internal pressure channel failure.”"
          }
        },
        "helpfulDetails": [
          "Side affected (left / right / both)",
          "Exact alarm message wording",
          "Sleeve size used",
          "Sleeve swapped: yes / no",
          "Tubing replaced: yes / no",
          "Pump audible and consistent: yes / no",
          "Leak heard at connections: yes / no",
          "Final device status (returned to service / sent to repair)"
        ]
      },
            {
        "title": "Kendall SCD 700 Series – One or More Sleeves Not Inflating",
        "description": "Structured troubleshooting guide for sleeve inflation problems on the Kendall SCD 700 Series Sequential Compression Device.",
        "assetType": "Sequential Compression Device (SCD)",
        "manufacturer": "Cardinal Health",
        "model": "Kendall SCD 700 Series",
        "url": "guides/kendall-scd700-sleeve-not-inflating.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Confirm the Unit Is Powered and Therapy Is Started",
            "instructions": "Verify the unit is powered on. Confirm there are no active alarms preventing therapy. Ensure therapy has been started (unit powered on alone does not initiate compression)."
          },
          {
            "title": "Check Sleeve and Tubing Connections",
            "instructions": "Confirm tubing is fully seated into the correct port. Push connectors firmly until fully engaged. Inspect for partially disconnected or loose fittings. Swap left and right ports to see if the issue follows the sleeve or remains with the port."
          },
          {
            "title": "Inspect the Tubing for Kinks or Damage",
            "instructions": "Follow the entire tubing length from unit to sleeve. Check for sharp bends or kinks. Ensure tubing is not pinched under bed rails, wheels, or mattress frames. Inspect for cracks, punctures, or separation at connection points."
          },
          {
            "title": "Inspect the Sleeves",
            "instructions": "Visually inspect for: Tears or punctures. Separated seams. Worn or ineffective Velcro. Improper wrapping. Ensure sleeves are wrapped snugly but not overly tight. Improper fit can prevent pressure buildup or cause uneven compression."
          },
          {
            "title": "Swap Sleeves to Isolate the Issue",
            "instructions": "Disconnect both sleeves. Connect the left sleeve to the right port and vice versa. Restart therapy and observe. If the issue follows the sleeve → the sleeve is likely defective. If the issue stays with the same port → suspect an internal valve or channel issue."
          },
          {
            "title": "Check for Alarm Messages",
            "instructions": "Document any alarm messages exactly as displayed, such as: Leak detected. Disconnected tubing. Pressure fault. Alarm wording helps determine whether the system is sensing a leak or failing to generate pressure."
          },
          {
            "title": "Listen for Pump Operation",
            "instructions": "Start therapy and listen carefully: Pump audible and cycling → air movement is occurring. Pump running but no inflation → possible internal valve or manifold issue. No pump sound → possible internal motor or control board issue. Avoid opening the device. Internal repair is not a bedside procedure."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the sleeves still do not inflate after completing all external checks, you have ruled out: Therapy not started. Loose or disconnected tubing. Kinked or damaged tubing. Defective sleeves. Alarm-related interruptions. The issue is likely internal, such as: Internal valve failure. Pump motor malfunction. Pressure sensor fault. Internal manifold leak. Remove the unit from service. Clearly label it “Out of Service”. Send for bench evaluation or repair."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“One sleeve not inflating; right leg receiving no compression.”",
            "Cause": "“Tubing and sleeve inspected. Swapped sleeves; issue followed right sleeve. Sleeve leaking.” or “Swapped sleeves and ports. Issue remained on left port. Suspected internal valve failure.”",
            "Resolution": "“Replaced defective sleeve; unit tested and returned to service.” or “Removed device from service and sent to shop for internal repair.”"
          }
        },
        "helpfulDetails": [
          "Which side affected (left/right/both)",
          "Exact alarm messages displayed",
          "Whether sleeves were swapped",
          "Whether issue followed sleeve or stayed with port",
          "Tubing condition (intact/kinked/damaged)",
          "Pump audible (yes/no)",
          "Final device status (returned to service or removed)"
        ]
      },
          {
        "title": "Kendall SCD 700 Series – Power Issue – Will Not Turn On",
        "description": "Structured troubleshooting approach for a Kendall SCD 700 Series that will not power on.",
        "assetType": "Sequential Compression Device (SCD)",
        "manufacturer": "Cardinal Health",
        "model": "Kendall SCD 700 Series",
        "url": "guides/kendall-scd700-power.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Confirm the AC Power Source",
            "instructions": "Verify the unit is plugged into a known live hospital-grade outlet. Test the outlet using a known-good device. If plugged into a power strip, bypass it and plug directly into the wall. Power source issues are the most common cause of a no-power complaint."
          },
          {
            "title": "Verify Power Cord Integrity",
            "instructions": "Inspect the entire length of the power cord: No cuts, frays, or crushed sections. No exposed wiring. Strain relief intact at both ends. Ensure the cord is fully seated at the device inlet. If damage is found, remove from service immediately. Do not attempt temporary fixes."
          },
          {
            "title": "Check the Power Switch",
            "instructions": "Place the power switch firmly in the ON position. Observe for: Any LED illumination. Audible click or startup tone. Momentary light flicker. A worn switch may mechanically move but fail electrically."
          },
          {
            "title": "Test with a Known-Good Outlet",
            "instructions": "Even if the first outlet tested good, relocate the device to a second verified outlet. This eliminates: Intermittent outlet failure. Tripped upstream breaker. Faulty wall plate wiring."
          },
          {
            "title": "If Equipped with Battery – Verify Battery Status",
            "instructions": "Some SCD 700 units may include battery capability. If applicable: Confirm battery is properly seated. Attempt power-up on battery alone. Swap with a known-good battery if available. A failed battery can sometimes prevent startup."
          },
          {
            "title": "Observe for Any Partial Signs of Life",
            "instructions": "Attempt to power the unit while observing closely for: Brief LED flash. Faint beeping. Relay clicking. Burning smell. Excess heat. Document exactly what occurs. Even brief activity provides useful diagnostic information."
          },
          {
            "title": "Do Not Open the Unit in Clinical Areas",
            "instructions": "Do not access internal fuses or service panels in patient care areas. If internal fuse or PCB failure is suspected: Stop troubleshooting. Escalate to bench evaluation. Internal access should only occur in a controlled CE environment."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the device remains completely unresponsive after: Verifying power source. Inspecting cord. Testing alternate outlet. Checking switch function. Evaluating battery (if applicable). The issue is likely internal (power supply board, internal fuse, PCB failure). At this point: Remove the device from service. Clearly label it Out of Service. Send for Clinical Engineering bench evaluation. Knowing when to stop is proper troubleshooting."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Kendall SCD 700 will not power on. No display or indicator lights.”",
            "Cause": "“Verified hospital-grade outlet functional. Tested alternate outlet. Power cord intact. Power switch engaged with no response. No LED activity. Suspect internal power supply or fuse failure.”",
            "Resolution": "“Removed from service. Labeled Out of Service. Sent to CE shop for bench evaluation.” / “Unit tagged and routed for internal power supply inspection.”"
          }
        },
        "helpfulDetails": [
          "Outlet tested (yes/no)",
          "Alternate outlet tested",
          "Battery tested or swapped",
          "Power switch behavior",
          "Indicator light behavior",
          "Any audible clicks or tones",
          "Any smell or heat noted",
          "Final device status"
        ]
      },
  {
  "title": "Cardinal Health Kangaroo ePump Feeding Pump - Occlusion / Air-in-Line Alarms",
  "description": "Guide to troubleshoot occlusion and air-in-line alarms on the Kangaroo ePump feeding pump, focusing on external causes before internal faults.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo ePump",
  "url": "guides/kangaroo-epump-occlusion.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Stop feeding and switch the patient to an alternate safe delivery method if needed. Never troubleshoot while feeding is actively occurring."
    },
    {
      "title": "Check Tubing and Connections",
      "instructions": "Verify the feeding set is properly seated in the pump cassette. Ensure all tubing clamps are open and tubing is not kinked, pinched, or twisted. Confirm the correct feeding set and syringe size are in use per the pump instructions. Reason: Occlusion and air alarms often occur due to tubing misalignment or mechanical restriction."
    },
    {
      "title": "Inspect the Pump Cassette",
      "instructions": "Remove the cassette and check for cracks, debris, or worn rollers. Reinsert securely, ensuring it clicks into position. Reason: Misseated or damaged cassettes can trigger false occlusion alarms."
    },
    {
      "title": "Check Feeding Formula and Syringe",
      "instructions": "Verify the formula viscosity is within pump specifications. Highly viscous formulas can trigger occlusion alarms. Inspect syringe for air bubbles and ensure it is properly primed. Reason: Air-in-line alarms are often caused by trapped air in the syringe or tubing."
    },
    {
      "title": "Prime the Line",
      "instructions": "Manually prime the tubing to remove any air before starting the pump. Ensure the line is fully filled with formula, no air pockets remain. Reason: Proper priming prevents air detection errors."
    },
    {
      "title": "Check Pump Settings and Pressure",
      "instructions": "Confirm that flow rate and volume settings match prescribed parameters. Reduce flow rate if alarms persist, as high resistance at high flow can trigger occlusion alarms."
    },
    {
      "title": "Inspect Electrical / Power Connections",
      "instructions": "Ensure the pump is plugged in or fully charged. Low battery conditions can occasionally cause erratic alarm behavior."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump triggers occlusion alarm when delivering 20 mL/hour feeding.",
      "Cause": "Tubing was kinked near the cassette; small air bubble detected in syringe line.",
      "Resolution": "Replaced tubing, primed line to remove air, reseated cassette; pump resumed normal operation."
    }
  },
  "helpfulDetails": [
    "Tubing type and lot number",
    "Syringe size and formula viscosity",
    "Flow rate and settings at alarm time",
    "Battery status and power source",
    "Any error codes displayed",
    "Final pump operation status after troubleshooting"
  ]
},
  {
  "title": "Cardinal Health Kangaroo ePump Feeding Pump - Battery / Power Issues",
  "description": "Guide for troubleshooting Kangaroo ePump feeding pump battery and power issues, focusing on external causes first.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo ePump",
  "url": "guides/kangaroo-epump-battery.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Verify External Power Source",
      "instructions": "Ensure the pump is connected to a known working AC outlet.\nCheck for tripped breakers or faulty outlets.\nWhy: If the outlet is dead, the pump cannot charge or operate."
    },
    {
      "title": "Inspect Power Cord and AC Adapter",
      "instructions": "Examine the power cord and adapter for cuts, frays, or bent prongs.\nSwap with a known good adapter if available.\nWhy: Damaged cords can prevent charging or intermittent power."
    },
    {
      "title": "Check Battery Seating",
      "instructions": "Remove the battery and reseat it firmly.\nEnsure contacts are clean, free of debris, and not corroded.\nWhy: Poor contact can prevent the pump from drawing power."
    },
    {
      "title": "Verify Battery Charge Level",
      "instructions": "Allow the pump to charge for the recommended minimum time (typically several hours).\nObserve battery indicator lights for charging status.\nWhy: A deeply discharged battery may need extended charging."
    },
    {
      "title": "Swap with Known Good Battery (if available)",
      "instructions": "Install a fully charged spare battery to see if the pump powers on.\nWhy: Confirms whether the battery or pump electronics are at fault."
    },
    {
      "title": "Inspect for Visible Damage",
      "instructions": "Look for signs of liquid exposure, cracks, or impact damage.\nWhy: External damage can cause internal power issues or short circuits."
    },
    {
      "title": "Perform Soft Reset (if recommended by manufacturer)",
      "instructions": "Follow the ePump manual procedure for reset or power cycle.\nWhy: Clears temporary errors that can prevent boot-up."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump will not turn on and shows battery empty.",
      "Cause": "Battery seated correctly but failed to hold charge; AC adapter verified working.",
      "Resolution": "Pump removed from service, labeled Out of Service, sent for repair/bench evaluation."
    }
  },
  "helpfulDetails": [
    "Outlet tested and functional",
    "AC adapter swapped and verified",
    "Battery inspected for corrosion or swelling",
    "Charging indicator behavior observed",
    "Pump response to soft reset",
    "Any unusual sounds or smells"
  ]
},
  {
  "title": "Kangaroo ePump Keypad / Touchscreen Problems",
  "description": "Guide to troubleshooting unresponsive or erratic touchscreen/keypad on the Kangaroo ePump feeding pump, emphasizing external checks before internal failure.",
  "assetType": "Feeding Pump",
  "manufacturer": "Cardinal Health",
  "model": "Kangaroo ePump",
  "url": "guides/kangaroo-epump-keypad.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Ensure the pump is properly plugged into a verified working outlet or fully charged battery. A weak or fluctuating power source can cause unresponsive or erratic keypad/touchscreen behavior."
    },
    {
      "title": "Inspect for Physical Obstructions or Contamination",
      "instructions": "Check the screen and keypad for moisture, dirt, or residue. Clean gently with a lint-free cloth and approved cleaning solution. Liquid spills or excessive debris can block touch response."
    },
    {
      "title": "Check Protective Covers or Cases",
      "instructions": "If the pump has a protective silicone or plastic overlay, remove it and test the keypad. Some covers can interfere with proper touch registration."
    },
    {
      "title": "Perform a Soft Reset",
      "instructions": "Turn the pump off, wait 10–15 seconds, then turn it back on. This can reset the touchscreen controller and clear minor software glitches."
    },
    {
      "title": "Test All Buttons and Touch Areas",
      "instructions": "Press each button and touch multiple areas of the screen. Confirm if the unresponsiveness is localized or affects the entire keypad."
    },
    {
      "title": "Inspect Connectors and Cables",
      "instructions": "Check the ribbon cable or connector between the keypad/touchscreen and main board (if accessible externally). Ensure it is seated properly and not damaged."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump touchscreen not responding, unable to start feeding.",
      "Cause": "Screen unresponsive after inspection; no visible damage or contamination; soft reset did not restore function.",
      "Resolution": "Pump removed from service, labeled Out of Service, sent for manufacturer evaluation."
    }
  },
  "helpfulDetails": [
    "Verify if the issue occurs on battery or AC power",
    "Note any screen flickering or ghost inputs",
    "Record if protective overlays were present",
    "Document if soft reset temporarily restored partial functionality"
  ]
}
]
