[
{
  "title": "Stryker Neptune Surgical Fluid Management System – “Canister Full” or Level Sensor Errors",
  "description": "Troubleshooting guide for Stryker Neptune units displaying false “Canister Full” or level sensor errors, focusing on external causes before internal escalation.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-canister-full.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm the unit is not actively connected to a patient before beginning troubleshooting. If in use, transition suction to wall vacuum or a backup device before continuing."
    },
    {
      "title": "Confirm the Message and Current Setup",
      "instructions": "Verify the exact alarm message on the display. Determine which canister position is generating the error."
    },
    {
      "title": "Inspect the Canister Fluid Level",
      "instructions": "Visually confirm the fluid level. If full or near full, properly dispose of contents per facility policy and replace with an empty canister."
    },
    {
      "title": "Remove and Re-seat the Canister",
      "instructions": "Remove the affected canister. Inspect the bottom and rear connection points. Reinstall firmly, ensuring it is fully seated and locked in place."
    },
    {
      "title": "Inspect the Float Mechanism",
      "instructions": "Check the internal float assembly inside the canister. Ensure the float moves freely and is not stuck in the “up” position. Look for coagulated debris or thick fluids restricting movement."
    },
    {
      "title": "Inspect Sensor Contact Area",
      "instructions": "Examine the sensor interface area on the unit where the canister docks. Look for dried fluid, residue, or corrosion. Clean the external sensor contact area with approved disinfectant wipes (do not saturate)."
    },
    {
      "title": "Swap Canisters Between Positions",
      "instructions": "Move the suspected canister to another port (if applicable). Install a known-good canister in the original port."
    },
    {
      "title": "Power Cycle the Unit",
      "instructions": "Turn the Neptune off. Wait 30 seconds. Restart and allow the system to complete self-test."
    },
    {
      "title": "Check for Signs of Fluid Intrusion",
      "instructions": "Look for moisture, staining, or unusual odor near the canister ports. Check for alarm recurrence immediately after startup. If fluid intrusion into the internal sensor housing is suspected, do not continue operating the unit."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit displaying ‘Canister Full’ alarm immediately after new empty canister installed.",
      "Cause": "Level sensor falsely detecting full condition in port #2. Float mechanism moved freely. Error remained with port after canister swap.",
      "Resolution": "Removed unit from service. Labeled Out of Service. Sent to shop for sensor evaluation and repair. Backup unit provided to OR."
    }
  },
  "helpfulDetails": [
    "Which port was affected",
    "Whether canisters were swapped",
    "Condition of float mechanism",
    "Evidence of fluid residue at sensor interface",
    "Whether alarm cleared after power cycle",
    "Final device status (Returned to service or Sent for repair)"
  ]
},
  {
  "title": "Stryker Neptune Surgical Fluid Management System – Low or No Suction",
  "description": "Troubleshooting guide for low or no suction on the Stryker Neptune system, focusing on external setup, tubing, canister configuration, and safety-first escalation.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-low-or-no-suction.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm suction is no longer actively required on a patient. Move suction to a backup wall suction source if needed. Do not troubleshoot while actively connected to a surgical field. Patient safety always comes first."
    },
    {
      "title": "Verify the Unit Is Powered On and Fully Booted",
      "instructions": "Confirm the unit is powered on. Check for any alarm messages on the display. Ensure the unit has completed startup and is not in standby mode. If the system is not fully operational, suction will not engage."
    },
    {
      "title": "Confirm Suction Mode and Vacuum Level Settings",
      "instructions": "Verify the suction channel is selected and activated. Check that vacuum level is set appropriately (not set to minimum or zero). Ensure the foot pedal (if used) is connected and functioning. Low settings can appear as “no suction” to clinical staff."
    },
    {
      "title": "Inspect All Tubing Connections",
      "instructions": "Trace tubing from the surgical field to the Neptune inlet. Ensure all connections are fully seated and not loose. Check for cracked tubing, disconnected fittings, or split lines. Confirm the correct port is being used. Even a small air leak can significantly reduce vacuum performance."
    },
    {
      "title": "Check for Kinks or Occlusions",
      "instructions": "Inspect suction tubing for: Kinks, Clots, Collapsed sections. Replace tubing if blockage is suspected. Mechanical obstruction is one of the most common causes of low suction."
    },
    {
      "title": "Inspect the Canister Setup",
      "instructions": "Ensure the collection canister is: Properly installed, Locked into position, Not overfilled. Check that the lid and seals are intact. Confirm float shutoff has not engaged due to fluid level. An improperly seated canister or engaged float valve will stop suction."
    },
    {
      "title": "Verify Filter and Hydrophobic Barrier Condition",
      "instructions": "Inspect for wet or saturated filters. Replace filters if moisture has breached the hydrophobic barrier. Wet filters can completely block vacuum flow."
    },
    {
      "title": "Listen for Pump Activity",
      "instructions": "When suction is activated, listen for: Normal pump sound, Unusual grinding, No motor sound at all. If the motor does not engage, internal vacuum pump failure may be present."
    },
    {
      "title": "Check for Alarm Indicators",
      "instructions": "Common alarms that affect suction: Full canister, Filter fault, Vacuum system error, Door or compartment not secured. Resolve any indicated alarm conditions and retest."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Staff reported Neptune unit had no suction during an OR case. Unit powered on but would not evacuate fluid.",
      "Cause": "Collection canister float shutoff engaged due to overfilled canister. Float valve blocking vacuum pathway.",
      "Resolution": "Replaced full canister, verified proper seating and seal. Tested suction at multiple vacuum settings. Unit functioning normally. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested (if power concern)",
    "Alarm messages observed",
    "Vacuum level setting during testing",
    "Tubing replaced or swapped",
    "Filter condition",
    "Canister condition",
    "Final suction performance",
    "Final device status (Returned to Service or Sent to Repair)"
  ]
},
  {
  "title": "Stryker Neptune Surgical Fluid Management System – Touchscreen / Control Panel Freezing",
  "description": "Troubleshooting guide for a Stryker Neptune Surgical Fluid Management System experiencing touchscreen or control panel freezing, focusing on external causes before internal failure.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-touchscreen.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure the Device Is Not Actively Connected to a Patient",
      "instructions": "Before troubleshooting, confirm the unit is not in active use. If connected, transfer suction to another device first. Freezing during a case can create safety risk if suction control cannot be adjusted."
    },
    {
      "title": "Perform a Controlled Power Cycle",
      "instructions": "Many touchscreen freezes are software-related. Turn the unit off using the normal shutdown procedure. Wait at least 60 seconds. Disconnect from AC power. Reconnect power and restart the unit. A full power cycle clears temporary software faults and resets the control interface. If the touchscreen functions normally after restart, monitor for recurrence."
    },
    {
      "title": "Verify Stable Power Source",
      "instructions": "Check if the unit is plugged directly into a wall outlet. Avoid extension cords or power strips. Test the outlet with an outlet tester or known working device. Inspect the power cord for damage. Unstable or fluctuating voltage can cause control board instability and display freezing."
    },
    {
      "title": "Inspect the Touchscreen Surface",
      "instructions": "Check for fluid residue, cleaning chemical buildup, cracks in the screen, and physical pressure points. Wipe the screen with approved cleaning solution and lint-free cloth. Excess fluid infiltration around the bezel can interfere with capacitive or resistive touch response."
    },
    {
      "title": "Observe System Behavior During Freeze",
      "instructions": "When freezing occurs, determine if the display remains lit, if physical buttons respond, if suction motors are still functioning, and if alarm tones are active. If suction continues but screen is frozen, the issue is likely interface-related rather than full system failure. If the entire unit becomes unresponsive, suspect deeper power or control board issue."
    },
    {
      "title": "Check for Environmental Factors",
      "instructions": "Evaluate excessive OR humidity, fluid spills near the control panel, heat exposure, and whether terminal cleaning was recently completed. Moisture intrusion is a common cause of intermittent panel freezing."
    },
    {
      "title": "Check for Recurring Pattern",
      "instructions": "Determine if freezing occurs only during high suction load, only during startup, or after prolonged use. Document pattern behavior. Intermittent freezing that worsens over time often indicates control board degradation."
    },
    {
      "title": "Inspect for Error Messages After Reboot",
      "instructions": "After restarting, look for boot-up warnings, system faults, and software errors. Record any displayed codes before clearing them."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Touchscreen froze during procedure. Could not adjust suction level.”",
      "Cause": "“Unit powered on but touchscreen unresponsive. Power cycle temporarily restored function. Issue recurred after 20 minutes of operation.”",
      "Resolution": "“Removed unit from service. Verified stable power source. Labeled Out of Service and sent for further evaluation of control board/display assembly.”"
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Power cord condition",
    "Whether suction motor remained functional",
    "Any error codes observed",
    "Evidence of fluid intrusion",
    "Final device status"
  ]
},
  {
  "title": "Stryker S3 Hospital Bed – Will Not Power On",
  "description": "Troubleshooting guide for Stryker S3 hospital bed that will not power on, focusing on logical external power checks before internal component evaluation.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "S3",
  "url": "guides/stryker-s3-will-not-power-on.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Verify no patient is at risk due to bed position. If the bed is in use, safely transfer the patient to another bed before troubleshooting. Ensure brakes are engaged and side rails are secure before transfer."
    },
    {
      "title": "Verify AC Power Source",
      "instructions": "Confirm the bed is plugged directly into a known-good wall outlet. Test the outlet with another device (lamp, meter, or outlet tester). Avoid assuming the outlet is functional based on appearance alone. Why this matters: A tripped breaker or dead outlet is more common than internal failure. Checklist: Outlet tested; No extension cords in use; Hospital-grade receptacle verified."
    },
    {
      "title": "Inspect the Power Cord",
      "instructions": "Check the entire length of the cord for cuts, pinch points, or exposed wiring. Ensure the cord is fully seated at the bed’s power inlet. Confirm the cord was not damaged during transport or housekeeping. If damage is observed: Remove the bed from service. Do not energize a compromised cord."
    },
    {
      "title": "Check for Battery Operation",
      "instructions": "The S3 bed contains an internal battery backup. Unplug the bed and attempt to power on using battery. If the bed powers on via battery but not AC, suspect: Failed AC inlet; Internal fuse; Power supply issue. If the bed does not power on with battery: Battery may be fully discharged or failed. Checklist: Battery indicator lights observed; Charging status verified (if applicable)."
    },
    {
      "title": "Inspect the Line Voltage Indicator (If Equipped)",
      "instructions": "Some S3 configurations include indicator LEDs. Observe for any LED activity when plugged in. No lights at all may indicate: No incoming AC; Blown internal fuse; Failed power supply."
    },
    {
      "title": "Perform a Basic Reset",
      "instructions": "Unplug the bed from AC power. Disconnect battery if accessible externally (do not disassemble). Wait 60 seconds. Reconnect AC power first, then battery. Attempt power-up again. Why this matters: Embedded controllers can occasionally latch and require a full reset."
    },
    {
      "title": "Inspect for Signs of Internal Electrical Failure",
      "instructions": "Without opening the unit, check for: Burning smell; Unusual heat from control box; Visible fluid intrusion near electronics; Evidence of prior repair attempts. If any of these are present: Remove from service immediately."
    },
    {
      "title": "Confirm Control Lockout Is Not Engaged",
      "instructions": "Some user reports of “dead bed” are actually control lockouts. Verify that side rail controls are not locked via nurse control panel. Attempt operation from multiple control locations. If functions operate from one panel but not another: Suspect local control board or wiring issue."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed in Room 312 will not power on. No lights or movement from controls.",
      "Cause": "No AC power detected at wall outlet. Breaker was tripped. Bed functional once connected to verified outlet.",
      "Resolution": "Reset breaker, verified proper AC supply, confirmed bed powers on and all functions operate normally. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes/No",
    "Cord condition: Intact/Damaged",
    "Battery status: Charged/Dead",
    "Indicator lights present: Yes/No",
    "Unusual smell or heat: Yes/No",
    "Final status: Returned to service / Sent to shop"
  ]
},
  {
  "title": "Stryker S3 Hospital Bed – Hi-Low Actuator Failure",
  "description": "Troubleshooting guide for Stryker S3 hospital bed hi-low movement failures including actuator, power, and lockout evaluation.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "S3 Hospital Bed",
  "url": "guides/stryker-s3-hi-low-actuator-failure.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Transfer the patient to another bed if height adjustment is required. Do not work under the bed frame with a patient in the bed. Lower the bed to its safest position if possible. Hi-low failures can create fall risk or staff injury risk."
    },
    {
      "title": "Verify Power to the Bed",
      "instructions": "Confirm the bed is plugged into a known-good outlet. Test the outlet with another device. Check for illuminated power indicators on the bed. If equipped with battery backup, disconnect AC power and test hi-low on battery. Low voltage or a failed power supply can allow some functions to work while preventing high-load functions like hi-low from operating."
    },
    {
      "title": "Check for Lockout Activation",
      "instructions": "Inspect side rail controls for hi-low lockout indicators. Verify that nurse panel lockouts are not active. Cycle lockout settings OFF and retest. Hi-low lockouts are commonly engaged during cleaning or transport."
    },
    {
      "title": "Test Multiple Control Points",
      "instructions": "Test hi-low from patient pendant, side rail controls, and nurse control panel. If hi-low works from one control but not another, suspect a faulty pendant or localized control board. If hi-low does not work from any control, continue troubleshooting toward actuator or main control issues."
    },
    {
      "title": "Listen for Actuator Response",
      "instructions": "When pressing hi-low, determine if you hear motor noise, a relay click, or complete silence. Clicking with no movement suggests possible actuator stall or mechanical binding. Motor noise without movement suggests possible stripped drive or linkage issue. Silence suggests possible power or control issue."
    },
    {
      "title": "Inspect Under-Bed Cabling",
      "instructions": "Safely tip or access the base without a patient. Inspect hi-low actuator wiring harness. Look for pinched, stretched, or disconnected cables. Ensure connectors are fully seated. Check for corrosion at quick-connect fittings. Hi-low wiring runs through moving frame sections and is prone to stress damage."
    },
    {
      "title": "Inspect Mechanical Linkage",
      "instructions": "Look for debris or obstruction in scissor frame. Verify no bent frame members. Check for transport damage. Ensure nothing is mechanically blocking movement. Do not disassemble the actuator."
    },
    {
      "title": "Check Battery Condition (If Equipped)",
      "instructions": "Inspect battery for swelling or leakage. Measure voltage if applicable. Replace battery if it fails load testing. Weak batteries may allow light functions but not high-load lift motors."
    },
    {
      "title": "Evaluate Actuator Failure",
      "instructions": "If power is confirmed, lockouts are cleared, controls are functional, wiring is intact, and no mechanical obstruction exists, likely causes include failed hi-low actuator motor, internal actuator limit switch failure, or main control board output failure. At this stage, escalation is appropriate."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports bed will not raise or lower. All other functions operational.",
      "Cause": "Hi-low actuator not responding from any control panel. Power verified. Lockouts cleared. Wiring intact. Actuator silent during activation.",
      "Resolution": "Bed removed from service. Hi-low actuator replaced. Full function test performed. Bed returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Battery condition checked",
    "Lockout status confirmed",
    "Controls tested (which ones worked)",
    "Actuator noise behavior",
    "Final operational status"
  ]
},
  {
  "title": "Stryker S3 Hospital Bed – Side Rail Control Panel Failure",
  "description": "Troubleshooting guide for Stryker S3 hospital bed side rail control panel failures, focusing on external power, lockout, and harness checks before internal component replacement.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "S3",
  "url": "guides/stryker-s3-side-rail-control-panel-failure.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Move the patient to another bed if possible. Ensure bed is in lowest position. Engage brakes. Confirm patient has alternate means of calling staff. Do not troubleshoot an electrical issue on an actively unstable patient."
    },
    {
      "title": "Confirm Bed Has Power",
      "instructions": "Check if the bed is plugged into a known working outlet. Verify the outlet is tested and working. Confirm the main power switch is on (if equipped). Check for power indicator lights on the bed frame. The side rail panel requires system power from the bed control board."
    },
    {
      "title": "Test Other Bed Functions",
      "instructions": "Using the main footboard control panel, attempt head up/down, bed height adjustment, and Trendelenburg if applicable. If all functions fail, suspect system-wide power or control issue. If footboard controls work but side rail does not, suspect localized side rail assembly issue."
    },
    {
      "title": "Check for Lockout Activation",
      "instructions": "Verify caregiver lockouts are not active. Verify patient control lockouts are not active. Ensure controls are not disabled via nurse panel. A locked-out panel may appear failed when it is functioning properly."
    },
    {
      "title": "Inspect the Side Rail Panel Physically",
      "instructions": "Look for cracked overlay, fluid intrusion, sticky buttons, loose mounting, or damaged membrane surface. Gently press each button and observe tactile feedback. If panel feels soft or spongy, membrane failure is possible."
    },
    {
      "title": "Inspect Side Rail Cable Routing",
      "instructions": "Lower the side rail if safe and inspect the cable harness from rail to bed frame. Check for pinch points, frayed or exposed wires, and loose or partially seated connectors. Do not disassemble sealed electronics beyond connector-level inspection."
    },
    {
      "title": "Reseat External Connectors (If Accessible)",
      "instructions": "Power down bed. Disconnect AC power. Reseat side rail connector if externally accessible. Restore power and retest. Do not access internal control boards beyond standard service access panels unless authorized."
    },
    {
      "title": "Check for Intermittent Operation",
      "instructions": "Raise and lower rail slowly while observing panel. Slightly manipulate cable harness. If panel activates intermittently during movement, harness fatigue is highly likely."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reported right side rail control panel not responding. Bed height and head functions inoperable from rail.",
      "Cause": "Verified bed powered. Footboard controls functional. Lockouts disabled. Inspection revealed intermittent response when articulating side rail. Suspected internal harness fatigue within rail assembly.",
      "Resolution": "Removed bed from service. Replaced right side rail control assembly. Tested all functions from rail and footboard. Returned bed to service after full operational check."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "Power indicator status",
    "Footboard function test results",
    "Lockout status",
    "Visual condition of panel",
    "Cable inspection results",
    "Final operational status"
  ]
},
  {
  "title": "Stryker S3 Bed Exit Alarm Malfunction",
  "description": "Troubleshooting guide for Stryker S3 bed exit alarm failures, false alarms, and sensitivity issues using an external-first approach.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "S3",
  "url": "guides/stryker-s3-bed-exit-alarm.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "If the alarm reliability is in question, move the patient to a safe, functioning bed. Implement alternative fall precautions per facility protocol. Do not perform troubleshooting while the bed is actively supporting a patient."
    },
    {
      "title": "Verify the Bed Exit Alarm Is Enabled",
      "instructions": "Confirm the bed exit alarm is turned ON at the control panel. Check which sensitivity level is selected (e.g., low, medium, high). Ensure the alarm is properly armed after patient positioning."
    },
    {
      "title": "Confirm Proper Patient Positioning",
      "instructions": "Ensure the patient is centered on the mattress. Verify the patient weight meets the detection threshold. Confirm linens are not excessively layered under the patient."
    },
    {
      "title": "Inspect Mattress and Surface Compatibility",
      "instructions": "Confirm the mattress is the correct Stryker-approved surface for the S3. Verify no overlays or air surfaces have been added that could interfere. Remove any unauthorized pressure-relief pads temporarily to test alarm function."
    },
    {
      "title": "Check for Obstructions or Improper Mattress Installation",
      "instructions": "Lift and reseat the mattress. Confirm the mattress is fully seated within the frame. Inspect for folded linens or objects between mattress and frame."
    },
    {
      "title": "Power Cycle the Bed",
      "instructions": "Disconnect AC power. If equipped, disconnect battery briefly (if accessible externally). Reconnect power and allow full reboot. Re-arm the bed exit alarm and retest."
    },
    {
      "title": "Inspect Control Panel and Indicators",
      "instructions": "Check for error codes on the display. Observe for intermittent alarm activation without patient movement. Confirm speaker function (audio not muted or failed). If available, test alarm volume adjustment."
    },
    {
      "title": "Check Bed Frame and Sensor Wiring (External Only)",
      "instructions": "Inspect visible harness connections under the sleep deck (no disassembly). Look for pinched or damaged wiring. Check for recent maintenance that may have disturbed connections. Do not open control boards or remove deck panels beyond normal inspection."
    },
    {
      "title": "Functional Test (Without Patient)",
      "instructions": "With mattress installed, apply distributed pressure manually. Arm the bed exit alarm. Gradually remove pressure and confirm alarm activation. Repeat test at different sensitivity levels. Do not test while the bed is actively supporting a patient."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports bed exit alarm does not trigger when patient attempts to stand.",
      "Cause": "Mattress improperly seated in frame causing inconsistent pressure sensing.",
      "Resolution": "Reseated mattress, verified proper positioning, tested alarm at all sensitivity levels. Alarm functioning normally after correction."
    }
  },
  "helpfulDetails": [
    "Alarm sensitivity level",
    "Mattress type installed",
    "Any overlays present",
    "Indicator light behavior",
    "Speaker function",
    "Power cycle performed",
    "Final functional test results",
    "Final device status (Returned to Service or Sent to Repair)"
  ]
},
  {
  "title": "Stryker S3 Hospital Bed – Scale System Inaccuracy",
  "description": "Troubleshooting guide for inaccurate weight readings, zero failures, and scale fluctuations on the Stryker S3 hospital bed.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "S3 Bed",
  "url": "guides/stryker-s3-scale-inaccuracy.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Do not troubleshoot scale accuracy with a patient on the bed. If weight accuracy is clinically necessary, transfer the patient to a verified scale first. Ensure brakes are engaged before performing any checks."
    },
    {
      "title": "Verify the Bed Is on a Level Surface",
      "instructions": "The S3 scale system relies on load cells located at the frame. Uneven flooring or one caster elevated can cause inaccurate readings. Ensure all four casters are fully on the floor. Confirm the bed is not partially on a floor transition. Check that brakes are engaged. If necessary, relocate the bed to a known level surface and recheck."
    },
    {
      "title": "Ensure Nothing Is Touching the Bed",
      "instructions": "External contact is one of the most common causes of scale inaccuracy. Check for IV poles resting on the floor, Foley bags hanging and touching the ground, bed linens caught between the bed and wall, oxygen tubing pulling against a wall, and the bed contacting a bedside cabinet or wall. The bed must be completely free-floating for accurate weight."
    },
    {
      "title": "Confirm Proper Zeroing Procedure",
      "instructions": "If the bed was not zeroed properly, the displayed weight will be inaccurate. Remove all items from the bed surface. Ensure no linens or accessories are pressing against frame. Zero the scale according to normal operational procedure. Wait for weight to stabilize before adding patient. If zero fails repeatedly, power cycle the bed and attempt again."
    },
    {
      "title": "Check for Added or Removed Equipment After Weighing",
      "instructions": "Common issue: staff remove SCD pump, wedges, or positioning devices without re-zeroing, or additional equipment is added after baseline weight. Confirm all equipment present during zero is still present, or perform a new zero with known configuration."
    },
    {
      "title": "Inspect Mattress and Deck Position",
      "instructions": "Improper deck positioning may cause uneven load distribution. Lower bed to flat position. Ensure all deck sections are fully lowered. Confirm mattress is properly seated. Check that no deck actuator is partially engaged. Recheck weight after leveling bed."
    },
    {
      "title": "Inspect for Obvious Mechanical Issues",
      "instructions": "Without disassembling, look for visibly bent frame, check caster assemblies for binding, listen for abnormal creaking when weight shifts, and observe if weight changes significantly when head section moves. Significant fluctuations during articulation may indicate load cell or internal wiring concerns."
    },
    {
      "title": "Power Reset",
      "instructions": "If scale readings are erratic, disconnect bed from AC power. Remove battery power if accessible without disassembly. Wait 60 seconds. Reconnect and retest. This can reset scale controller communication."
    },
    {
      "title": "Cross-Check With Known Weight",
      "instructions": "If possible, use a calibrated test weight or compare with another verified bed scale. If variance exceeds facility tolerance (commonly ±0.5–1 lb or per policy), further evaluation is required."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reported bed weight reading 18 lbs higher than expected for patient.",
      "Cause": "IV pole was resting on floor and contacting wall, affecting scale reading.",
      "Resolution": "Freed IV pole from floor contact, re-zeroed bed scale, verified accurate reading within tolerance. Returned bed to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested (if power reset performed)",
    "Bed location",
    "Error messages displayed",
    "Zero procedure performed",
    "Floor condition",
    "Final verified weight",
    "Final device status"
  ]
},
  {
  "title": "STRYKER PROCUITY Hospital Bed - Drive Motor Not Engaging",
  "description": "Troubleshooting steps for a Stryker ProCuity hospital bed that powers on but fails to move when drive controls are activated.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "ProCuity",
  "url": "guides/stryker-procuity-drive-motor-not-engaging.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Verify Bed Power Status",
      "instructions": "Confirm the bed is powered on and not in a low-battery condition. Check the main display for battery indicators or warnings. Ensure the bed is plugged into a known good wall outlet if battery level is low. Why this matters: The drive motor will not engage if battery voltage is below the safe operating threshold."
    },
    {
      "title": "Confirm Brake Status",
      "instructions": "Verify central brake pedal position. Ensure the bed is in “neutral” or “steer” mode as appropriate for drive activation. Attempt to manually push the bed to confirm brake release. Why this matters: Engaged brakes mechanically prevent movement even if the drive motor attempts to activate."
    },
    {
      "title": "Verify Drive Enable Control",
      "instructions": "Ensure the drive handle is fully extended and properly seated. Confirm staff are pressing and holding the drive enable switch while attempting movement. Inspect the drive handle cable (if applicable) for visible damage or pinching. Why this matters: The system requires an intentional enable signal before motor engagement."
    },
    {
      "title": "Inspect for Obstructions",
      "instructions": "Check around all four casters and under the bed frame. Look for debris, IV tubing, cords, or floor obstructions. Confirm casters rotate freely. Inspect for string, tape, or debris wrapped around wheels. Why this matters: Mechanical resistance can prevent drive engagement or cause the system to inhibit motor activation."
    },
    {
      "title": "Check Bed Height and Position",
      "instructions": "Lower the bed to a standard transport height. Ensure side rails are properly latched. Why this matters: Certain safety interlocks may prevent drive activation."
    },
    {
      "title": "Listen for Motor Activation",
      "instructions": "Attempt to engage drive while listening closely. Do you hear a click, relay activation, or motor hum? No sound at all may indicate control or power issue. Clicking without movement may indicate mechanical coupling or motor failure."
    },
    {
      "title": "Perform a Power Reset",
      "instructions": "Power the bed off completely. Disconnect from AC power for 60 seconds. Reconnect and power back on. Why this matters: Resets may clear control lockouts or temporary faults."
    },
    {
      "title": "Inspect Battery Condition",
      "instructions": "Check for battery fault indicators. If available, swap with a known-good battery (per facility policy). Why this matters: Drive motors require higher current draw than basic bed functions. A weak battery may power electronics but not drive motors."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed powers on but will not move when drive handle is engaged.",
      "Cause": "Brakes were engaged. Central brake pedal found in lock position preventing drive activation.",
      "Resolution": "Released brakes, verified drive motor engagement, and confirmed proper movement in forward and reverse. Bed returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "Battery charge level",
    "Brake position verified",
    "Obstructions cleared",
    "Motor sound present or absent",
    "Final functional test results",
    "Final device status"
  ]
},
  {
  "title": "STRYKER ProCuity Hospital Bed - Battery Not Charging",
  "description": "Guide for troubleshooting a Stryker ProCuity bed that fails to charge its battery or shows low battery warnings.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "ProCuity",
  "url": "guides/stryker-procuity-battery.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Ensure the bed is plugged into a known working wall outlet. Test the outlet with another device to confirm it has power. Why it matters: A dead outlet is the most common cause of a non-charging battery."
    },
    {
      "title": "Check Bed Connection to Charger",
      "instructions": "Confirm the bed’s charging cable is fully inserted and free of damage. Inspect for bent pins, broken connectors, or frayed wires."
    },
    {
      "title": "Inspect Indicator Lights",
      "instructions": "Look for charging LEDs on the bed or battery. Confirm that the charging light is on and steady. Flashing or no light can indicate battery or charger issues."
    },
    {
      "title": "Battery Seating",
      "instructions": "Remove and reseat the battery to ensure proper contact. Listen or feel for a click to confirm secure installation."
    },
    {
      "title": "Swap with Known Good Battery",
      "instructions": "If available, insert a charged battery from another ProCuity bed. If it charges, the original battery is likely faulty."
    },
    {
      "title": "Swap Charger/Cradle if Possible",
      "instructions": "If a spare charger or docking station is available, test with the same bed. Confirms whether the problem is the charger or the battery/bed connection."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed will not charge; battery warning light remains on.",
      "Cause": "Battery did not accept charge; charger and outlet confirmed functional.",
      "Resolution": "Battery removed, tested, and replaced with spare; defective battery labeled and sent for service."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes",
    "Charger tested: Yes",
    "Battery LED indicators: Flashing/Off",
    "Unusual sounds or heat: None noted",
    "Final bed status: Replaced battery; bed operational"
  ]
},
  {
  "title": "STRYKER PROCUITY HOSPITAL BED - Integrated Scale Drift",
  "description": "Troubleshooting guide for integrated scale drift on the Stryker ProCuity bed, focusing on external checks before service escalation.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "ProCuity",
  "url": "guides/stryker-procuity-integrated-scale-drift.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Verify Bed is on a Level Surface",
      "instructions": "Ensure the bed is placed on a flat, stable floor. Uneven surfaces can cause scale readings to drift."
    },
    {
      "title": "Check for Obstructions or Load on the Bed",
      "instructions": "Remove any items on the mattress except the patient (if safe) or test weight. Make sure side rails or accessories are not applying uneven pressure."
    },
    {
      "title": "Inspect Power Connection and Battery Status",
      "instructions": "Confirm the bed is properly plugged in if the scale requires mains power. If the bed uses battery backup, ensure batteries are charged."
    },
    {
      "title": "Confirm Calibration Status",
      "instructions": "Review the bed’s scale calibration logs if available. Some models allow a manual recalibration; follow manufacturer prompts."
    },
    {
      "title": "Perform a Zero or Tare Function",
      "instructions": "Activate the scale’s zero/tare function with no weight on the bed. Observe if the scale stabilizes or continues to drift."
    },
    {
      "title": "Environmental Considerations",
      "instructions": "Ensure temperature and humidity are within recommended ranges. Vibrations from nearby equipment can cause drifting readings."
    },
    {
      "title": "Swap Mattress or Mattress Support Pads",
      "instructions": "If the bed uses specialized pads or mattress sensors, remove and reseat them. Check for uneven wear or compression affecting weight distribution."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Integrated scale shows drifting weight readings and fails to stabilize.",
      "Cause": "Bed on uneven surface; calibration may be out of spec; potential mattress sensor issue.",
      "Resolution": "Verified surface, cleared obstructions, performed zero/tare, reseated mattress sensors; bed removed from service and sent for calibration/repair."
    }
  },
  "helpfulDetails": [
    "Bed location and floor type",
    "Battery status and power connection",
    "Zero/tare attempts and results",
    "Any unusual noises or resistance from bed mechanisms",
    "Environmental factors (temperature, vibration)",
    "Final status before sending for repair"
  ]
},
  {
  "title": "STRYKER ProCuity Hospital Bed - Bed Exit Alarm False Alarms",
  "description": "Guide to troubleshooting false bed exit alarms on Stryker ProCuity beds, focusing on sensor, alignment, and connection checks before internal failure assumptions.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "ProCuity",
  "url": "guides/stryker-procuity-bed-exit-alarm.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Check Bed Occupancy Sensor Placement",
      "instructions": "Ensure the sensor pad or mattress-integrated sensor is correctly positioned under the patient. Misaligned or bunched sensors can falsely detect a patient has exited the bed."
    },
    {
      "title": "Inspect Sensor Pad for Damage or Wear",
      "instructions": "Look for cracks, tears, frayed wires, or moisture intrusion. A damaged pad may intermittently trigger alarms."
    },
    {
      "title": "Verify Bed Frame and Mattress Alignment",
      "instructions": "Confirm mattress sits evenly on the bed frame without gaps that could interfere with the sensor. Check side rails are fully locked, as improper rail position can affect sensor readings."
    },
    {
      "title": "Check Electrical Connections",
      "instructions": "Ensure the sensor cable is firmly connected to the bed controller. Look for bent pins or loose connectors."
    },
    {
      "title": "Test with a Known Good Sensor (if available)",
      "instructions": "Swap the pad with a working one from a similar bed to see if the false alarms persist. If the issue resolves, the original pad is likely faulty."
    },
    {
      "title": "Inspect Bed Controller and Firmware",
      "instructions": "Check for visible signs of damage or corrosion on the controller. Confirm the controller firmware is current per Stryker recommendations."
    },
    {
      "title": "Reproduce Alarm Conditions Safely",
      "instructions": "With the bed unoccupied, observe if alarms trigger. If false alarms occur without a patient, suspect the sensor or controller."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Bed exit alarm triggers repeatedly without patient leaving bed.",
      "Cause": "Sensor pad misaligned and/or cable connection intermittent.",
      "Resolution": "Checked pad placement, inspected connections, tested with known good pad. Issue persists → bed labeled Out of Service and sent for repair."
    }
  },
  "helpfulDetails": [
    "Sensor pad serial number",
    "Cable inspection results",
    "Bed controller model and firmware version",
    "Alarm pattern (intermittent or constant)",
    "Final bed status (Out of Service or returned to service after replacement)"
  ]
},
  {
  "title": "STRYKER ProCuity Hospital Bed - Touchscreen Lockups",
  "description": "Guide for addressing touchscreen freezes, lag, or unresponsiveness on Stryker ProCuity hospital beds with focus on external checks before internal repair.",
  "assetType": "Hospital Bed",
  "manufacturer": "Stryker",
  "model": "ProCuity",
  "url": "guides/stryker-procuity-touchscreen.html",
  "dateAdded": "2026-03-01",
  "steps": [
    {
      "title": "Check Power Supply",
      "instructions": "Ensure the bed is plugged into a working outlet or battery is charged. Verify indicator lights are on. Why: Touchscreen lockups can occur when voltage is low or unstable."
    },
    {
      "title": "Inspect Cables and Connections",
      "instructions": "Check the connection between the touchscreen panel and the main bed controller. Look for loose connectors, bent pins, or visible damage. Why: A poor connection can cause intermittent touchscreen response."
    },
    {
      "title": "Reset the Bed Controller",
      "instructions": "Perform a soft reset following the manufacturer’s instructions (usually power cycle). Wait 1–2 minutes before powering back on. Why: Temporary software glitches can cause touchscreen freeze; reset often clears them."
    },
    {
      "title": "Check for Environmental Interference",
      "instructions": "Ensure no strong magnets, mobile devices, or liquid spills are near the touchscreen. Clean the screen gently with a non-abrasive cloth. Why: Capacitive touchscreens can misread touches if the environment interferes."
    },
    {
      "title": "Test Other Bed Functions",
      "instructions": "Adjust bed positions using manual controls (if available) or backup controls. Observe if lockups occur only on touchscreen or affect all functions. Why: Confirms whether issue is touchscreen-specific or more systemic."
    },
    {
      "title": "Update or Verify Software Version",
      "instructions": "Check if the touchscreen/controller firmware is up to date. Why: Older firmware may have known touchscreen bugs; updating can resolve issues."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Touchscreen freezes, unresponsive to input.",
      "Cause": "Controller reset and cable check indicate no external issues; software glitch or internal touchscreen failure suspected.",
      "Resolution": "Bed removed from service, labeled Out of Service, sent for repair."
    }
  },
  "helpfulDetails": [
    "Bed powered via outlet or battery?",
    "Cable condition and connector seating",
    "Occurrence frequency of touchscreen lockup",
    "Any error messages on display",
    "Other bed functions affected?",
    "Firmware/software version",
    "Final device status"
  ]
}
]
