[
  {
  "title": "Dräger Fabius Anesthesia Machine - Ventilator Fails Self-Test / Won’t Start",
  "description": "Guide for troubleshooting a Fabius anesthesia machine ventilator that fails self-test or won't start, focusing on external causes and patient safety.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-fails-self-test.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Power Supply and Connection",
      "instructions": "Confirm the machine is plugged into a verified hospital-grade outlet. Check that the main power switch is ON. Inspect the power cord for damage. Why it matters: Anesthesia machines will not complete self-tests without stable power."
    },
    {
      "title": "Check Backup Battery Status",
      "instructions": "If the machine uses a battery, verify it is charged and properly seated. Some Fabius models require a battery to be functional to pass self-test."
    },
    {
      "title": "Verify Gas Supply and Hoses",
      "instructions": "Ensure all medical gases (O₂, N₂O, air) are connected and pressure is within specification. Confirm that the hoses are properly attached and there are no leaks. Why it matters: Gas pressure sensors can prevent self-test completion if insufficient."
    },
    {
      "title": "Inspect Breathing Circuit and Accessories",
      "instructions": "Remove any patient circuit attachments, filters, or breathing bags that may obstruct the system. Ensure that the ventilator circuit is properly mounted and clamps are released. Why it matters: Obstructions or misaligned components can cause self-test failure."
    },
    {
      "title": "Check for Active Alarms or Fault Indicators",
      "instructions": "Review the display for messages that may indicate sensor errors, disconnected components, or service reminders."
    },
    {
      "title": "Power Cycle the Machine",
      "instructions": "Turn off the machine, wait 30–60 seconds, and restart. Why it matters: A simple reset often clears temporary faults in software or sensors."
    },
    {
      "title": "Run Self-Test with Minimal Configuration",
      "instructions": "Disconnect optional modules or accessories. Run self-test again to see if the issue persists."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails self-test and will not start; machine displays error code during pre-use check.",
      "Cause": "Power supply and gas connections verified; breathing circuit removed; self-test continues to fail, suggesting internal ventilator or sensor fault.",
      "Resolution": "Machine removed from service, labeled Out of Service, and sent for Dräger bench evaluation/service."
    }
  },
  "helpfulDetails": [
    "Outlet tested with another device.",
    "Power cord inspected.",
    "Gas pressures verified.",
    "Breathing circuit removed for testing.",
    "Display error codes captured (if any).",
    "Machine status: Out of Service pending repair."
  ]
},
  {
  "title": "Dräger Fabius Anesthesia Machine – Battery / UPS Problems",
  "description": "Troubleshooting guide for battery faults, charging issues, and UPS transition problems on the Dräger Fabius anesthesia machine.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-battery.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Do not troubleshoot while the machine is supporting an active patient unless absolutely necessary. If there is a battery or power failure alarm during a case, ensure the patient is safely transitioned to backup ventilation and stable before proceeding."
    },
    {
      "title": "Verify AC Power Source",
      "instructions": "Confirm the power cord is fully seated in both the rear of the Fabius and the wall outlet. Check for a secure hospital-grade plug connection. Look for any damage to the power cord (cuts, bent prongs, loose strain relief). Test the outlet with a known-good device or outlet tester. A poor AC supply prevents the internal battery from charging and may trigger battery alarms."
    },
    {
      "title": "Check Power Indicator Lights",
      "instructions": "Verify the machine indicates AC power present. Confirm no facility power interruptions occurred (tripped breaker, switched outlet, power strip). If connected to an external UPS, verify the UPS is powered on and not in fault mode."
    },
    {
      "title": "Simulate Power Loss (When Safe and Off Patient)",
      "instructions": "With the unit powered on and not in clinical use, disconnect AC power. Confirm the unit transitions to battery power without shutting down. Observe for immediate low battery alarms or shutdown. If the unit shuts down immediately, suspect battery degradation or internal power supply issues."
    },
    {
      "title": "Check Battery Status Indicators",
      "instructions": "Review battery charge percentage on the display. Note whether the battery appears to charge when AC power is restored. If battery percentage remains static or drops quickly, battery capacity is likely diminished."
    },
    {
      "title": "Consider Battery Age",
      "instructions": "Review service records for battery replacement history. Internal batteries in anesthesia machines commonly degrade over 2–4 years depending on usage and environment. If beyond expected lifespan, battery replacement is appropriate."
    },
    {
      "title": "Inspect for Environmental Factors",
      "instructions": "Check for excessive heat around the machine. Listen for abnormal fan noise. Note any burnt smell or unusual heat near the power supply area. These may indicate internal power supply or charging circuit concerns."
    },
    {
      "title": "Check External UPS (If Used)",
      "instructions": "Confirm external UPS runtime is adequate. Perform a controlled UPS self-test. Replace UPS batteries if they fail load testing. Ensure the issue is not external before attributing failure to the anesthesia machine."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Anesthesia machine alarming for low battery and shuts down when unplugged.",
      "Cause": "Battery failed load test. Unit powered off immediately when AC disconnected. Battery age 4+ years.",
      "Resolution": "Replaced internal battery pack. Verified proper charging and confirmed successful transition to battery power during simulated power loss test."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified functional",
    "Power cord inspected",
    "AC indicator confirmed",
    "Battery charge percentage noted",
    "Simulated power loss test performed",
    "Battery age documented",
    "Final operational status confirmed"
  ]
},
  {
  "title": "Dräger Fabius Alarm Failures / False Alarms",
  "description": "Guide for troubleshooting false alarms or alarm failures on Dräger Fabius anesthesia machines.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-alarm-failures.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Machine Power and Backup",
      "instructions": "Ensure the machine is plugged into a verified working outlet and powered on. Check battery status if operating on internal battery."
    },
    {
      "title": "Inspect Alarm and Sensor Connections",
      "instructions": "Verify that all breathing circuits, O₂ sensors, pressure lines, and flow sensors are properly connected. Check that connectors are clean, dry, and free of damage."
    },
    {
      "title": "Check Gas Supply and Flow",
      "instructions": "Confirm that O₂, N₂O, and air supply lines are connected and pressure is within normal operating range. Verify that flowmeters are not blocked or leaking."
    },
    {
      "title": "Examine Breathing Circuit Setup",
      "instructions": "Ensure correct circuit type (adult, pediatric) is selected in the machine settings. Check for leaks or obstructions in the circuit and endotracheal tube connections."
    },
    {
      "title": "Confirm Alarm Configuration and Limits",
      "instructions": "Review the alarm limits set in the machine for O₂, CO₂, airway pressure, tidal volume, etc. Ensure that alarm mute buttons are not inadvertently engaged."
    },
    {
      "title": "Perform a Self-Test / System Check",
      "instructions": "Run the machine’s built-in self-test (Dräger Fabius includes an automated check). Observe any errors or warnings reported."
    },
    {
      "title": "Environmental Factors",
      "instructions": "Ensure the machine is not exposed to extreme temperatures, moisture, or electrical interference. Remove any nearby equipment that could interfere with sensors."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reports frequent false alarms and occasional alarm failures on the Fabius machine.",
      "Cause": "Upon inspection, some sensor connectors were loose, and alarm limits were improperly set.",
      "Resolution": "Reconnected sensors securely, verified all connections, reset alarm limits, ran self-test, and confirmed alarms functioning correctly."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes/No",
    "Sensor connections checked: Yes/No",
    "Alarm configuration verified: Yes/No",
    "Self-test completed: Yes/No",
    "Any unusual sounds or smells: Describe",
    "Final device status: Operational / OOS"
  ]
},
  {
  "title": "Dräger Fabius Touchscreen / Display Errors",
  "description": "Troubleshooting guide for Dräger Fabius anesthesia machine touchscreen and display issues, focusing on external causes before internal component failure.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-touchscreen.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm the machine is not actively ventilating a patient before troubleshooting. If in use, transition the patient to another anesthesia machine or alternate ventilation source first. Display troubleshooting should never compromise patient ventilation."
    },
    {
      "title": "Verify AC Power and Battery Status",
      "instructions": "Confirm the unit is plugged directly into a known-good outlet. Check for tripped breakers or recently used red emergency outlets that may have unstable supply. Review battery status on the screen (if visible). Low voltage or unstable power can cause screen freezes, flickering, or boot issues. Verify outlet tested, power cord secure at both ends, no extension cords, and no power strips."
    },
    {
      "title": "Perform a Controlled Reboot",
      "instructions": "If safe and the machine is not in use, power down the machine using proper shutdown procedure. Wait 30–60 seconds. Restart the system and observe boot behavior. Observe whether the screen initializes normally, startup tones are normal, and whether the display fails before or after full boot. If the screen restores after reboot, the issue may have been a software hang."
    },
    {
      "title": "Inspect for External Physical Causes",
      "instructions": "Check for visible screen cracks or fluid intrusion. Look for condensation or OR cleaning residue near bezel edges. Confirm no adhesive covers or protective films are interfering with touch response. Touchscreens can become unresponsive due to fluid intrusion or contamination."
    },
    {
      "title": "Check for Peripheral Lockups",
      "instructions": "If the screen appears frozen but the machine is powered, observe whether alarms are functioning. Check if knobs or physical buttons respond. Disconnect any non-essential external connections (network, USB if applicable). If physical controls work but touchscreen does not, the issue may be isolated to the display module."
    },
    {
      "title": "Evaluate Environmental Factors",
      "instructions": "Determine if the OR experienced temperature extremes, if the machine was recently moved from cold storage, or if there is visible heat buildup or fan obstruction. Overheating or condensation can cause temporary display malfunction."
    },
    {
      "title": "Observe for Backlight vs. Display Failure",
      "instructions": "If the screen appears blank, shine a flashlight at the screen. If faint images are visible, possible backlight issue. If completely dark with no image, possible display power or control issue. This helps differentiate between backlight failure and total display loss."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Touchscreen not responding to touch in OR 3. Screen frozen during case setup.",
      "Cause": "Unit powered but touchscreen unresponsive. Reboot temporarily restored function. Issue recurred after 15 minutes. No external contamination noted.",
      "Resolution": "Removed anesthesia machine from service. Labeled Out of Service. Scheduled vendor repair for suspected display module failure."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "Reboot performed",
    "Physical controls responsive or not",
    "Backlight functioning",
    "Visible screen damage",
    "Environmental conditions",
    "Final device status"
  ]
},
  {
  "title": "Dräger Fabius Anesthesia Machine - Low Oxygen Pressure / O₂ Flush Issues",
  "description": "Guide for troubleshooting low oxygen pressure or O₂ flush issues on a Dräger Fabius anesthesia machine.",
  "assetType": "Anesthesia Machine",
  "manufacturer": "Dräger",
  "model": "Fabius",
  "url": "guides/dräger-fabius-low-oxygen-pressure.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Oxygen Supply",
      "instructions": "Check that the oxygen cylinder or pipeline supply is full and turned on. Confirm the correct pressure at the machine inlet using the pressure gauge. Why it matters: Low or empty supply is the most common cause of low oxygen pressure alarms."
    },
    {
      "title": "Inspect Hoses and Connections",
      "instructions": "Visually inspect the oxygen hose from the source to the machine. Ensure all connections are tight and free of kinks, cracks, or leaks. Why it matters: Even small leaks can reduce pressure and prevent the O₂ flush from functioning properly."
    },
    {
      "title": "Check the Oxygen Flowmeter",
      "instructions": "Verify that the flowmeter knob is in the correct position. Ensure the flowmeter tube and bobbin move freely. Why it matters: Obstructions or misalignment can prevent proper flow and pressure."
    },
    {
      "title": "Test O₂ Flush Function",
      "instructions": "Press the O₂ flush button briefly. Observe whether the oxygen flows rapidly into the circuit. If the flush is weak or absent, note any unusual sounds or behavior. Why it matters: A faulty flush valve or blocked pathway may indicate internal components need servicing."
    },
    {
      "title": "Check for Machine Alarms or Messages",
      "instructions": "Review the display panel for any error messages related to oxygen supply or pressure. Follow any suggested external corrective actions listed by the machine."
    },
    {
      "title": "Power Cycle the Machine",
      "instructions": "Turn the machine off and back on per manufacturer instructions. Confirm if the low oxygen pressure alarm persists. Why it matters: Some sensors or valves may reset after power cycling."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Low oxygen pressure alarm and weak O₂ flush observed.",
      "Cause": "Oxygen cylinder was low and supply hose had a minor kink reducing flow.",
      "Resolution": "Replaced cylinder, straightened hose, verified O₂ flush function; machine returned to service."
    }
  },
  "helpfulDetails": [
    "Supply pressure at machine inlet",
    "Oxygen cylinder status (full/empty)",
    "Condition of hoses and connections",
    "Alarm type and behavior",
    "O₂ flush response (strong/weak/absent)",
    "Final machine status after troubleshooting"
  ]
}
]
