[
 {
        "title": "Philips V60 Ventilator - Fails Self-Test / Leak Detected",
        "description": "Provides a structured Clinical Engineering approach to troubleshoot a leak detected during self-test on a Philips V60 ventilator.",
        "assetType": "Ventilator",
        "manufacturer": "Philips",
        "model": "V60",
        "url": "guides/philips-v60-leak-fail.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Check the Patient Circuit and Tubing",
            "instructions": "Ensure all connections are fully seated. Inspect for cracks, holes, or loose fittings. Verify the circuit is properly attached to the ventilator outlet. Reason: Even a small gap can cause a leak detection during self-test."
          },
          {
            "title": "Inspect the Exhalation Port and Filter",
            "instructions": "Confirm the exhalation port is installed correctly. Check the filter is present, seated properly, and unobstructed. Look for moisture buildup or blockages. Reason: Improper installation or obstruction can trigger a leak error."
          },
          {
            "title": "Check the Humidifier (If Installed)",
            "instructions": "Ensure the humidifier chamber is seated correctly and intact. Inspect tubing connections for tightness and leaks. Reason: Humidifier leaks are a common cause of self-test failure."
          },
          {
            "title": "Inspect the Mask or Test Plug",
            "instructions": "If a mask is attached, ensure a proper seal. If running a self-test without a patient, verify the test plug or circuit cap is secure. Reason: Any open patient interface will cause the ventilator to detect a leak."
          },
          {
            "title": "Perform a Simple Reset",
            "instructions": "Power the ventilator off. Re-seat the patient circuit, exhalation port, and humidifier connections. Power the ventilator back on and rerun the self-test. Reason: Resetting can clear temporary errors caused by connection issues."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the ventilator continues to fail the self-test after completing all external checks: The most common causes have been ruled out. The issue is likely internal (e.g., valve failure, internal leak). Next Steps: Remove the ventilator from clinical service. Clearly label it as Out of Service. Send for repair or bench evaluation. Clinical Engineering Note: Knowing when to stop is an essential part of proper troubleshooting and patient safety."
          },
          {
            "title": "Clinical Use Tip",
            "instructions": "Do not troubleshoot on an active patient; move the patient to another ventilator if possible. Only run self-tests when safe and with no patient attached or appropriately capped. Ensure all bedside staff are aware that the ventilator is being evaluated."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Ventilator fails self-test; leak detected.",
            "Cause": "Patient circuit, exhalation port, and humidifier inspected and reseated. No visible damage noted. Self-test continues to fail with leak detected. Suspected internal leak or valve failure.",
            "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
          }
        },
        "helpfulDetails": [
          "Circuit inspected or replaced",
          "Exhalation port reseated",
          "Humidifier chamber checked",
          "Self-test result (pass/fail)",
          "Visible damage or moisture",
          "Final device disposition (returned to service or sent for repair)"
        ]
      },
 {
  "title": "Philips IntelliVue MX Series - Touchscreen Freezes or Lags",
  "description": "Guide for troubleshooting touchscreen freeze or lag issues on the Philips IntelliVue MX Series patient monitor, focusing on external and verifiable causes first.",
  "assetType": "Patient Monitor",
  "manufacturer": "Philips",
  "model": "IntelliVue MX Series",
  "url": "philips-intellivue-mx-touchscreen.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Check AC Power Supply",
      "instructions": "Ensure the monitor is properly connected to a known good outlet. Verify that the AC power LED is on and stable. Why: Fluctuating or insufficient power can cause the touchscreen to freeze."
    },
    {
      "title": "Check Battery Status",
      "instructions": "Verify the battery is charged and seated correctly. If running on battery, try connecting AC power to see if the issue persists. Why: Low or unstable battery can affect touchscreen responsiveness."
    },
    {
      "title": "Inspect Touchscreen and Cables",
      "instructions": "Clean the screen with a soft, lint-free cloth and approved screen cleaner. Ensure any attached modules or cables (SpO₂, ECG, etc.) are properly connected. Why: Dirty screens or loose connections can cause erratic touch input."
    },
    {
      "title": "Check for Environmental Interference",
      "instructions": "Confirm the monitor is not exposed to extreme temperatures, humidity, or strong electromagnetic interference. Move away from other electronic equipment if needed. Why: Environmental factors can impact touchscreen operation."
    },
    {
      "title": "Soft Reset the Monitor",
      "instructions": "Perform a controlled reboot using the touchscreen or power button. Allow the monitor to fully restart. Why: Temporary software glitches often resolve with a restart."
    },
    {
      "title": "Review Software and Alarm Load",
      "instructions": "Check if multiple alarms, modules, or trends are running simultaneously. Temporarily reduce non-essential displays to see if performance improves. Why: Heavy processing load can cause touchscreen lag."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor touchscreen freezes and is slow to respond during patient monitoring.",
      "Cause": "Screen lag observed; AC power stable; battery charged; peripherals connected; soft reset did not resolve issue.",
      "Resolution": "Monitor removed from service, labeled Out of Service, and sent for repair."
    }
  },
  "helpfulDetails": [
    "AC outlet tested and stable",
    "Battery checked and seated properly",
    "Touchscreen cleaned",
    "Peripheral cables verified",
    "Soft reboot performed",
    "Any persistent lag patterns noted"
  ]
},
 {
  "title": "Philips IntelliVue MX Series - Flow / Invasive Pressure Readings Inaccurate",
  "description": "Guide for verifying external causes of inaccurate flow or invasive pressure readings on the IntelliVue MX Series patient monitor.",
  "assetType": "Patient Monitor",
  "manufacturer": "Philips",
  "model": "IntelliVue MX Series",
  "url": "guides/philips-intellivue-mx-invasive-pressure-innacurate.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Transducer Setup",
      "instructions": "Confirm the pressure transducer is correctly connected to the monitor and patient line. Ensure the transducer is positioned at the correct reference level (phlebostatic axis for arterial lines). Why it matters: Misleveling or loose connections can cause false high or low readings."
    },
    {
      "title": "Check Transducer Zeroing",
      "instructions": "Perform a zero calibration at atmospheric pressure following the monitor prompts. Confirm the transducer is open to air during zeroing. Why it matters: A transducer not properly zeroed will produce inaccurate readings."
    },
    {
      "title": "Inspect Tubing and Connections",
      "instructions": "Examine the invasive pressure line for kinks, air bubbles, or clots. Ensure all connectors are tight and no leaks exist. Why it matters: Small air bubbles or line obstructions can dampen the waveform, affecting accuracy."
    },
    {
      "title": "Verify Flush System (if applicable)",
      "instructions": "Check that the flush system delivers consistent flow without obstruction. Confirm the drip chamber is functioning properly and set at the correct height. Why it matters: Inconsistent flush rates can alter measured pressures."
    },
    {
      "title": "Check Monitor Settings",
      "instructions": "Ensure the correct pressure scale and waveform type are selected for the line being measured (arterial, central venous, pulmonary). Review alarm limits to confirm they match clinical expectations. Why it matters: Wrong configuration can appear as inaccurate readings."
    },
    {
      "title": "Test with a Known Reference or Simulator",
      "instructions": "If available, connect a pressure simulator to verify the monitor displays accurate values. Swap transducers with another working line if necessary. Why it matters: Confirms whether the problem is with the monitor or the external setup."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Arterial line readings appear low and inconsistent; waveform dampened.",
      "Cause": "Observed minor air bubbles in line and transducer not level with phlebostatic axis.",
      "Resolution": "Repositioned transducer to correct height, removed air bubbles, zeroed transducer, confirmed waveform returned to normal. Device monitored successfully."
    }
  },
  "helpfulDetails": [
    "Outlet/power status (if relevant)",
    "Cables/transducer swapped or tested",
    "Alarm behavior observed during troubleshooting",
    "Waveform appearance (dampened, oscillating, flat)",
    "Any unusual sounds or fluid leakage",
    "Final device status after intervention"
  ]
},
 {
  "title": "Philips IntelliVue MP Series - Battery Fails / Backup Power Issues",
  "description": "Guide for troubleshooting battery failure and backup power issues on Philips IntelliVue MP Series monitors, focusing on external causes first.",
  "assetType": "Patient Monitor",
  "manufacturer": "Philips",
  "model": "IntelliVue MP Series",
  "url": "guides/philips-intellivue-mp-battery.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify AC Power Supply",
      "instructions": "Ensure the monitor is plugged into a live wall outlet. Check the outlet with another device to confirm power availability. Why: A lack of AC power will prevent battery charging and trigger battery warnings."
    },
    {
      "title": "Inspect Power Cord and Connector",
      "instructions": "Examine the power cord for cuts, frays, or loose connections. Ensure the connector seats fully in the monitor’s AC input. Why: Poor connection can prevent charging or cause false battery errors."
    },
    {
      "title": "Check Monitor Battery Status",
      "instructions": "Navigate to the monitor’s battery menu to view charge level and status. Confirm the monitor recognizes the battery. Why: Misconfigured settings or disabled battery support can mimic failure."
    },
    {
      "title": "Examine Battery Condition",
      "instructions": "Remove the battery and inspect for swelling, leakage, or corrosion. Re-seat the battery, ensuring it locks into place. Why: Poor contact or damaged batteries can prevent operation."
    },
    {
      "title": "Test Monitor with a Known Good Battery",
      "instructions": "If a verified spare battery is available, install it and test functionality. Why: Isolates whether the issue is with the battery or the monitor itself."
    },
    {
      "title": "Observe Indicator Lights / Messages",
      "instructions": "Record any battery icons, error codes, or warnings. Why: These messages often pinpoint the source of the problem."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor battery fails to hold charge and shows error.",
      "Cause": "Battery seated properly but monitor does not recognize it; AC power confirmed good; spare battery tested with same results.",
      "Resolution": "Monitor removed from service, labeled Out of Service, sent to Philips service for evaluation."
    }
  },
  "helpfulDetails": [
    "Outlet tested: ✅/❌",
    "Power cord inspected: ✅/❌",
    "Indicator lights or error codes: Record exact messages",
    "External battery tested: ✅/❌",
    "Final device status: Out of Service"
  ]
},
 {
  "title": "Philips IntelliVue MP Series - Leads / SpO₂ / ECG Sensor Not Detected",
  "description": "Guide for troubleshooting situations where IntelliVue MP Series monitors fail to detect ECG leads, SpO₂ sensors, or other patient cables, focusing on external causes first.",
  "assetType": "Patient Monitor",
  "manufacturer": "Philips",
  "model": "IntelliVue MP Series",
  "url": "guides/philips-intellivue-mp-leads-not-detected.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Check Sensor Connection",
      "instructions": "Ensure all ECG leads or SpO₂ sensors are fully seated into the monitor or patient cable adapters. Inspect connectors for debris, corrosion, or bent pins. Why: Loose or misaligned connections are the most common cause of “not detected” errors."
    },
    {
      "title": "Inspect the Leads / Sensor Itself",
      "instructions": "Look for visible damage, fraying, or broken wires. If possible, swap with a known-good lead or sensor. Why: A faulty lead or sensor can trigger detection errors."
    },
    {
      "title": "Check Cable Orientation",
      "instructions": "Verify that ECG leads are attached to the correct patient locations (RA, LA, RL, LL, V1–V6). Confirm SpO₂ sensor placement follows manufacturer guidance. Why: Improper placement can prevent correct detection."
    },
    {
      "title": "Power Cycle the Monitor",
      "instructions": "Turn the monitor off, wait 10–15 seconds, and power it back on. Reconnect leads/sensors after reboot. Why: Resets internal detection circuits."
    },
    {
      "title": "Verify Monitor Configuration / Settings",
      "instructions": "Ensure the channel for the intended sensor is enabled in the monitor menu. Confirm patient type (adult/pediatric/neonate) matches sensor type. Why: Incorrect configuration can prevent proper recognition."
    },
    {
      "title": "Check for Environmental or Interference Issues",
      "instructions": "Remove nearby strong electrical equipment or sources of EMI. Ensure leads are not crossing power cords. Why: Electrical interference can sometimes cause detection errors."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor not detecting ECG leads or SpO₂ sensor.",
      "Cause": "Leads were not fully seated; ECG lead wires worn; monitor channel misconfigured.",
      "Resolution": "Inspected and reseated all leads; replaced worn ECG lead; verified SpO₂ sensor channel enabled; monitor tested successfully."
    }
  },
  "helpfulDetails": [
    "Outlet tested: ✅",
    "Leads swapped: ✅",
    "SpO₂ sensor tried on a different patient: ✅",
    "Monitor rebooted: ✅",
    "Any unusual indicator lights or alarms observed: None",
    "Final device status: Working; sensors now detected"
  ]
},
{
        "title": "Philips V60 Ventilator - Fails Self-Test / Flow Sensor Error",
        "description": "Structured Clinical Engineering troubleshooting guide for Philips V60 ventilator flow sensor errors or self-test failures.",
        "assetType": "Ventilator",
        "manufacturer": "Philips",
        "model": "V60",
        "url": "guides/philips-v60-flow-error.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Inspect the Patient Circuit",
            "instructions": "Ensure all tubing connections are secure and fully seated. Check for cracks, holes, or loose fittings. Confirm there are no kinks or obstructions. Why: Even a small leak or disconnection can trigger a flow sensor error."
          },
          {
            "title": "Check the Flow Sensor Module",
            "instructions": "Locate the flow sensor (usually near the patient connection or ventilator port). Verify it is properly installed and seated. Inspect for visible damage, moisture, or condensation. Why: A loose or wet sensor prevents accurate flow readings."
          },
          {
            "title": "Verify Humidifier and Additional Circuit Components",
            "instructions": "Ensure the humidifier is seated correctly and tubing is fully connected. Check other inline devices (filters, adapters) for leaks or added resistance. Why: Extra resistance or leaks can trigger flow sensor alarms."
          },
          {
            "title": "Observe the Ventilator Display",
            "instructions": "Note the error code and any accompanying messages. Document the error for Clinical Engineering tracking."
          },
          {
            "title": "Attempt a Simple Reset",
            "instructions": "Power off the ventilator. Reseat the circuit and flow sensor connections. Power on and rerun the self-test. Why: Sometimes a simple reseating clears false errors."
          },
          {
            "title": "If the Flow Sensor Error Persists",
            "instructions": "After completing the above steps, if the ventilator still reports a flow sensor error: Common external causes have been ruled out. The issue is likely internal (flow sensor module, electronics, or calibration). Next steps: Remove the ventilator from clinical service. Label as Out of Service. Send for repair or bench evaluation."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Ventilator fails self-test; flow sensor error.",
            "Cause": "Circuit and flow sensor inspected and reseated, humidifier checked, no visible damage. Error persists. Suspected internal flow sensor or electronics issue.",
            "Resolution": "Removed ventilator from service, labeled out of service, sent for repair. Tagged for bench evaluation by CE."
          }
        },
        "helpfulDetails": [
          "Circuit inspected or replaced",
          "Flow sensor reseated",
          "Humidifier and inline devices checked",
          "Error cleared or persisted",
          "Any visible damage, moisture, or condensation",
          "Final disposition (returned to service or sent for repair)"
        ]
      },
 {
  "title": "Philips IntelliVue MP Series - Touchscreen Not Responding",
  "description": "Guide for troubleshooting unresponsive touchscreen on Philips IntelliVue MP Series patient monitors.",
  "assetType": "Patient Monitor",
  "manufacturer": "Philips",
  "model": "IntelliVue MP Series",
  "url": "guides/philips-intellivue-mp-touchscreen.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Check Power Source",
      "instructions": "Ensure the monitor is plugged into a live AC outlet or has sufficient battery charge. Observe power indicator lights. No lights may indicate power issue."
    },
    {
      "title": "Inspect Cables and Connections",
      "instructions": "Verify all cables (power, patient leads, network) are properly seated and undamaged. Remove and reseat cables if necessary."
    },
    {
      "title": "Perform a Soft Reboot",
      "instructions": "Use the monitor’s power button to turn it off, wait 10–15 seconds, and turn it back on."
    },
    {
      "title": "Clean the Touchscreen Surface",
      "instructions": "Wipe the screen with a soft, lint-free cloth slightly dampened with approved cleaning solution. Ensure no liquids enter edges or ports."
    },
    {
      "title": "Check for Environmental Interference",
      "instructions": "Ensure there are no strong electromagnetic sources near the monitor (e.g., unshielded motors, large phones, MRI, etc.)."
    },
    {
      "title": "Test Touchscreen Responsiveness",
      "instructions": "After reboot and cleaning, touch multiple points on the screen to confirm responsiveness. Document any areas of non-response."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reported that the IntelliVue MP touchscreen was not responding to input.",
      "Cause": "Observed that monitor powered on, but touch input produced no response; cables intact; screen surface clean; soft reboot did not restore function.",
      "Resolution": "Monitor removed from service, labeled Out of Service, and sent for repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes",
    "Power indicator lights: Observed",
    "Reboot attempted: Yes",
    "Touchscreen cleaning performed: Yes",
    "Any unusual sounds, heat, or smell: None observed",
    "Final device status: Out of Service"
  ]
}
]
