[
  {
  "title": "Mindray BeneView T Series Patient Monitor - Battery / Power Faults",
  "description": "Guide for troubleshooting battery errors, power issues, and charging failures on the Mindray BeneView T Series monitor, focusing on external causes first.",
  "assetType": "Patient Monitor",
  "manufacturer": "Mindray",
  "model": "BeneView T Series",
  "url": "guides/mindray-t-series-battery.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Verify AC Power Connection",
      "instructions": "Ensure the power cord is fully inserted into both the monitor and wall outlet. Confirm the outlet is live by testing with a known working device. Why: A common cause of “power fault” errors is a loose or nonfunctional outlet connection."
    },
    {
      "title": "Inspect the Power Cord and Adapter",
      "instructions": "Check for frays, cuts, or bent pins on the power cord and plug. Replace the cord with a known-good unit if damage is suspected. Why: Damaged cords prevent proper charging or power delivery."
    },
    {
      "title": "Check Battery Seating",
      "instructions": "Remove the battery and reseat it firmly according to manufacturer instructions. Ensure contacts are clean and free of debris. Why: Poor battery contact can trigger fault messages or prevent charging."
    },
    {
      "title": "Observe Battery Status LEDs / Monitor Messages",
      "instructions": "Note any error codes or LED indicators that specify low battery, battery absent, or charging failure. Why: LED indicators help identify if the issue is the battery itself versus the charging circuit."
    },
    {
      "title": "Test with Alternate Battery if Available",
      "instructions": "Install a known-good, fully charged battery. Observe if the monitor powers on and charges normally. Why: Confirms whether the original battery is faulty."
    },
    {
      "title": "Check Environmental Conditions",
      "instructions": "Ensure the monitor is not in extreme temperatures (<10°C or >40°C). Why: Extreme cold or heat can prevent charging and cause battery errors."
    },
    {
      "title": "Reboot Monitor",
      "instructions": "Power cycle the monitor after performing the above checks. Observe if the error persists. Why: Some battery error messages clear after a controlled reboot."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor displays battery fault and won’t power on reliably.",
      "Cause": "Battery contacts dirty and partially seated; outlet tested and verified live.",
      "Resolution": "Reseated battery and cleaned contacts; replaced cord. Monitor powers on and charges correctly."
    }
  },
  "helpfulDetails": [
    "Outlet tested: ✅",
    "Power cord continuity checked: ✅",
    "LED indicators: red battery fault, green charging light",
    "Monitor rebooted: ✅",
    "Environmental temperature normal: ✅",
    "Final device status: stable after battery reseating and cord check"
  ]
},
  {
  "title": "Mindray BeneView T Series Patient Monitor - Leads / SpO₂ / ECG Sensor Errors",
  "description": "Guide to troubleshoot sensor errors on Mindray BeneView T Series monitors, focusing on external causes before internal hardware issues.",
  "assetType": "Patient Monitor",
  "manufacturer": "Mindray",
  "model": "BeneView T Series",
  "url": "guides/mindray-t-series-leads-spo2-ecg.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Check Power and Device Status",
      "instructions": "Ensure the monitor is plugged in and powered on. Confirm battery charge is sufficient if operating on battery. Some sensor errors can be triggered by low voltage or unstable power."
    },
    {
      "title": "Inspect Cables and Connectors",
      "instructions": "Visually inspect ECG leads and SpO₂ cables for breaks, frays, or kinks. Check that connectors are fully seated in the monitor ports. Loose or damaged connections are the most common cause of sensor errors."
    },
    {
      "title": "Confirm Proper Lead/Probe Placement",
      "instructions": "Ensure ECG electrodes are attached to the correct anatomical sites with intact adhesive. Verify SpO₂ probe is on a finger/toe with adequate perfusion, not cold or wet. Poor contact or placement can cause intermittent or false error messages."
    },
    {
      "title": "Swap Cables/Leads if Available",
      "instructions": "Replace the suspect ECG leads or SpO₂ probe with a known-good set. Observe if the error clears. Eliminates the cable as the source before suspecting monitor hardware."
    },
    {
      "title": "Check for Interference",
      "instructions": "Move patient away from high electrical interference (diathermy units, MRI, or other monitors). Ensure leads are not crossing high-power cords. Electrical noise can trigger erroneous readings."
    },
    {
      "title": "Reboot the Monitor",
      "instructions": "Power cycle the monitor after checking connections. Observe if sensor errors persist. Some software glitches resolve after a controlled reboot."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Monitor displays SpO₂ and ECG lead errors intermittently.",
      "Cause": "ECG leads were frayed and SpO₂ probe loose; connections not fully seated.",
      "Resolution": "Replaced ECG leads and repositioned SpO₂ probe; monitored signals stable. Device returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested: ✅",
    "Cable continuity checked: ✅",
    "Alarm behavior: intermittent SpO₂ drop, ECG flatline alerts",
    "Indicator lights: sensor status LEDs",
    "Unusual sounds or heat: none observed",
    "Final device status: stable after cable replacement"
  ]
},
  {
  "title": "Mindray BeneView T Series Touchscreen / Display Problems",
  "description": "Guide for troubleshooting unresponsive, erratic, or visually impaired touchscreens on Mindray BeneView T Series monitors, emphasizing external causes first.",
  "assetType": "Patient Monitor",
  "manufacturer": "Mindray",
  "model": "BeneView T Series",
  "url": "guides/mindray-t-series-touchscreen.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Ensure the monitor is plugged into a known working outlet or power strip. Check the monitor’s power switch and confirm the display lights up. Why: Touchscreen issues can mimic display failure if the monitor isn’t receiving proper power."
    },
    {
      "title": "Check Battery and Charging Status",
      "instructions": "If the monitor is battery-powered, confirm battery is charged. Swap in a known-good battery if available. Why: Low battery can cause erratic touchscreen behavior."
    },
    {
      "title": "Inspect Cables and Connections",
      "instructions": "Ensure all patient leads and accessory cables are properly seated. Look for frayed or damaged cables that may affect system function. Why: Loose or damaged connections can trigger screen errors or unresponsiveness."
    },
    {
      "title": "Perform a Soft Reset / Reboot",
      "instructions": "Use the monitor’s power button to restart the system. Wait 1–2 minutes for a full boot. Why: Temporary software glitches can cause frozen or unresponsive touchscreens."
    },
    {
      "title": "Clean the Touchscreen",
      "instructions": "Power off the monitor. Use a soft, lint-free cloth slightly dampened with manufacturer-approved cleaner. Avoid excessive moisture or harsh chemicals. Why: Dirt, grease, or residue can prevent accurate touch detection."
    },
    {
      "title": "Check Environmental Factors",
      "instructions": "Ensure the monitor is not exposed to extreme temperature, humidity, or direct sunlight. Remove nearby electronic devices that may cause interference. Why: Environmental conditions can impact touch sensitivity and display performance."
    },
    {
      "title": "Test Touch Responsiveness",
      "instructions": "Tap multiple areas of the screen after reboot. Confirm all functions respond (menu navigation, alarms, parameter selection). Why: Helps determine if the issue is localized to a portion of the screen."
    },
    {
      "title": "Check for Software Alerts or Updates",
      "instructions": "Look for any on-screen system messages or error codes. Verify if the monitor requires a software update via hospital IT or Mindray service. Why: Firmware/software issues can cause intermittent display or touchscreen failures."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Touchscreen is unresponsive, screen flickers, or buttons do not respond.",
      "Cause": "Power source and battery confirmed good. Cables and connections checked. Screen cleaned; soft reset performed. Issue persists—likely internal touchscreen or display failure.",
      "Resolution": "Device removed from service. Labeled Out of Service. Sent for repair/bench evaluation."
    }
  },
  "helpfulDetails": [
    "Power outlet verified",
    "Battery level/status checked",
    "Cables checked for integrity",
    "Soft reset performed",
    "Cleaning method documented",
    "Environmental conditions noted",
    "Touchscreen test results",
    "Any error messages or codes"
  ]
}
]
