[
{
        "title": "ICU Medical CADD-Solis – Keypad Not Responding",
        "description": "Structured troubleshooting guide for CADD-Solis infusion pumps with unresponsive or faulty keypads.",
        "assetType": "Infusion Pump",
        "manufacturer": "ICU Medical",
        "model": "CADD-Solis",
        "url": "guides/icu-cadd-solis-keypad.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the pump is actively infusing and programming changes cannot be made: Transition the patient to another verified infusion pump before troubleshooting. Do not attempt prolonged troubleshooting on an active infusion. Patient care takes priority over device diagnosis."
          },
          {
            "title": "Confirm the Pump Is Not Frozen",
            "instructions": "Observe whether the display is updating normally. Check for active alarms or error messages. Attempt multiple buttons across different areas of the keypad. If the screen is static and no inputs respond, the pump may be frozen rather than experiencing keypad hardware failure."
          },
          {
            "title": "Perform a Power Cycle",
            "instructions": "Turn the pump off. Wait at least 10 seconds. Turn the pump back on and allow it to complete full boot sequence. Temporary software or logic faults can cause keypad lockup. A full reboot resolves many intermittent issues."
          },
          {
            "title": "Inspect the Keypad Surface",
            "instructions": "Visually examine the keypad membrane for cracks, bubbling, separation, worn or faded button areas, signs of fluid intrusion, sticky or hardened residue. High-use keys (Start/Stop, Enter, navigation keys) are the most common failure points due to wear."
          },
          {
            "title": "Check for Cleaning Residue or Fluid Intrusion",
            "instructions": "Inspect edges of the keypad for signs of liquid seepage. Look for pooling of disinfectant beneath membrane edges. Clean gently per facility policy and allow to fully dry before retesting. Repeated aggressive cleaning can degrade membrane contacts over time."
          },
          {
            "title": "Test All Buttons Individually",
            "instructions": "Press each button one at a time and document which buttons fail consistently, whether failure is isolated to certain keys, and whether the entire keypad is unresponsive. If only specific keys fail, membrane contact failure is likely. If all keys fail, suspect internal ribbon connection or main board issue."
          },
          {
            "title": "Verify Battery and Power Status",
            "instructions": "Ensure battery charge is adequate. Confirm pump is not in a low-voltage or fault state. Verify proper external power connection if plugged in. Low voltage conditions can cause erratic keypad behavior."
          },
          {
            "title": "Observe and Document Behavior Pattern",
            "instructions": "Note whether the keypad works after reboot but fails later, whether only high-use keys are affected, whether pressing firmly temporarily restores function, and whether the failure is constant or intermittent. Pattern recognition helps determine whether the issue is wear-related or internal."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the keypad remains unresponsive after completing the steps above, common external causes have been ruled out. The issue is likely internal, such as keypad membrane failure, ribbon cable disconnection, or main PCB fault. Remove the pump from service. Label it Out of Service. Send for repair or Clinical Engineering bench evaluation. Bedside-level intervention should not include internal disassembly."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "Keypad buttons not responding; unable to program infusion.",
            "Cause": "Pump power-cycled and inspected. Specific keypad buttons remain non-functional. Suspected keypad membrane failure. Entire keypad non-responsive after reboot. No visible membrane damage. Suspected internal PCB or ribbon cable issue. Keypad sticky from cleaning residue. After cleaning and drying, function restored.",
            "Resolution": "Removed pump from service, labeled Out of Service, sent for repair. Tagged for Clinical Engineering bench evaluation. Cleaned keypad surface per policy; functionality restored and returned to service."
          }
        },
        "helpfulDetails": [
          "Power cycled (yes / no)",
          "Visible membrane damage (yes / no)",
          "Specific buttons affected",
          "Entire keypad unresponsive (yes / no)",
          "Signs of fluid intrusion",
          "Battery level at time of inspection",
          "Final device disposition"
        ]
      },
          {
        "title": "ICU Medical CADD-Solis – Air-in-Line Alarms",
        "description": "Structured troubleshooting guide for resolving air-in-line alarms on the ICU Medical CADD-Solis infusion pump.",
        "assetType": "Infusion Pump",
        "manufacturer": "ICU Medical",
        "model": "CADD-Solis",
        "url": "guides/icu-medical-cadd-solis-air-in-line.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "1. Ensure Patient Safety First",
            "instructions": "If actively infusing, transition the patient to an alternate pump if therapy cannot be interrupted. Do not troubleshoot on an active critical infusion when avoidable. Once therapy is safely managed, proceed with inspection. Patient safety always takes priority over device troubleshooting."
          },
          {
            "title": "2. Inspect Tubing and Cassette for Air",
            "instructions": "Stop the pump if running. Visually inspect tubing from cassette to patient. Examine the cassette reservoir for visible air. Look closely at the section of tubing that passes through the pump’s air detection area. Even small bubbles near the sensor can trigger alarms. If air is present: Re-prime tubing per manufacturer guidelines. Remove all visible air before restarting infusion."
          },
          {
            "title": "3. Check All Tubing Connections",
            "instructions": "Verify all luer connections are secure. Inspect for loose, partially threaded, or cross-threaded connections. Check for any signs of leakage. Loose connections can introduce air during infusion, especially at higher flow rates."
          },
          {
            "title": "4. Confirm Proper Cassette Installation",
            "instructions": "Remove the cassette. Re-seat it firmly into the pump. Ensure it is fully locked and secured. Verify tubing is correctly aligned within the cassette channel and pressure plate area. A partially seated cassette can cause false air detection."
          },
          {
            "title": "5. Verify Pump Orientation and Placement",
            "instructions": "Confirm the pump is upright per manufacturer guidance. Avoid placing the pump on uneven surfaces. Ensure tubing runs freely without tension or kinking. Improper orientation or tension can affect sensor accuracy."
          },
          {
            "title": "6. Power Cycle the Pump",
            "instructions": "Turn the pump off. Wait at least 10 seconds. Restart the pump. Reinstall cassette and tubing. Restart infusion and monitor. Temporary sensor or logic glitches may clear after a reboot."
          },
          {
            "title": "7. Test with Known-Good Tubing and Cassette",
            "instructions": "Replace tubing and cassette with new or verified working components. Use the same infusion settings. Observe behavior. If alarms stop: Original tubing or cassette likely had trapped air or a defect. If alarms continue: Internal air-in-line sensor, pressure plate, or logic issue is likely."
          },
          {
            "title": "8. Observe and Document Alarm Pattern",
            "instructions": "Note the following: Does alarm occur immediately upon start? Does it occur only at certain flow rates? Is there visible air when alarm triggers? Does repositioning tubing temporarily resolve it? Does priming temporarily fix the issue? Pattern recognition helps distinguish external setup issues from internal failures."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Pump repeatedly alarming for air-in-line; no visible air in tubing.”",
            "Cause": "“Tubing inspected and re-primed; cassette reseated; alarm persists.” “Replaced tubing and cassette; alarms continue. Suspected internal air sensor issue.”",
            "Resolution": "“Removed from service, labeled Out of Service, sent for bench evaluation.” “Replaced defective tubing and cassette; infusion resumed without alarms.” “Power cycled and reseated cassette; issue resolved.”"
          }
        },
        "helpfulDetails": [
          "Tubing primed (yes / no)",
          "Tubing replaced/tested",
          "Cassette replaced/tested",
          "Pump orientation verified",
          "Alarm timing (immediate vs. during infusion)",
          "Flow rate at time of alarm",
          "Visible air present (yes / no)",
          "Final device status (returned to service or sent for repair)"
        ]
      },
          {
        "title": "ICU Medical CADD-Solis – Occlusion Alarms – Especially False Occlusions",
        "description": "Structured troubleshooting guide for addressing occlusion alarms and false occlusions on the ICU Medical CADD-Solis infusion pump.",
        "assetType": "Infusion Pump",
        "manufacturer": "ICU Medical",
        "model": "CADD-Solis",
        "url": "guides/icu-cadd-solis-occlusion.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "1. Ensure Patient Safety First",
            "instructions": "If actively infusing, transition the patient to another pump if clinically necessary. Do not perform extended troubleshooting on a device connected to a patient receiving critical medication. Patient safety takes priority over device evaluation."
          },
          {
            "title": "2. Inspect the Entire Tubing Path",
            "instructions": "Stop the infusion. Trace the tubing from cassette to patient. Look for: Kinks or sharp bends. Tubing pinched under bed rails, clothing, or clamps. Closed slide clamps. Tight securement at the IV site. Even minor kinks or tension can create enough back pressure to trigger an occlusion alarm."
          },
          {
            "title": "3. Verify Proper Cassette Seating",
            "instructions": "Remove the cassette. Inspect the cassette interface area. Confirm: Tubing is correctly seated in the pressure channel. Cassette clicks fully into place. No misalignment or partial engagement. Improper seating can cause inaccurate pressure detection."
          },
          {
            "title": "4. Inspect the Pressure Plate and Channel",
            "instructions": "Examine the pump’s pressure plate and cassette channel. Look for: Dried medication residue. Debris or contamination. Warped or cracked pressure components. Clean per facility policy if debris is present. Residue or physical distortion can cause false pressure readings."
          },
          {
            "title": "5. Confirm Correct and Compatible Tubing",
            "instructions": "Verify the cassette and tubing type match the therapy mode (continuous, PCA, intermittent). Confirm tubing is compatible with the CADD-Solis system. Check expiration date and physical condition. Worn, stiff, or incompatible tubing can increase resistance and trigger intermittent alarms."
          },
          {
            "title": "6. Check Pump Orientation and Placement",
            "instructions": "Ensure the pump is positioned according to manufacturer guidance. Avoid upside-down orientation. Confirm tubing runs freely without tension. Pressure sensors can react to mechanical stress if the pump or tubing is under strain."
          },
          {
            "title": "7. Power Cycle the Pump",
            "instructions": "Turn the pump off. Wait at least 10 seconds. Turn it back on. Reinstall cassette and tubing. Temporary sensor or logic irregularities may clear after a reboot."
          },
          {
            "title": "8. Test with Known-Good Components",
            "instructions": "Replace cassette and tubing with verified working components. Attempt infusion at the same programmed settings. If alarms stop: → Original tubing or cassette likely defective. If alarms continue: → Internal pressure sensor, pressure plate assembly, or logic issue is likely."
          },
          {
            "title": "9. Observe Alarm Pattern",
            "instructions": "Document: Does the alarm occur immediately on start? Only at higher flow rates? Intermittently during steady infusion? Does adjusting tubing temporarily clear it? Pattern recognition helps distinguish external resistance from internal sensing failure."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Pump repeatedly alarming ‘Occlusion’ during infusion; tubing appears patent.”",
            "Cause": "“Tubing inspected, no kinks noted. Cassette reseated. Pump power-cycled. Tested with known-good tubing and cassette. Occlusion alarm persisted. Suspect internal pressure sensor or pressure plate issue.” OR “Tubing found kinked under bed rail causing intermittent occlusion.”",
            "Resolution": "“Repositioned tubing; infusion resumed without alarms.” “Replaced defective cassette; pump functioning normally.” “Removed pump from service, labeled Out of Service, sent to CE bench for evaluation.”"
          }
        },
        "helpfulDetails": [
          "Tubing path clear (yes/no)",
          "Cassette replaced (yes/no)",
          "Known-good tubing tested (yes/no)",
          "Pump orientation verified",
          "Alarm timing (immediate or during infusion)",
          "Flow rate at time of alarm",
          "Any visible residue or contamination",
          "Final disposition (returned to service or sent for repair)"
        ]
      },
          {
        "title": "ICU Medical CADD-Solis Cassette Not Recognized / Cassette Error",
        "description": "Structured troubleshooting guide for ICU Medical CADD-Solis pumps displaying cassette recognition errors.",
        "assetType": "Infusion Pump",
        "manufacturer": "ICU Medical",
        "model": "CADD-Solis",
        "url": "guides/icu-cadd-solis-cassette-error.html",
        "dateAdded": "2026-02-16",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the pump is actively infusing: Transition the patient to another pump if therapy must continue. Stop the pump safely per facility policy. Do not troubleshoot while connected to an active patient unless therapy is safely paused. This prevents interruption of critical infusion therapy."
          },
          {
            "title": "Remove and Re-seat the Cassette",
            "instructions": "Stop the pump if running. Remove the cassette completely. Inspect the pump cassette interface. Reinstall the cassette firmly until it clicks and locks into place. Confirm the cassette is: Properly aligned. Fully seated. Locked securely. A partially engaged cassette is the most common cause of recognition errors."
          },
          {
            "title": "Inspect the Cassette for Physical Damage",
            "instructions": "Examine: Cassette housing. Tubing channel. Keying/alignment features. Pressure plate contact area. Look for: Bent or broken alignment tabs. Cracked or warped plastic. Signs of fluid contamination. Dried medication residue. Even minor warping can prevent proper sensor engagement. Replace the cassette if any defect is observed."
          },
          {
            "title": "Confirm Cassette Compatibility",
            "instructions": "Verify: Cassette type matches the programmed therapy. Volume (50 mL, 100 mL, etc.) matches pump configuration. Cassette is approved for CADD-Solis use. If unsure, compare with a known-good cassette from the same stock. Incorrect cassette type can trigger validation errors."
          },
          {
            "title": "Inspect the Pump Cassette Latch Area",
            "instructions": "With the cassette removed: Check for debris or dried medication residue. Inspect latch mechanism for smooth movement. Look for plastic fragments or obstruction. Confirm latch does not feel loose or damaged. Clean gently per facility cleaning policy if contamination is present. Obstructions can prevent proper sensor or latch engagement."
          },
          {
            "title": "Power Cycle the Pump",
            "instructions": "Turn the pump off. Wait at least 10 seconds. Turn it back on. Reinstall the cassette. Temporary logic or sensor faults may clear after a reboot."
          },
          {
            "title": "Test with a Known-Good Cassette",
            "instructions": "Install a new, unused cassette: Attempt to program and start infusion. If the error clears: The original cassette was likely defective or warped. If the error persists with multiple cassettes: Suspect internal pump issue (cassette detection sensor, latch microswitch, pressure sensing mechanism, or PCB fault)."
          },
          {
            "title": "Observe and Document Exact Error Behavior",
            "instructions": "Record: Does the error occur immediately upon installation? Does it occur only when starting infusion? Are there additional pressure or occlusion messages? Does the latch feel loose or not fully engaging? This information helps determine whether the issue is mechanical, sensor-related, or logic-based."
          }
        ],
        "documentation": {
          "CCR": {
            "Complaint": "“Pump displaying ‘Cassette Error’ — cassette not recognized after installation.”",
            "Cause": "“Cassette reseated and replaced with known-good cassette. Error persists. Suspected internal cassette detection sensor or latch switch failure.”",
            "Resolution": "“Removed pump from service, labeled Out of Service, sent for repair.”"
          }
        },
        "helpfulDetails": [
          "Cassette reseated (yes / no)",
          "New cassette tested (yes / no)",
          "Visible cassette damage observed",
          "Latch engagement normal (yes / no)",
          "Error immediate or during infusion start",
          "Presence of additional pressure or occlusion alarms",
          "Final device disposition (returned to service or sent for repair)"
        ]
      }
]
