[
{
  "title": "Hamilton G5 Ventilator – Flow Sensor Errors",
  "description": "Troubleshooting guide for Hamilton G5 ventilator flow sensor alarms, calibration failures, and inaccurate flow or tidal volume readings.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "G5",
  "url": "guides/hamilton-g5-flow-sensor-errors.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Transfer the patient to another ventilator if actively in use. Do not troubleshoot flow measurement issues while connected to a patient. Flow sensor errors directly affect delivered volume accuracy and patient safety."
    },
    {
      "title": "Identify the Exact Alarm Message",
      "instructions": "Document the specific wording of the alarm. Document when it occurs (startup, during ventilation, during calibration). Determine whether it is intermittent or constant. This helps determine whether the issue is setup-related or hardware-related."
    },
    {
      "title": "Inspect the Flow Sensor for Moisture or Contamination",
      "instructions": "The Hamilton G5 flow sensor is highly sensitive to condensation, secretions, nebulized medications, and improper cleaning. Remove the flow sensor from the circuit. Inspect visually for moisture or debris. If wet, dry completely per facility protocol. Replace with a known-good spare sensor if available. Moisture is one of the most common causes of flow sensor alarms."
    },
    {
      "title": "Verify Proper Sensor Orientation and Connection",
      "instructions": "Confirm the flow sensor is installed in the correct direction. Ensure connectors are fully seated. Inspect the cable connection to the ventilator module. Check for bent pins or damaged connectors. Improper orientation or loose connections can generate false readings or calibration failures."
    },
    {
      "title": "Replace the Breathing Circuit",
      "instructions": "A compromised circuit can cause leaks, resistance changes, and flow miscalculations. Replace the entire patient circuit with a new, dry circuit. Avoid reusing circuits with heavy condensation. Ensure all connections are tight. Reattempt calibration after replacement."
    },
    {
      "title": "Perform Flow Sensor Calibration",
      "instructions": "Perform flow sensor calibration per facility procedure using the ventilator’s service or setup menu. Ensure no patient is connected during calibration. Ensure the circuit is dry and properly assembled. If calibration fails repeatedly with multiple sensors and circuits, the issue may be internal."
    },
    {
      "title": "Check for Excessive Condensation in the Expiratory Path",
      "instructions": "Inspect the expiratory valve assembly, water traps, and heated wire circuit function. Drain any water traps. Excess moisture can affect measurement accuracy and trigger alarms."
    },
    {
      "title": "Inspect for Physical Damage",
      "instructions": "Examine the sensor for cracks, warping, discoloration, and evidence of overheating. Replace if any damage is present."
    },
    {
      "title": "Power Cycle the Ventilator",
      "instructions": "Turn the ventilator off properly. Wait 30 seconds. Restart and observe for recurrence. Intermittent software-related sensor detection issues may clear with a restart."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reported ‘Flow Sensor Error’ alarm on Hamilton G5. Ventilator failed pre-use calibration.",
      "Cause": "Flow sensor found with internal condensation. Circuit also contained excessive moisture.",
      "Resolution": "Replaced flow sensor and breathing circuit. Performed successful flow sensor calibration. Ventilator passed operational check and returned to service."
    }
  },
  "helpfulDetails": [
    "Calibration pass/fail status",
    "Number of sensors tested",
    "Circuit replaced (Yes/No)",
    "Moisture present (Yes/No)",
    "Alarm message wording",
    "Final operational status"
  ]
},
  {
  "title": "Hamilton G5 Ventilator – Startup / Self-Test Failures",
  "description": "Troubleshooting guide for Hamilton G5 ventilator startup and self-test failures using logical external checks before internal escalation.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "G5",
  "url": "guides/hamilton-g5-self-test-failures.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Ensure the Patient Is Safely Supported",
      "instructions": "Do not troubleshoot while connected to a patient. Transfer the patient to another ventilator before proceeding. Confirm alternative ventilation is stable. Patient safety is always the first step."
    },
    {
      "title": "Verify AC Power Source",
      "instructions": "Confirm the power cord is fully seated at both the ventilator and wall outlet. Test the wall outlet with a known working device. Avoid power strips if possible—plug directly into a hospital-grade outlet. Confirm the power indicator LED illuminates when plugged in. Startup failures are frequently related to unstable or intermittent AC power."
    },
    {
      "title": "Check Battery Status",
      "instructions": "Attempt startup on AC power with battery installed. If unit attempts to boot then shuts down, battery may be severely depleted or failed. Remove and reseat the battery if accessible without disassembly. Observe battery indicator messages during startup. A failing internal battery can interrupt self-test even when AC is connected."
    },
    {
      "title": "Verify Gas Supply Connections",
      "instructions": "Confirm oxygen and air hoses are properly connected and fully seated. Ensure wall gas pressure is within normal range (typically ~50 psi in U.S. facilities). Swap gas hoses with known-good hoses if supply pressure alarms appear. Listen for leaks at quick-connect fittings. The G5 performs gas pressure checks during startup. Insufficient supply can stop the self-test."
    },
    {
      "title": "Inspect Patient Circuit and Flow Sensor",
      "instructions": "Remove the patient circuit and attempt startup without the circuit attached. Inspect the flow sensor for moisture, contamination, or incorrect orientation. Ensure expiratory valve assembly is properly seated. Replace with known-good components if available. Improperly installed or contaminated components can trigger self-test failure."
    },
    {
      "title": "Observe and Document Error Messages",
      "instructions": "Record exact wording of error messages or codes. Note whether failure occurs immediately or at a specific phase (e.g., leak test, valve test). Listen for abnormal sounds (clicking, repeated cycling, no compressor sound). Pattern recognition helps determine whether the issue is accessory-related or internal."
    },
    {
      "title": "Power Cycle Properly",
      "instructions": "Turn unit fully off. Disconnect AC power for 60 seconds. Reconnect and attempt a clean startup. This allows internal capacitors and logic boards to fully reset."
    },
    {
      "title": "Inspect for Environmental Factors",
      "instructions": "Check for excessive dust buildup around air intake filters. Ensure rear cooling vents are not obstructed. Confirm the unit is not overheated. Thermal or airflow restrictions may interrupt boot sequence."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails startup self-test and displays system failure during boot.",
      "Cause": "Unit failed during valve calibration phase. Verified AC power, gas supply at 50 psi, replaced circuit and flow sensor with known-good components. Error persisted after power cycle.",
      "Resolution": "Removed from service. Labeled Out of Service. Sent to bench for internal evaluation and repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Gas pressure verified",
    "Battery status observed",
    "Circuit swapped",
    "Flow sensor replaced",
    "Exact error message recorded",
    "Whether unit fully powers on or shuts down",
    "Final device status (Removed from Service)"
  ]
},
  {
  "title": "Hamilton C6 Ventilator Battery Won’t Hold Charge",
  "description": "Guide for troubleshooting Hamilton C6 ventilator battery that does not hold charge or charges poorly.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C6",
  "url": "guides/hamilton-c6-battery.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Safety First – Patient Not on Battery",
      "instructions": "Ensure the ventilated patient is on mains power or an alternative power source. Do not rely on a low or questionable battery during active ventilation."
    },
    {
      "title": "Verify Primary Power Connection",
      "instructions": "Confirm the ventilator is plugged into a properly grounded, hospital‑grade receptacle.\nMake sure the AC mains power is present at the outlet (use a known good outlet tester).\nInspect the power cord and connector for damage or loose contacts.\nWhy: The ventilator only charges its batteries when connected to primary AC power. No mains means no charging regardless of battery condition."
    },
    {
      "title": "Check Ambient Conditions",
      "instructions": "Ensure the ventilator and battery are not being charged at temperatures >43 °C (e.g., near heat sources or in direct sunlight). High temperature can prevent charging."
    },
    {
      "title": "Install and Seat Battery Correctly",
      "instructions": "Remove and re‑install the battery to verify it is properly seated and the lock is fully engaged.\nInspect battery contacts for debris or corrosion."
    },
    {
      "title": "Observe Battery Indicators",
      "instructions": "Review the battery charge indicator on the ventilator display.\nIf the battery reads empty or does not register, check for any Battery communication error alarms; these may indicate poor connection or failed battery detection."
    },
    {
      "title": "Swap With Known Good Battery",
      "instructions": "If a second battery is available, swap it in and test whether it charges and holds charge.\nIf the spare battery behaves normally, the original battery may have degraded."
    },
    {
      "title": "Battery Calibration/Service Hint",
      "instructions": "Some designs internally calibrate battery capacity over multiple charge/discharge cycles; if the battery has not been used or calibrated in a long time, run a few controlled cycles (connect to mains, allow full charge, disconnect, allow full discharge) with service oversight.\nRefer to manufacturer for recommended calibration/test intervals."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit displays poor battery charge retention, depletes quickly, and will not hold charge.",
      "Cause": "Verified AC power present; battery does not indicate full charge; spare battery also fails; charging does not appear to progress; ambient conditions within normal range.",
      "Resolution": "Removed battery from service; unit labeled Out of Service; vendor notified for battery replacement; scheduled for bench evaluation."
    }
  },
  "helpfulDetails": [
    "Battery charge behavior over time",
    "Indicators and alarms",
    "Power cord and outlet condition",
    "Ambient temperature during charging",
    "Final device status after battery removal"
  ]
},
  {
  "title": "Hamilton C6 Ventilator - Transport Ventilator Troubleshooting",
  "description": "Step-by-step troubleshooting guide for Hamilton C6 ventilator in transport mode, emphasizing external checks and patient safety.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C6",
  "url": "guides/hamilton-c6-transport-troubleshooting.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Check Power Source",
      "instructions": "Verify the internal battery is charged. Confirm AC power connection if in stationary use. Reason: Transport mode relies on battery; insufficient power prevents operation."
    },
    {
      "title": "Confirm Battery Status",
      "instructions": "Look for battery indicator on screen. If battery low (<20%), replace or fully charge. Reason: Low battery may prevent ventilator from initiating transport mode."
    },
    {
      "title": "Inspect Gas Supply Connections",
      "instructions": "Ensure oxygen and air cylinders are properly connected and valves open. Verify hoses are not kinked or leaking. Reason: Transport mode may rely on cylinders rather than wall supply."
    },
    {
      "title": "Verify Ventilator Mode and Settings",
      "instructions": "Confirm ventilator is in the correct transport mode. Ensure settings match patient requirements (tidal volume, PEEP, FiO₂). Reason: Misconfigured modes can trigger alarms or fail to deliver breaths."
    },
    {
      "title": "Check Circuit and Patient Connection",
      "instructions": "Inspect breathing circuit, filters, and endotracheal tube connection. Make sure no obstructions exist. Reason: Even during transport, ventilator cannot operate with disconnected or blocked circuits."
    },
    {
      "title": "Run System Self-Test (if safe)",
      "instructions": "Perform a pre-use check following on-screen prompts. Reason: Confirms basic system function and identifies any internal errors without disassembly."
    },
    {
      "title": "Observe Alarm Messages",
      "instructions": "Note any error codes or messages. Reason: These guide further action; some may indicate battery, gas, or circuit issues."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator would not operate during patient transport; alarms displayed “Battery Low” and “No Volume Delivered.”",
      "Cause": "Battery fully discharged; transport mode could not initiate.",
      "Resolution": "Battery replaced and fully charged; pre-use check passed; device confirmed functional in transport mode."
    }
  },
  "helpfulDetails": [
    "Battery charge level",
    "AC vs. battery operation",
    "Cylinder pressure readings",
    "Circuit status",
    "Any alarm codes observed"
  ]
},
  {
  "title": "Hamilton G5 Ventilator – Oxygen Blending / FiO₂ Mismatch",
  "description": "Troubleshooting guide for Hamilton G5 ventilator FiO₂ mismatch, high/low oxygen alarms, and oxygen blending inconsistencies.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "G5",
  "url": "guides/hamilton-g5-oxygen-blending.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Confirm Patient Safety First",
      "instructions": "If the ventilator is actively supporting a patient, move the patient to another ventilator before troubleshooting. Do not attempt oxygen delivery troubleshooting while the device is in clinical use. This prevents unintended hypoxia or hyperoxia during testing."
    },
    {
      "title": "Verify Wall Gas Supply",
      "instructions": "Confirm oxygen and air hoses are connected to the correct wall outlets. Check that both supplies are fully inserted and locked. Confirm wall pressure is within normal range (typically ~50 psi in U.S. facilities). If available, connect to a known-good outlet. The G5 blends oxygen and medical air internally. If one source is absent, low, or cross-connected, the delivered FiO₂ will not match the set value."
    },
    {
      "title": "Inspect Gas Hoses and DISS Fittings",
      "instructions": "Check hoses for kinks, crushing, or damage. Inspect DISS fittings for debris or worn washers. Swap hoses with known-good hoses if uncertainty exists. A partially restricted air line, for example, can result in higher-than-set FiO₂."
    },
    {
      "title": "Check for Crossed Gas Lines",
      "instructions": "Confirm oxygen hose is connected to the oxygen inlet. Confirm air hose is connected to the air inlet. Trace hoses physically from wall to ventilator if necessary. Crossed gas lines are a common external cause of FiO₂ mismatch."
    },
    {
      "title": "Run the Pre-Use Check / Calibration",
      "instructions": "Perform a full system check per facility protocol. Allow the ventilator to complete oxygen sensor calibration. Observe if any gas supply or blending-related warnings appear. If the oxygen sensor calibration fails, this may indicate sensor drift or internal issue."
    },
    {
      "title": "Verify Oxygen Sensor Status",
      "instructions": "Check oxygen sensor age and service interval. If the sensor is near end-of-life, replace per facility policy. After replacement, repeat calibration and verify stability. A drifting or expired oxygen sensor can falsely indicate mismatch even when blending is correct."
    },
    {
      "title": "Compare with External Oxygen Analyzer (If Available)",
      "instructions": "Connect an external calibrated oxygen analyzer to the inspiratory limb. Compare displayed FiO₂ with ventilator reading. If external analyzer matches the ventilator → likely gas supply issue upstream. External analyzer disagrees with ventilator → suspect internal sensor or calibration issue. This step helps differentiate measurement error from true blending error."
    },
    {
      "title": "Check for Active Alarms or Messages",
      "instructions": "Document any of the following: Low O₂ supply alarm, Air supply alarm, FiO₂ out-of-range, Calibration failure. Alarm behavior can help determine whether the issue is supply-related, sensor-related, or blending-related."
    },
    {
      "title": "Observe Stability Over Time",
      "instructions": "Set a fixed FiO₂ (e.g., 50%). Monitor reading for drift. Check if fluctuations correlate with supply pressure changes. Intermittent drift may suggest unstable supply pressure rather than internal failure."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Respiratory therapist reported that the ventilator was set to 40% FiO₂ but displayed 55% and triggered high oxygen alarm.",
      "Cause": "Air hose was partially kinked behind the equipment boom, restricting air supply and causing higher-than-set oxygen concentration.",
      "Resolution": "Replaced air hose, verified supply pressures, recalibrated oxygen sensor, and confirmed FiO₂ accuracy with external analyzer. Ventilator passed system check and returned to service."
    }
  },
  "helpfulDetails": [
    "Wall outlet pressures verified",
    "Hoses swapped with known-good set",
    "Oxygen sensor age noted",
    "External analyzer comparison performed",
    "Final operational status documented"
  ]
},
  {
  "title": "Hamilton C6 Ventilator Touchscreen Lag / Freeze",
  "description": "Troubleshooting guide for touchscreen lag, freezes, and unresponsive menus on the Hamilton C6 ventilator.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C6",
  "url": "guides/hamilton-c6-touchscreen.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Check Power Source",
      "instructions": "Verify AC mains connection or battery level. Low voltage or unstable power can cause the touchscreen to lag."
    },
    {
      "title": "Inspect Cables and Connectors",
      "instructions": "Ensure AC power cord, battery contacts, and any USB/data ports are fully seated. Look for bent pins, corrosion, or frayed cables that could affect system stability."
    },
    {
      "title": "Confirm Environmental Conditions",
      "instructions": "Ensure the ventilator is not exposed to excessive heat, direct sunlight, or high humidity, which can slow touch response. Remove any dust, liquid, or debris from the touchscreen surface."
    },
    {
      "title": "Restart the Device",
      "instructions": "Power down the ventilator completely. Wait 30–60 seconds and power back on. Observe if touchscreen responsiveness improves."
    },
    {
      "title": "Check for Software Updates",
      "instructions": "If safe to do so, verify the device firmware version. Outdated firmware can cause UI lag; note version for service records."
    },
    {
      "title": "Reduce System Load",
      "instructions": "Close non-essential menus or monitoring windows if the device allows. Excessive simultaneous monitoring can temporarily slow touchscreen response."
    },
    {
      "title": "Observe for Patterned Behavior",
      "instructions": "Note if freezing occurs with certain menus, alarms, or settings. Document times, duration, and any error messages for service escalation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator touchscreen is slow and sometimes freezes during normal operation.",
      "Cause": "Observed lag and unresponsive touch panels even after verifying power, connections, and environmental conditions.",
      "Resolution": "Device powered down, restarted, monitored; issue persists. Device labeled out of service and sent for repair."
    }
  },
  "helpfulDetails": [
    "AC outlet tested and confirmed stable",
    "Battery contacts inspected",
    "No visible damage to touchscreen",
    "Software version documented",
    "Final status: Out of Service"
  ]
},
  {
  "title": "Hamilton C3 Ventilator Pre-Use Check Failures",
  "description": "Guide for troubleshooting Hamilton C3 ventilator pre-use check failures, focusing on external checks before internal issues.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C3",
  "url": "guides/hamilton-c3-pre-use-check.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Ensure the ventilator is connected to a live outlet or fully charged battery. Confirm the line voltage matches specifications. Why: Inadequate or unstable power can prevent successful pre-use checks."
    },
    {
      "title": "Check Battery and Battery Seating",
      "instructions": "Remove and reseat the battery module. Inspect for corrosion or loose connections. If using external power, ensure battery bypass is properly engaged. Why: The ventilator will fail checks if it cannot verify battery status."
    },
    {
      "title": "Inspect Circuit and Humidifier Connections",
      "instructions": "Ensure patient circuit is properly attached and no leaks are present. Check that all tubing, sensors, and filters are correctly seated. Why: Disconnected or misconnected circuits can trigger pre-use alarms."
    },
    {
      "title": "Check Flow Sensor / CO₂ Module (if applicable)",
      "instructions": "Ensure modules are plugged in and recognized by the system. Look for any warning LEDs or disconnected cables. Why: Missing or unrecognized modules will halt pre-use testing."
    },
    {
      "title": "Examine Filters and Water Traps",
      "instructions": "Ensure airway filters and water traps are installed and not saturated. Replace if needed. Why: Blocked sensors or saturated filters can cause check failures."
    },
    {
      "title": "Restart Ventilator",
      "instructions": "Power down completely, wait 30 seconds, then power on. Observe self-test sequence carefully. Why: Temporary software glitches or communication errors can sometimes be cleared with a restart."
    },
    {
      "title": "Review Error Codes / Alarms",
      "instructions": "Note any displayed messages and consult internal code definitions. Why: Error codes often identify the subsystem causing pre-use check failure."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator failed pre-use check during startup; displayed “Check Failure” error.",
      "Cause": "Circuit not properly connected; battery seating verified; filters installed correctly.",
      "Resolution": "Reconnected circuit, reseated battery, replaced saturated filter; pre-use check passed after restart."
    }
  },
  "helpfulDetails": [
    "Power outlet tested",
    "Battery voltage verified",
    "Patient circuit connection checked",
    "Flow/CO₂ modules seated",
    "Filters and water traps inspected",
    "Error codes logged",
    "Final device status after troubleshooting"
  ]
},
  {
  "title": "Hamilton C3 Ventilator - Touchscreen Lag or Freeze",
  "description": "Guide for troubleshooting delayed or unresponsive touchscreen on Hamilton C3 ventilators, focusing on external and software checks before hardware intervention.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C3",
  "url": "guides/hamilton-c3-touchscreen.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Verify Power Supply",
      "instructions": "Ensure the ventilator is connected to a verified working AC outlet. Check the battery level; low battery can cause UI lag. Why: Inconsistent power can cause touchscreen responsiveness issues."
    },
    {
      "title": "Reboot the Ventilator",
      "instructions": "Power off the unit using proper shutdown procedure. Wait 30 seconds, then power back on. Why: Temporary software glitches are often resolved by a clean restart."
    },
    {
      "title": "Check External Connections",
      "instructions": "Disconnect any non-essential peripherals (USB drives, external sensors, printer). Confirm that circuit connections and breathing system components are properly seated. Why: Conflicts with external devices can cause system lag."
    },
    {
      "title": "Inspect Touchscreen Surface",
      "instructions": "Clean the screen with a soft, lint-free cloth. Avoid harsh chemicals. Check for moisture, condensation, or physical damage. Why: Debris or moisture can interfere with touch detection."
    },
    {
      "title": "Monitor Software Status",
      "instructions": "Check for on-screen messages indicating software updates or errors. Verify that the system is running the latest approved firmware. Why: Outdated or interrupted updates can reduce touchscreen performance."
    },
    {
      "title": "Reset Non-volatile Memory (if instructed by software)",
      "instructions": "Follow the C3 software prompts for safe reset of touchscreen parameters. Why: Certain UI parameters can become corrupted and resetting may restore normal operation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Clinician reports the ventilator touchscreen is slow or unresponsive.",
      "Cause": "Observed intermittent lag, temporary freezes, and unregistered inputs; power and connections verified.",
      "Resolution": "Ventilator rebooted; peripherals disconnected; screen cleaned; firmware verified. Issue persists → unit labeled Out of Service and sent for service."
    }
  },
  "helpfulDetails": [
    "AC outlet tested and verified",
    "Battery charged",
    "Peripherals disconnected",
    "Screen cleaned and visually inspected",
    "Firmware version checked",
    "Final device status: Out of Service"
  ]
},
  {
  "title": "Hamilton MR1 Ventilator - Flow Delivery Problems",
  "description": "Guide for troubleshooting flow delivery issues on the Hamilton MR1 ventilator, focusing on external checks before internal repair.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "MR1",
  "url": "guides/hamilton-mr1-flow-delivery-problems.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Ensure Safe Environment",
      "instructions": "Confirm patient is supported on an alternative ventilator or manual bagging if necessary. Do not troubleshoot flow issues on an actively ventilated patient without backup."
    },
    {
      "title": "Check Power Supply",
      "instructions": "Verify AC mains and battery status. Ensure the ventilator is fully powered and not in low-battery or power-failure mode."
    },
    {
      "title": "Verify Circuit Connections",
      "instructions": "Inspect inspiratory and expiratory limbs for secure connections. Confirm the patient circuit is assembled according to MR1 guidelines."
    },
    {
      "title": "Check for Obstructions",
      "instructions": "Examine filters, humidifiers, and bacterial/viral filters for blockage. Remove or replace any suspect filter and verify flow."
    },
    {
      "title": "Inspect Sensors and Tubing",
      "instructions": "Ensure flow sensors are properly installed and not wet, dirty, or kinked. Verify that the flow sensor calibration or zeroing step completed successfully."
    },
    {
      "title": "Check for Leaks",
      "instructions": "Inspect patient circuit and endotracheal tube connections for leaks. Confirm cuff inflation if using an ETT or tracheostomy."
    },
    {
      "title": "Review Ventilator Settings",
      "instructions": "Confirm tidal volume, inspiratory flow, and mode settings are appropriate. Compare set vs. delivered values on the MR1 display."
    },
    {
      "title": "Run Built-In Self-Test",
      "instructions": "Perform the MR1’s ventilator self-test. Observe any error codes, especially those related to flow sensors or pneumatic systems."
    },
    {
      "title": "Swap Accessories",
      "instructions": "If available, swap the circuit and flow sensor with a known working set to isolate the problem."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator not delivering expected flow; alarms “Low Flow” triggered.",
      "Cause": "Flow sensor was wet and partially obstructed; circuit had minor leak at connection.",
      "Resolution": "Cleaned and reinstalled flow sensor; checked circuit connections; confirmed proper tidal volume delivery on test lung."
    }
  },
  "helpfulDetails": [
    "Power source verified (AC and battery)",
    "Circuit and flow sensor checked",
    "Filters inspected and replaced if needed",
    "Alarms and error codes noted",
    "Patient safely transitioned if required"
  ]
},
  {
  "title": "Hamilton MR1 Ventilator - Battery / Power Failure",
  "description": "Guide for troubleshooting Hamilton MR1 ventilator battery or power failures focusing on external checks before internal repair.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "MR1",
  "url": "guides/hamilton-mr1-battery.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Confirm AC Power Availability",
      "instructions": "Verify the wall outlet is live using a known-working device or outlet tester. Check that the MR1 power cord is fully inserted and undamaged. Why: An MR1 may fail to power on if the outlet is dead or cord is damaged."
    },
    {
      "title": "Inspect the Power Cord and Adapter",
      "instructions": "Look for frays, cuts, or bent prongs on the power cord. Swap with a spare compatible power cord if available. Why: External cord damage is a common cause of power issues."
    },
    {
      "title": "Check Battery Installation",
      "instructions": "Ensure the battery pack is fully seated in the ventilator battery compartment. Verify the battery is the correct type for the MR1. Why: Loose or incompatible batteries can prevent startup or trigger low-battery alarms."
    },
    {
      "title": "Charge the Battery",
      "instructions": "Connect the ventilator to AC power and allow the battery to charge for the recommended time (per manufacturer guidelines). Observe whether the charging indicator illuminates. Why: A completely drained battery may prevent power-on until partially charged."
    },
    {
      "title": "Perform a Soft Reset / Power Cycle",
      "instructions": "If the ventilator has a soft reset or restart procedure, perform it. Disconnect from AC power, remove the battery, wait 30 seconds, reinstall battery, and reconnect AC power. Why: Power glitches can sometimes be cleared by a complete cycle."
    },
    {
      "title": "Swap Batteries (if available)",
      "instructions": "Test the ventilator with a known-good battery pack. Why: Confirms whether the original battery is faulty."
    },
    {
      "title": "Observe for Alarms / Error Messages",
      "instructions": "Note any battery-related alerts or error codes. Why: Error codes can help differentiate between battery failure, charger fault, or internal power module issues."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails to power on; battery warning displayed.",
      "Cause": "Observed that battery pack was fully drained and AC outlet was functional. Power cord intact. Battery failed to charge after extended connection.",
      "Resolution": "Removed battery; installed a known-good battery. Verified ventilator powers on and charges correctly. Labeled old battery as defective for replacement."
    }
  },
  "helpfulDetails": [
    "Outlet verified and tested with a known device",
    "Power cord checked for damage",
    "Battery type and installation verified",
    "Charging indicator behavior",
    "Any error codes or alarms",
    "Final ventilator status after testing"
  ]
},
  {
  "title": "Hamilton‑C3 Battery Won’t Hold Charge",
  "description": "Guide for troubleshooting a Hamilton‑C3 ventilator battery that won’t hold charge or discharges rapidly.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C3",
  "url": "guides/hamilton-c3-battery.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Confirm Connection to Primary Power (AC/DC)",
      "instructions": "Ensure the ventilator is connected to AC mains or appropriate DC power and verify the charging indicator shows a charge in progress. The batteries charge only when primary power is present; if there’s no proper connection to mains or DC, the battery won’t charge fully."
    },
    {
      "title": "Check Battery Charge Indicator Icons",
      "instructions": "Look at the display icons for battery status (green = charged; orange/green = partial; crossed‑out = discharged/defective). A crossed‑out battery symbol often means the battery is discharged or faulty."
    },
    {
      "title": "Verify Battery Age and Usage History",
      "instructions": "Batteries have a limited cycle life (typically a few hundred cycles for medical ventilator Li‑ion cells). If the battery is old or has been deeply discharged repeatedly, capacity will degrade. Hospitals often find every 2–3 years battery life drops significantly; a failing pack won’t hold charge even after charging."
    },
    {
      "title": "Ensure Proper Charging Period",
      "instructions": "Charge on primary power for several hours (4+ hours) to bring battery up to 80‑100% per the manual before testing how long it holds. Short charge cycles may not allow full capacity."
    },
    {
      "title": "Swap or Test With Second Battery (if installed)",
      "instructions": "If the C3 has two batteries installed, swap them to see if one holds charge better. A rapid drop in available time on battery suggests the pack itself is worn."
    },
    {
      "title": "Check Operating Environment",
      "instructions": "High temperatures during charging or storage and prolonged idle periods without use can degrade battery performance. Store spare batteries in cool, dry conditions and cycle them monthly."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Battery will not retain charge; battery time drops to near zero shortly after full charge.",
      "Cause": "Battery status indicator shows degraded battery despite being connected to primary power for >4 hours; battery is likely worn out.",
      "Resolution": "Replaced ventilator battery with a new Hamilton Medical Li‑ion battery pack; verified charging and normal battery run‑time."
    }
  },
  "helpfulDetails": [
    "Alarm behavior",
    "Power connection verified",
    "Battery icon status",
    "Battery age and cycle history",
    "Charging period duration",
    "Operating environment temperature",
    "Final device status after battery replacement"
  ]
},
  {
  "title": "Hamilton MR1 Ventilator - Alarm Malfunctions",
  "description": "Guide for troubleshooting false, intermittent, or misconfigured alarms on the Hamilton MR1 ventilator.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "MR1",
  "url": "guides/hamilton-mr1-alarm-malfunctions.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Check Power Supply",
      "instructions": "Verify the ventilator is connected to a properly functioning outlet. Inspect for any battery low warnings. Why: Insufficient or fluctuating power can cause false alarms or silence critical alerts."
    },
    {
      "title": "Inspect Ventilator Cables and Connectors",
      "instructions": "Examine all patient circuit connections and sensors (pressure, flow, O₂ sensors). Ensure cables are seated fully and not damaged. Why: Loose or damaged sensors commonly cause alarm malfunctions."
    },
    {
      "title": "Verify Alarm Settings",
      "instructions": "Confirm that high/low limits for pressure, volume, rate, and SpO₂ are set correctly. Reset to default settings if uncertain. Why: Misconfigured alarms often appear as “malfunctions” but are actually settings issues."
    },
    {
      "title": "Check for Sensor Obstructions or Contamination",
      "instructions": "Inspect airway sensors and flow sensors for moisture, secretions, or kinks. Clean or replace disposable sensors per protocol. Why: Contaminated or blocked sensors can trigger false alarms."
    },
    {
      "title": "Perform a Self-Test / Diagnostic",
      "instructions": "Use the ventilator’s built-in self-test function before connecting to a patient. Observe if alarms trigger correctly during test. Why: This helps isolate whether the issue is software/electronics or patient circuit-related."
    },
    {
      "title": "Check for Software Updates / Logs",
      "instructions": "Review device logs for error codes or unusual alarm events. Verify firmware is up-to-date according to manufacturer recommendations. Why: Outdated software or known firmware bugs can affect alarm performance."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator alarms are triggering incorrectly and intermittently.",
      "Cause": "Observed loose O₂ sensor connector and high alarm threshold misconfiguration.",
      "Resolution": "Reconnected sensor, reset alarm limits, and ran self-test; alarms functioned normally."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Battery level checked",
    "Sensor connections inspected and cleaned",
    "Alarm thresholds reviewed",
    "Self-test performed with proper results",
    "Device labeled Out of Service if unresolved"
  ]
},
  {
  "title": "Hamilton C1 Ventilator - Ventilation Errors",
  "description": "Guide to troubleshooting ventilation alarms and errors on the Hamilton C1 ventilator with step-by-step external checks before escalation.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C1",
  "url": "guides/hamilton-c1-ventilation-errors.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Verify Power and Battery Status",
      "instructions": "Ensure the ventilator is connected to a working AC outlet or that the internal battery is charged. Power interruptions can trigger ventilation alarms. Check the display for battery warnings or AC power symbols."
    },
    {
      "title": "Check Breathing Circuit Connections",
      "instructions": "Confirm that inspiratory and expiratory limbs are securely connected to the ventilator and patient interface. Loose tubing can cause pressure and volume errors."
    },
    {
      "title": "Inspect Filters and Humidifiers",
      "instructions": "Verify that bacterial/viral filters are not blocked. Check the humidifier and water traps for obstruction or overfilling. Resistance in these components can trigger pressure alarms."
    },
    {
      "title": "Examine Patient Interface (ET Tube or Mask)",
      "instructions": "Ensure the endotracheal tube or mask is patent. Check for kinks, obstructions, or accidental extubation. Suction if secretions are present, as they can prevent volume delivery."
    },
    {
      "title": "Review Ventilator Settings",
      "instructions": "Verify that tidal volume, inspiratory time, PEEP, and FiO₂ are appropriate for the patient. Confirm mode selection matches patient condition (e.g., volume vs. pressure control). Incorrect settings may cause alarms even when equipment functions properly."
    },
    {
      "title": "Perform Quick Self-Test",
      "instructions": "Navigate the Hamilton C1 system menu and run the built-in system check. Observe for any error codes that identify sensor or circuit problems."
    },
    {
      "title": "Swap Consumables if Needed",
      "instructions": "Replace filters, tubing, or disposable sensors if the problem persists. This helps isolate whether the error is due to consumables rather than the ventilator itself."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator triggers high-pressure alarm and fails to deliver set tidal volume.",
      "Cause": "Checked all external connections, tubing, filters, and patient interface; all appeared functional. Settings verified. Device still alarms during operation.",
      "Resolution": "Ventilator removed from service, labeled Out of Service, and sent to the manufacturer for repair. Patient moved to a backup ventilator."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Battery status and AC power checked",
    "Tubing connections secure",
    "Filters and humidifiers inspected",
    "Ventilator settings reviewed",
    "Patient interface checked",
    "Any abnormal sounds or display messages noted",
    "Final device status before removal"
  ]
},
  {
  "title": "Hamilton C1 Ventilator - Battery / Power Problems",
  "description": "Guide for troubleshooting battery and power issues on the Hamilton C1 ventilator, focusing on external checks before internal repair.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C1",
  "url": "guides/hamilton-c1-battery.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Verify AC Power Source",
      "instructions": "Ensure the ventilator is plugged into a verified working outlet. Check for tripped circuit breakers or switched-off power strips. Why: A faulty power source is the most common cause of power-related issues."
    },
    {
      "title": "Inspect Power Cord and Connector",
      "instructions": "Look for damage, fraying, or bent pins. Re-seat the cord firmly into the ventilator and outlet. Why: Loose or damaged cords can prevent proper charging or startup."
    },
    {
      "title": "Check Battery Installation",
      "instructions": "Remove and reinstall the battery pack, ensuring it clicks fully into place. Inspect the battery contacts for corrosion or debris. Why: Improper seating or dirty contacts can prevent charging."
    },
    {
      "title": "Test Battery Charge Status",
      "instructions": "Use the ventilator’s status screen to check battery level and health. If the battery shows very low charge despite being on AC power, it may have reached end-of-life. Why: Batteries degrade over time and may no longer hold sufficient charge."
    },
    {
      "title": "Attempt Power-On Without Battery",
      "instructions": "With AC power connected, remove the battery and attempt to power on. Why: Confirms if the problem is battery-related versus AC/power circuitry."
    },
    {
      "title": "Swap with a Known Good Battery (if available)",
      "instructions": "Insert a verified working battery to see if the issue persists. Why: Helps isolate the problem to the battery or internal power system."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails to power on, battery error displayed.",
      "Cause": "Battery pack not charging; contacts clean but battery shows 0% charge.",
      "Resolution": "Replaced battery with verified functional unit; ventilator powered on successfully."
    }
  },
  "helpfulDetails": [
    "AC outlet verified and working",
    "Battery health or age",
    "Any unusual sounds or indicator lights during power-on",
    "Status of ventilator during troubleshooting (powered on/off)"
  ]
},
  {
  "title": "Hamilton C1 Ventilator Pre-Use Check Failures",
  "description": "Guide for troubleshooting pre-use checkout failures on the Hamilton C1 ventilator, focusing on external causes before assuming internal failure.",
  "assetType": "Ventilator",
  "manufacturer": "Hamilton",
  "model": "C1",
  "url": "guides/hamilton-c1-pre-use-check.html",
  "dateAdded": "2026-02-27",
  "steps": [
    {
      "title": "Verify Power Source",
      "instructions": "Ensure the ventilator is plugged into a verified, live outlet. Confirm the battery is charged if running on internal battery. Why: Low or unstable power often causes pre-use check failures."
    },
    {
      "title": "Check Main Power Switch & Startup Sequence",
      "instructions": "Power on the ventilator and observe the startup screen. Ensure no buttons are stuck or pressed during startup. Why: Improper startup or button press can interrupt self-tests."
    },
    {
      "title": "Inspect Breathing Circuit & Patient Interfaces",
      "instructions": "Confirm that circuit tubing, filters, humidifiers, and sensors are properly connected. Remove any circuit accessories and try running the pre-use check again. Why: Circuit misconfiguration or disconnected sensors can cause automated checks to fail."
    },
    {
      "title": "Check Oxygen and Air Supply (if applicable)",
      "instructions": "Verify oxygen and air lines are connected to the ventilator and supply pressures are within operational range. Ensure no kinks or obstructions in supply hoses. Why: Ventilator self-test includes gas flow verification."
    },
    {
      "title": "Examine Sensors and Alarms",
      "instructions": "Look for any disconnected, loose, or damaged pressure, flow, or oxygen sensors. Inspect for visible contamination or moisture in sensor ports. Why: Faulty sensors prevent successful pre-use checks."
    },
    {
      "title": "Run Diagnostics / System Test",
      "instructions": "Follow on-screen prompts for self-test or pre-use check. Record any error codes displayed. Why: Codes give insight into which system component is causing failure."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator fails pre-use checkout; displays ‘Self-Test Failed’ message.",
      "Cause": "Observed loose oxygen sensor and partially connected breathing circuit tubing during pre-use check.",
      "Resolution": "Reconnected all sensors and breathing circuit components, retested pre-use check. If still failing, ventilator marked Out of Service for service evaluation."
    }
  },
  "helpfulDetails": [
    "Outlet tested and confirmed live",
    "Battery charge level",
    "Oxygen and air supply pressures",
    "Circuit assembly checked and reconnected",
    "Error codes displayed during self-test",
    "Final device status labeled (Out of Service if unresolved)"
  ]
}
]
