[
{
        "title": "Baxter SIGMA Spectrum Infusion Pump – Occlusion Alarm / Will Not Start Infusion",
        "description": "Structured Clinical Engineering approach for resolving occlusion alarms on a Baxter SIGMA Spectrum infusion pump before assuming internal failure.",
        "assetType": "Infusion Pump",
        "manufacturer": "Baxter",
        "model": "SIGMA Spectrum",
        "url": "guides/baxter-sigma-spectrum-occlusion.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the pump is attached to an active patient, coordinate with clinical staff to transition the patient to another infusion pump before troubleshooting. Do not troubleshoot extensively while the device is actively infusing a critical medication."
          },
          {
            "title": "Inspect the IV Set and Tubing Path",
            "instructions": "Verify the tubing is correctly loaded into the pump channel. Confirm there are no kinks, sharp bends, compression points, or twisted tubing from the pump to the patient. Check that all roller clamps and slide clamps are fully open. Even minor tubing restriction can generate an occlusion alarm."
          },
          {
            "title": "Check the Patient-Side of the Line",
            "instructions": "Inspect the distal tubing and catheter site (visually only — do not manipulate invasive access unless authorized). Look for obvious downstream obstruction such as: IV pole hooks compressing tubing. Arm positioning causing line occlusion. Secondary tubing backflow issues. Occlusion alarms often originate downstream of the pump."
          },
          {
            "title": "Inspect the Cassette and Pump Door",
            "instructions": "Open the pump door and visually inspect the cassette seating. Ensure the disposable set is fully aligned and seated properly in the channel. Close the door firmly and verify it latches completely. An improperly seated cassette can cause false occlusion detection."
          },
          {
            "title": "Confirm Fluid Source and Prime Status",
            "instructions": "Verify the fluid bag contains adequate volume. Ensure the line has been properly primed and contains no large air gaps. Check that the spike is fully inserted and that the vent (if applicable) is correctly positioned."
          },
          {
            "title": "Review Alarm Details on Display",
            "instructions": "Note the exact alarm wording (e.g., “Upstream Occlusion” vs. “Downstream Occlusion” if displayed). Observe whether the alarm triggers immediately upon start or after pressure builds. Documenting the exact alarm behavior is important for CCR documentation."
          },
          {
            "title": "Perform a Controlled Reset",
            "instructions": "Stop the infusion. Remove and reload the tubing. Close the door securely. Restart the infusion and observe pressure behavior. If the alarm clears and infusion resumes normally, monitor briefly to ensure stable operation."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the occlusion alarm continues after completing all external checks, common causes have been ruled out. Remove the pump from clinical service. Clearly label it “Out of Service”. Send for bench evaluation or repair. Persistent occlusion alarms after tubing and cassette verification may indicate internal pressure sensor or mechanism issues. Knowing when to stop bedside troubleshooting is proper Clinical Engineering practice."
          }
        ],
        "documentation": {
            "CCR": {
              "Complaint": "“Pump will not start infusion. Occlusion alarm displayed.”",
              "Cause": "“Tubing inspected and free of kinks. Clamps open. Cassette reseated. Fluid present and line primed. Alarm persists after reload. Suspect internal pressure sensing issue.”",
              "Resolution": "“Removed pump from service, labeled Out of Service, sent to CE shop for evaluation.” or “Bench tested; unable to clear occlusion alarm. Forwarded for repair.”"
            }
        },
        "helpfulDetails": [
          "Tubing inspected and/or replaced",
          "Clamps verified open",
          "Cassette reseated",
          "Fluid bag checked and primed",
          "Alarm type noted (upstream/downstream)",
          "Alarm cleared or persisted",
          "Any abnormal sounds or resistance felt",
          "Final device disposition"
        ]
      },
        {
  "title": "Baxter SIGMA Spectrum Infusion Pump – Keypad / Screen Not Responding",
  "description": "Troubleshooting guide for unresponsive keypad or frozen screen on a Baxter SIGMA Spectrum infusion pump, focusing on external causes before internal hardware failure.",
  "assetType": "Infusion Pump",
  "manufacturer": "Baxter",
  "model": "SIGMA Spectrum",
  "url": "guide/baxter-sigma-spectrum-keypad.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Ensure the Pump Is Not Actively Infusing a Patient",
      "instructions": "Before troubleshooting, confirm the pump is not actively running on a patient. If it is, transition the patient to another pump before proceeding. This protects patient safety and allows proper evaluation."
    },
    {
      "title": "Check for Keypad Lock or Software Lock State",
      "instructions": "Look for any “Keypad Locked” or similar icon on the display. Attempt the standard key combination used to unlock the keypad (per facility policy). Verify the pump is not in a mode restricting input (e.g., alarm screen requiring acknowledgment). A locked keypad can appear as a failure when it is functioning normally."
    },
    {
      "title": "Perform a Soft Reset",
      "instructions": "Place the pump in Standby if possible. Turn the pump OFF using the power button. Wait 10–15 seconds. Power it back ON. If the pump is frozen due to a software glitch, a power cycle often restores function. Observe: Does the screen respond during boot? Do keys respond during startup prompts? If responsiveness returns after reboot, the issue was likely software-related."
    },
    {
      "title": "Verify AC Power and Battery Condition",
      "instructions": "Confirm the pump is connected to a known-good outlet. Check that the AC indicator is illuminated. Remove from AC power briefly and verify it operates on battery. Look for battery error messages or low-voltage behavior. Low or unstable power can cause display lag, freezing, or unresponsive buttons. If the screen flickers or reboots repeatedly, suspect battery failure."
    },
    {
      "title": "Inspect for Physical Obstruction or Contamination",
      "instructions": "Check for dried IV fluids, cleaning residue, or debris around keys. Inspect the keypad membrane for: Cracks. Warping. Sticky or collapsed buttons. Look for fluid intrusion around screen edges. Contamination or membrane damage can physically prevent key actuation. Do not attempt internal cleaning. Surface cleaning only per facility protocol."
    },
    {
      "title": "Evaluate Screen vs. Keypad Function",
      "instructions": "Determine if the issue is: Entire interface unresponsive. Only certain keys not responding. Display frozen but keypad still generating tones. Display blank but pump powered on. If: Audible key tones occur but screen does not change → display or software issue. No tones and no response → keypad or main board issue. Document these observations clearly."
    },
    {
      "title": "Check for Alarm or System Lock State",
      "instructions": "If the pump is in alarm: Attempt to silence/acknowledge the alarm. Verify the screen is not stuck on a critical fault requiring service mode. Some faults prevent further input until addressed."
    },
    {
      "title": "Attempt Operation in Biomed Test Mode (If Authorized)",
      "instructions": "If permitted by facility policy: Enter basic self-test or diagnostics mode. Observe if keypad input registers in test screens. If keypad fails in diagnostic mode, hardware failure is likely. Do not perform internal repairs."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reported keypad and screen were not responding. Unable to change infusion rate.",
      "Cause": "Pump powered on but keypad produced no audible tones. Screen frozen during infusion menu. Issue persisted after power cycle. No external contamination observed. Unit failed keypad response in diagnostic mode.",
      "Resolution": "Removed pump from service. Labeled Out of Service. Sent to vendor for repair due to suspected internal keypad/controller failure."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "AC indicator status",
    "Battery status",
    "Alarm condition at time of failure",
    "Whether keys produced tones",
    "Visible contamination",
    "Final device status"
  ]
},
        {
  "title": "Baxter SIGMA Spectrum Infusion Pump – Battery Won’t Hold Charge / Won’t Power On",
  "description": "Troubleshooting guide for SIGMA Spectrum infusion pumps that will not power on using battery power or fail to hold a charge, focusing on external power verification before internal repair.",
  "assetType": "Infusion Pump",
  "manufacturer": "Baxter",
  "model": "SIGMA Spectrum",
  "url": "guides/baxter-sigma-spectrum-battery.html",
  "dateAdded": "2026-02-23",
  "steps": [
    {
      "title": "Confirm Patient Safety First",
      "instructions": "If the pump is connected to a patient and loses power, immediately transfer the infusion to another functioning pump. Do not troubleshoot while actively infusing unless patient safety is assured. Power issues can directly interrupt therapy. Always secure the patient first."
    },
    {
      "title": "Verify AC Power Source",
      "instructions": "Confirm the outlet is live (test with outlet tester or plug in known-working device). Ensure the hospital-grade power cord is fully seated in both the wall outlet and pump. Inspect the cord for cuts or fraying, loose IEC connection, and bent blades. A loose AC connection is one of the most common causes of “dead” pumps."
    },
    {
      "title": "Check for Charging Indicators",
      "instructions": "With AC connected, confirm the pump powers on. Observe battery charging icon on display. Check for any battery-related alerts or warnings. If the pump powers on with AC but immediately shuts off when unplugged, the internal battery is likely not holding a charge."
    },
    {
      "title": "Perform a Controlled Power Test",
      "instructions": "With the pump powered on and AC connected, allow the pump to charge for at least 30–60 minutes. Disconnect AC power and observe whether the pump remains powered, immediately shuts down, or displays a low battery warning. If it shuts down immediately after charging, suspect battery degradation."
    },
    {
      "title": "Inspect Battery Installation (If Accessible Without Disassembly)",
      "instructions": "If your facility policy allows battery access, remove the pump from service. Inspect battery compartment for proper seating, corrosion, loose connectors, and swelling. Do not open internal electronics beyond standard battery access. If swelling or leakage is observed, remove from service immediately."
    },
    {
      "title": "Check for Excessive Heat or Odor",
      "instructions": "During charging, feel for abnormal heat near battery compartment and note any unusual smell. Excess heat may indicate internal charging circuit issues."
    },
    {
      "title": "Review Service History",
      "instructions": "Check maintenance records for age of battery, previous battery replacements, and repeated battery-related complaints. SIGMA Spectrum batteries have a finite lifespan and commonly require periodic replacement based on usage cycles."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nursing reports pump shuts off when unplugged and will not stay on battery.",
      "Cause": "Pump powered normally on AC. After 45-minute charge, unit shut down immediately when AC removed. Battery failed functional hold test.",
      "Resolution": "Removed from service. Replaced internal battery per facility protocol. Performed operational verification and battery runtime test. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified functional",
    "Power cord swapped and tested",
    "Battery indicator behavior noted",
    "Duration of charge before testing",
    "Any heat or odor observed",
    "Final device status (Returned to Service or Sent for Repair)"
  ]
},
        {
  "title": "Baxter SIGMA Spectrum Infusion Pump – Air-in-Line Alarms",
  "description": "Troubleshooting repeated or unexpected Air-in-Line alarms on a Baxter SIGMA Spectrum infusion pump using an external-first, patient-safety-focused approach.",
  "assetType": "Infusion Pump",
  "manufacturer": "Baxter",
  "model": "SIGMA Spectrum",
  "url": "guides/baxter-sigma-spectrum-air-in-line.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Do not troubleshoot on an actively infusing critical patient without backup support. Transition the patient to another pump if clinically necessary."
    },
    {
      "title": "Confirm the Alarm Message",
      "instructions": "Verify the exact alarm displayed (Air-in-Line vs. Occlusion or Cassette error). Document the specific wording for the work order."
    },
    {
      "title": "Inspect the IV Bag and Tubing for Visible Air",
      "instructions": "Check the drip chamber for proper fill level (typically half full). Inspect the entire length of tubing for visible bubbles or large air pockets. If air is present, re-prime the set per hospital protocol. Why this matters: True air in the line is the most common and correctable cause."
    },
    {
      "title": "Check Cassette Seating and Door Closure",
      "instructions": "Open the pump door. Remove and reseat the cassette. Ensure it is fully seated and the door closes completely without resistance. Listen for the latch to engage. Improper seating can misalign the ultrasonic air sensor."
    },
    {
      "title": "Inspect the Cassette and Tubing Channel",
      "instructions": "Look for warped plastic, cracks, or deformed cassette housing. Ensure tubing is properly aligned in the pumping channel. Confirm the correct set type is being used (approved Baxter set). Off-brand or incorrect sets may trigger nuisance alarms."
    },
    {
      "title": "Clean the Air Sensor Area (External Only)",
      "instructions": "With the cassette removed, inspect the air sensor window inside the pump door. Clean gently with approved wipes if there is dried fluid, residue, or debris. Allow the area to dry fully before reinstalling the set. Dried fluid or residue can interfere with ultrasonic detection."
    },
    {
      "title": "Test with a New IV Set",
      "instructions": "Install a brand-new, properly primed Baxter set. Run a test infusion using saline. Observe if the alarm recurs. If the issue resolves with a new set, the original tubing or cassette was likely defective."
    },
    {
      "title": "Check for Environmental or Mechanical Factors",
      "instructions": "Ensure the pump is not being heavily jostled or mounted loosely. Confirm it is not positioned at extreme angles. Verify there are no kinks creating intermittent negative pressure."
    },
    {
      "title": "Perform a Functional Test (Off Patient)",
      "instructions": "Run the pump at a moderate rate using saline. Observe for repeated alarms. Note whether alarms occur immediately or intermittently."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Nurse reported repeated Air-in-Line alarms during normal infusion. Pump would not continue infusion.",
      "Cause": "Air bubbles found throughout tubing due to incomplete priming. Cassette reseated and tubing replaced.",
      "Resolution": "Re-primed line and replaced IV set. Pump tested with saline infusion; no further alarms observed."
    }
  },
  "helpfulDetails": [
    "Outlet tested (if power cycling performed)",
    "New tubing installed (Yes/No)",
    "Cassette reseated (Yes/No)",
    "Sensor area cleaned (Yes/No)",
    "Alarm frequency (constant/intermittent)",
    "Final device status (Returned to service / Sent for repair)"
  ]
},
        {
  "title": "Baxter SIGMA Spectrum Infusion Pump - Cassette / Set Not Recognized",
  "description": "Guide for troubleshooting when a SIGMA Spectrum infusion pump fails to recognize the cassette or IV set.",
  "assetType": "Infusion Pump",
  "manufacturer": "Baxter",
  "model": "SIGMA Spectrum",
  "url": "guides/baxter-sigma-spectrum-cassete-not-recognized.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Pump Power and Status",
      "instructions": "Ensure the pump is powered on and the display shows the main screen. Confirm battery or AC power is adequate; low power can prevent sensor operation. Why: Some pumps disable sensor detection under low battery or power instability."
    },
    {
      "title": "Check Cassette Orientation and Seating",
      "instructions": "Remove the cassette/set and inspect the orientation. Ensure it is inserted correctly per the labeled guide. Re-seat the cassette firmly until it clicks into place. Why: Misalignment is a common cause of recognition failure."
    },
    {
      "title": "Inspect the Cassette/Sensor Interface",
      "instructions": "Examine the pump’s sensor area and cassette for dirt, fluid, or debris. Wipe gently with a lint-free cloth if necessary. Why: Obstructions can block optical or mechanical sensors from detecting the cassette."
    },
    {
      "title": "Inspect the Cassette/Set Itself",
      "instructions": "Check for visible damage, cracks, or expired tubing. Ensure the cassette is compatible with the SIGMA Spectrum pump model. Why: Non-compatible or damaged cassettes will not be recognized."
    },
    {
      "title": "Power Cycle the Pump",
      "instructions": "Turn off the pump completely, wait 10–15 seconds, and power it back on. Reinsert the cassette and observe if it is recognized. Why: Temporary sensor or software errors can clear with a power cycle."
    },
    {
      "title": "Try a Known Good Cassette/Set",
      "instructions": "If available, insert a different, verified functional cassette to see if the pump recognizes it. Why: Confirms whether the issue is with the pump or the cassette itself."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump does not recognize cassette/IV set.",
      "Cause": "Sensor area clean, cassette correctly oriented; verified known-good cassette recognized—original set may be damaged or incompatible.",
      "Resolution": "Original cassette removed from service; patient switched to verified pump; pump labeled Out of Service and sent for repair."
    }
  },
  "helpfulDetails": [
    "AC outlet verified",
    "Battery level adequate",
    "Cassette orientation checked",
    "Sensor area clean",
    "Cassette compatibility confirmed",
    "Alarm messages displayed"
  ]
}
]
