[
{
  "title": "Enthermics DC Series – Unit Not Reaching or Maintaining Set Temperature",
  "description": "Troubleshooting guide for Enthermics DC Series blanket warmers that are not reaching or maintaining the selected temperature.",
  "assetType": "Blanket Warmer",
  "manufacturer": "Enthermics",
  "model": "DC Series",
  "url": "guides/enthermics-dc-series-not-reaching-temperature.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Never troubleshoot a blanket warmer that is actively being used for patient care. If warming is required for an active case, transfer linens to another approved warmer. Ensure patient care is uninterrupted before removing the unit from service."
    },
    {
      "title": "Verify Power Source",
      "instructions": "Confirm the unit is plugged directly into a known-good wall outlet. Avoid power strips or extension cords. Test the outlet with a receptacle tester if needed. Why this matters: Low or unstable voltage can prevent heating elements from operating at full capacity."
    },
    {
      "title": "Confirm Set Temperature and Mode",
      "instructions": "Verify the temperature setpoint matches department policy (commonly 120–160°F depending on application). Confirm the unit is not in a standby or low-temp mode. Check for error codes or alarm indicators on the display. Why this matters: Incorrect settings are a common cause of perceived heating issues."
    },
    {
      "title": "Check Door Seal and Latch",
      "instructions": "Inspect the door gasket for cracks, flattening, or gaps. Ensure the door closes fully and latches securely. Check for blankets caught in the door seal. Why this matters: Heat loss from a poor seal prevents temperature stability."
    },
    {
      "title": "Evaluate Loading Practices",
      "instructions": "Confirm the warmer is not overloaded. Blankets should be loosely stacked to allow airflow. Remove excessive blankets and allow time to recover temperature. Why this matters: Restricted airflow prevents even heat distribution."
    },
    {
      "title": "Check Internal Airflow",
      "instructions": "Listen for the internal circulation fan. Ensure interior vents are not blocked by linens. Inspect for debris inside the chamber. Why this matters: Proper convection is required to maintain uniform temperature."
    },
    {
      "title": "Allow Adequate Warm-Up Time",
      "instructions": "After being loaded or powered on, allow sufficient time (often 1–2 hours depending on load size). Use an independent calibrated thermometer to verify actual chamber temperature. Why this matters: Digital displays may not reflect stabilized temperature immediately after loading."
    },
    {
      "title": "Inspect for Error Codes or Over-Temp Events",
      "instructions": "Document any error messages. Reset the unit per facility protocol if safe to do so. Observe if temperature climbs but then drops unexpectedly. Why this matters: Repeated cycling may indicate a failing temperature sensor or control relay."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit not reaching set temperature of 150°F. Staff reports blankets feel lukewarm after several hours.",
      "Cause": "Door gasket intact. Unit powered properly. Chamber overloaded with tightly packed blankets restricting airflow. Internal temp verified at 118°F.",
      "Resolution": "Removed excess blankets to allow airflow. Verified fan operation. Allowed unit to stabilize for 90 minutes. Temperature reached and maintained 150°F. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested and voltage verified",
    "Door seal condition",
    "Loading condition",
    "Independent temperature verification",
    "Fan operation observed",
    "Any displayed error codes",
    "Final device status (Returned to Service or Sent for Repair)"
  ]
},
  {
  "title": "Enthermics DC Series Blanket Warmer – Erratic or False “High Temp” / Overheat Alarms",
  "description": "Troubleshooting guide for intermittent or persistent high temperature alarms on the Enthermics DC Series blanket warmer, focusing on airflow, loading, environment, and power before internal failure.",
  "assetType": "Blanket Warmer",
  "manufacturer": "Enthermics",
  "model": "DC Series",
  "url": "guides/enthermics-dc-series-overheat.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure the Unit Is Not in Active Patient Use",
      "instructions": "Confirm blankets have been removed from patient care. Move the patient to an alternate warmer if needed. Silence alarms only after patient impact has been addressed. Patient safety always comes first."
    },
    {
      "title": "Verify Set Temperature vs. Displayed Temperature",
      "instructions": "Compare the programmed setpoint with the actual displayed chamber temperature. Determine whether the chamber temperature is truly elevated, or the alarm is occurring without a matching temperature rise. This helps determine whether you are dealing with actual overheating or possible sensor misreading."
    },
    {
      "title": "Check for Overloading of Blankets",
      "instructions": "Open the door and inspect load quantity. Remove excess blankets if tightly packed. Ensure blankets are not pressed directly against rear or top airflow vents. Overpacking can block airflow, cause localized heat buildup, and trigger high-limit alarms even if overall chamber temperature seems normal."
    },
    {
      "title": "Inspect Internal Airflow Path",
      "instructions": "With the unit powered off: Inspect rear plenum area (if visible without disassembly). Check for obstructed air channels, collapsed blankets blocking return air, and lint or debris accumulation near vents. Restricted airflow is one of the most common causes of false high-temp conditions."
    },
    {
      "title": "Verify Door Seal and Closure",
      "instructions": "Inspect gasket for damage or deformation. Confirm door closes completely and latches securely. Look for warped hinges or misalignment. A poor seal can disrupt airflow patterns, cause temperature instability, and lead to erratic alarm behavior."
    },
    {
      "title": "Check Ambient Environment",
      "instructions": "Confirm unit is not placed directly next to HVAC supply vents, heat sources, or sunlight exposure. Ensure required rear and side clearance is maintained. Environmental heat or poor ventilation can influence internal temperature readings."
    },
    {
      "title": "Inspect Power Source",
      "instructions": "Verify the outlet is stable and properly grounded. Confirm no extension cords or power strips are in use. If possible, move the unit to a known-good outlet temporarily. Voltage fluctuations can cause control instability or erratic alarm behavior."
    },
    {
      "title": "Observe Alarm Behavior Pattern",
      "instructions": "Document whether the alarm occurs during heat-up only, occurs randomly, clears after power cycle, or if there is a strong odor or abnormal heat detected. If chamber feels excessively hot or smells overheated, discontinue use immediately."
    },
    {
      "title": "Perform Power Reset",
      "instructions": "Turn unit off. Unplug from wall for 60 seconds. Reconnect and power on. Allow full heat cycle while monitoring. If alarm recurs under controlled conditions with proper loading, external causes are likely ruled out."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit alarming ‘High Temp’ intermittently during use. Staff reports blankets do not feel excessively hot.",
      "Cause": "Airflow restriction noted due to overpacked blankets blocking rear vent channels. Chamber temperature spiking during heat cycle.",
      "Resolution": "Removed excess blankets, cleared airflow path, verified normal heating cycle. Unit tested for 30 minutes with no further alarms. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested",
    "Power cord condition verified",
    "Door seal inspected",
    "Load quantity adjusted",
    "Ambient room conditions noted",
    "Odor or abnormal heat observed",
    "Final operational status"
  ]
},
  {
  "title": "Enthermics DC Series Blanket Warmer – Display / Control Panel Unresponsive or Intermittent",
  "description": "Troubleshooting guide for Enthermics DC Series blanket warmers with unresponsive, frozen, or intermittent display and control panel issues.",
  "assetType": "Blanket Warmer",
  "manufacturer": "Enthermics",
  "model": "DC Series",
  "url": "guides/enthermics-dc-series-display-control-panel.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Do not troubleshoot a unit actively storing blankets needed for patient care. Confirm alternate warming equipment is available before removing this unit from service. If patient care may be affected, coordinate with clinical staff prior to powering down the unit."
    },
    {
      "title": "Confirm the Unit Has Power",
      "instructions": "Verify the power cord is fully seated in both the wall outlet and the rear of the warmer. Inspect the power cord for damage (cuts, frays, bent prongs). Test the wall outlet with a known-good device or outlet tester. If connected to a power strip or extension cord, move the unit directly to a wall outlet."
    },
    {
      "title": "Check the Facility Circuit Breaker",
      "instructions": "Confirm the branch circuit breaker has not tripped. If recently reset, monitor for repeat trips (which may indicate internal fault). If the breaker continues to trip, stop troubleshooting and remove from service."
    },
    {
      "title": "Inspect the Main Power Switch",
      "instructions": "Verify the main power switch is fully engaged. Cycle the power switch OFF for 30–60 seconds, then turn back ON. Observe whether the display briefly initializes or remains blank."
    },
    {
      "title": "Look for Control Lock or Standby Mode",
      "instructions": "Check whether the display shows dim backlighting. Confirm whether buttons illuminate but do not respond. Look for a lock icon if present. Attempt to unlock per normal user-level procedure."
    },
    {
      "title": "Inspect for Moisture or Cleaning Residue",
      "instructions": "Examine the control panel surface for moisture. Ask staff whether the unit was recently cleaned. Look for fluid intrusion around button seams. Allow adequate drying time before retesting."
    },
    {
      "title": "Evaluate Ambient Temperature Conditions",
      "instructions": "Determine if the unit was moved from a cold storage area. Determine if it was exposed to high humidity. Determine if it was recently delivered from a loading dock. Allow the unit to reach room temperature before further evaluation."
    },
    {
      "title": "Observe Display Behavior",
      "instructions": "Document whether the display is completely blank. Document whether it flickers. Document whether it partially illuminates. Document whether buttons beep but do not respond. Listen for unusual sounds (relay clicking without display response)."
    },
    {
      "title": "Inspect for Overheat or Thermal Events",
      "instructions": "Check for unusual heat at the control area. Smell for burnt odor. Verify internal chamber temperature is not excessively high."
    },
    {
      "title": "Perform a Controlled Power Reset",
      "instructions": "Turn unit OFF. Unplug from AC power. Wait 2–3 minutes. Reconnect and power ON."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit display blank and control panel not responding. Nursing staff unable to adjust temperature.",
      "Cause": "Verified outlet functional. Power cord intact. After power reset, display remained blank. Determined likely internal control board failure.",
      "Resolution": "Removed unit from service. Labeled Out of Service. Sent to shop for further diagnostic evaluation and parts replacement."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes/No",
    "Power cord condition",
    "Breaker status",
    "Display behavior (blank/flicker/partial)",
    "Button response (beep/no beep)",
    "Signs of moisture",
    "Odor or overheating",
    "Final device status"
  ]
}
]
