[
{
  "title": "Stryker Neptune Surgical Fluid Management System – “Canister Full” or Level Sensor Errors",
  "description": "Troubleshooting guide for Stryker Neptune units displaying false “Canister Full” or level sensor errors, focusing on external causes before internal escalation.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-canister-full.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm the unit is not actively connected to a patient before beginning troubleshooting. If in use, transition suction to wall vacuum or a backup device before continuing."
    },
    {
      "title": "Confirm the Message and Current Setup",
      "instructions": "Verify the exact alarm message on the display. Determine which canister position is generating the error."
    },
    {
      "title": "Inspect the Canister Fluid Level",
      "instructions": "Visually confirm the fluid level. If full or near full, properly dispose of contents per facility policy and replace with an empty canister."
    },
    {
      "title": "Remove and Re-seat the Canister",
      "instructions": "Remove the affected canister. Inspect the bottom and rear connection points. Reinstall firmly, ensuring it is fully seated and locked in place."
    },
    {
      "title": "Inspect the Float Mechanism",
      "instructions": "Check the internal float assembly inside the canister. Ensure the float moves freely and is not stuck in the “up” position. Look for coagulated debris or thick fluids restricting movement."
    },
    {
      "title": "Inspect Sensor Contact Area",
      "instructions": "Examine the sensor interface area on the unit where the canister docks. Look for dried fluid, residue, or corrosion. Clean the external sensor contact area with approved disinfectant wipes (do not saturate)."
    },
    {
      "title": "Swap Canisters Between Positions",
      "instructions": "Move the suspected canister to another port (if applicable). Install a known-good canister in the original port."
    },
    {
      "title": "Power Cycle the Unit",
      "instructions": "Turn the Neptune off. Wait 30 seconds. Restart and allow the system to complete self-test."
    },
    {
      "title": "Check for Signs of Fluid Intrusion",
      "instructions": "Look for moisture, staining, or unusual odor near the canister ports. Check for alarm recurrence immediately after startup. If fluid intrusion into the internal sensor housing is suspected, do not continue operating the unit."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Unit displaying ‘Canister Full’ alarm immediately after new empty canister installed.",
      "Cause": "Level sensor falsely detecting full condition in port #2. Float mechanism moved freely. Error remained with port after canister swap.",
      "Resolution": "Removed unit from service. Labeled Out of Service. Sent to shop for sensor evaluation and repair. Backup unit provided to OR."
    }
  },
  "helpfulDetails": [
    "Which port was affected",
    "Whether canisters were swapped",
    "Condition of float mechanism",
    "Evidence of fluid residue at sensor interface",
    "Whether alarm cleared after power cycle",
    "Final device status (Returned to service or Sent for repair)"
  ]
},
  {
  "title": "Stryker Neptune Surgical Fluid Management System – Low or No Suction",
  "description": "Troubleshooting guide for low or no suction on the Stryker Neptune system, focusing on external setup, tubing, canister configuration, and safety-first escalation.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-low-or-no-suction.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure Patient Safety First",
      "instructions": "Confirm suction is no longer actively required on a patient. Move suction to a backup wall suction source if needed. Do not troubleshoot while actively connected to a surgical field. Patient safety always comes first."
    },
    {
      "title": "Verify the Unit Is Powered On and Fully Booted",
      "instructions": "Confirm the unit is powered on. Check for any alarm messages on the display. Ensure the unit has completed startup and is not in standby mode. If the system is not fully operational, suction will not engage."
    },
    {
      "title": "Confirm Suction Mode and Vacuum Level Settings",
      "instructions": "Verify the suction channel is selected and activated. Check that vacuum level is set appropriately (not set to minimum or zero). Ensure the foot pedal (if used) is connected and functioning. Low settings can appear as “no suction” to clinical staff."
    },
    {
      "title": "Inspect All Tubing Connections",
      "instructions": "Trace tubing from the surgical field to the Neptune inlet. Ensure all connections are fully seated and not loose. Check for cracked tubing, disconnected fittings, or split lines. Confirm the correct port is being used. Even a small air leak can significantly reduce vacuum performance."
    },
    {
      "title": "Check for Kinks or Occlusions",
      "instructions": "Inspect suction tubing for: Kinks, Clots, Collapsed sections. Replace tubing if blockage is suspected. Mechanical obstruction is one of the most common causes of low suction."
    },
    {
      "title": "Inspect the Canister Setup",
      "instructions": "Ensure the collection canister is: Properly installed, Locked into position, Not overfilled. Check that the lid and seals are intact. Confirm float shutoff has not engaged due to fluid level. An improperly seated canister or engaged float valve will stop suction."
    },
    {
      "title": "Verify Filter and Hydrophobic Barrier Condition",
      "instructions": "Inspect for wet or saturated filters. Replace filters if moisture has breached the hydrophobic barrier. Wet filters can completely block vacuum flow."
    },
    {
      "title": "Listen for Pump Activity",
      "instructions": "When suction is activated, listen for: Normal pump sound, Unusual grinding, No motor sound at all. If the motor does not engage, internal vacuum pump failure may be present."
    },
    {
      "title": "Check for Alarm Indicators",
      "instructions": "Common alarms that affect suction: Full canister, Filter fault, Vacuum system error, Door or compartment not secured. Resolve any indicated alarm conditions and retest."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Staff reported Neptune unit had no suction during an OR case. Unit powered on but would not evacuate fluid.",
      "Cause": "Collection canister float shutoff engaged due to overfilled canister. Float valve blocking vacuum pathway.",
      "Resolution": "Replaced full canister, verified proper seating and seal. Tested suction at multiple vacuum settings. Unit functioning normally. Returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested (if power concern)",
    "Alarm messages observed",
    "Vacuum level setting during testing",
    "Tubing replaced or swapped",
    "Filter condition",
    "Canister condition",
    "Final suction performance",
    "Final device status (Returned to Service or Sent to Repair)"
  ]
},
  {
  "title": "Stryker Neptune Surgical Fluid Management System – Touchscreen / Control Panel Freezing",
  "description": "Troubleshooting guide for a Stryker Neptune Surgical Fluid Management System experiencing touchscreen or control panel freezing, focusing on external causes before internal failure.",
  "assetType": "Surgical Fluid Management System",
  "manufacturer": "Stryker",
  "model": "Neptune",
  "url": "guides/stryker-neptune-touchscreen.html",
  "dateAdded": "2026-02-25",
  "steps": [
    {
      "title": "Ensure the Device Is Not Actively Connected to a Patient",
      "instructions": "Before troubleshooting, confirm the unit is not in active use. If connected, transfer suction to another device first. Freezing during a case can create safety risk if suction control cannot be adjusted."
    },
    {
      "title": "Perform a Controlled Power Cycle",
      "instructions": "Many touchscreen freezes are software-related. Turn the unit off using the normal shutdown procedure. Wait at least 60 seconds. Disconnect from AC power. Reconnect power and restart the unit. A full power cycle clears temporary software faults and resets the control interface. If the touchscreen functions normally after restart, monitor for recurrence."
    },
    {
      "title": "Verify Stable Power Source",
      "instructions": "Check if the unit is plugged directly into a wall outlet. Avoid extension cords or power strips. Test the outlet with an outlet tester or known working device. Inspect the power cord for damage. Unstable or fluctuating voltage can cause control board instability and display freezing."
    },
    {
      "title": "Inspect the Touchscreen Surface",
      "instructions": "Check for fluid residue, cleaning chemical buildup, cracks in the screen, and physical pressure points. Wipe the screen with approved cleaning solution and lint-free cloth. Excess fluid infiltration around the bezel can interfere with capacitive or resistive touch response."
    },
    {
      "title": "Observe System Behavior During Freeze",
      "instructions": "When freezing occurs, determine if the display remains lit, if physical buttons respond, if suction motors are still functioning, and if alarm tones are active. If suction continues but screen is frozen, the issue is likely interface-related rather than full system failure. If the entire unit becomes unresponsive, suspect deeper power or control board issue."
    },
    {
      "title": "Check for Environmental Factors",
      "instructions": "Evaluate excessive OR humidity, fluid spills near the control panel, heat exposure, and whether terminal cleaning was recently completed. Moisture intrusion is a common cause of intermittent panel freezing."
    },
    {
      "title": "Check for Recurring Pattern",
      "instructions": "Determine if freezing occurs only during high suction load, only during startup, or after prolonged use. Document pattern behavior. Intermittent freezing that worsens over time often indicates control board degradation."
    },
    {
      "title": "Inspect for Error Messages After Reboot",
      "instructions": "After restarting, look for boot-up warnings, system faults, and software errors. Record any displayed codes before clearing them."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "“Touchscreen froze during procedure. Could not adjust suction level.”",
      "Cause": "“Unit powered on but touchscreen unresponsive. Power cycle temporarily restored function. Issue recurred after 20 minutes of operation.”",
      "Resolution": "“Removed unit from service. Verified stable power source. Labeled Out of Service and sent for further evaluation of control board/display assembly.”"
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Power cord condition",
    "Whether suction motor remained functional",
    "Any error codes observed",
    "Evidence of fluid intrusion",
    "Final device status"
  ]
}
]
