[
{
  "title": "Masimo Rad-97 Pulse Oximeter - Sensor / SpO₂ Reading Errors",
  "description": "Guide for troubleshooting inaccurate SpO₂ readings and sensor errors on the Masimo Rad-97 pulse oximeter, emphasizing external causes first.",
  "assetType": "Pulse Oximeter",
  "manufacturer": "Masimo",
  "model": "Rad-97",
  "url": "guides/masimo-rad-97-sensor-errors.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Check Sensor Connection",
      "instructions": "Verify the sensor is fully seated in the oximeter port. Inspect the cable for visible damage, kinks, or loose connectors. Why: Loose or damaged connections can produce intermittent or false readings."
    },
    {
      "title": "Inspect Sensor Condition",
      "instructions": "Look for wear, frayed wires, or discoloration on reusable sensors. Ensure disposable sensors are not expired. Why: Damaged or expired sensors often fail to read accurately."
    },
    {
      "title": "Verify Proper Sensor Placement on Patient",
      "instructions": "Ensure the sensor is applied to a suitable site (finger, toe, or earlobe). Remove nail polish, artificial nails, or excessive moisture if present. Why: Poor placement or optical interference can cause erroneous SpO₂ values."
    },
    {
      "title": "Check for Patient Movement or Perfusion Issues",
      "instructions": "Ask the patient to remain still; check for cold extremities or poor perfusion. Use a different site if needed. Why: Motion artifacts or low perfusion can trigger sensor errors or unstable readings."
    },
    {
      "title": "Power Cycle the Device",
      "instructions": "Turn the Rad-97 off, wait 10 seconds, then power it back on. Why: Sometimes software resets can clear temporary sensor communication issues."
    },
    {
      "title": "Swap Cables or Sensors if Available",
      "instructions": "If another compatible sensor or cable is available, connect it and test. Why: Confirms whether the issue is with the sensor or the oximeter itself."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Rad-97 showing fluctuating SpO₂ readings and sensor error alarms.",
      "Cause": "Sensor improperly seated; cable checked and no visible damage; readings unstable despite repositioning.",
      "Resolution": "Sensor reseated; attempted alternative site and sensor; issue persists—device removed from service and sent for repair."
    }
  },
  "helpfulDetails": [
    "Sensor model and serial number",
    "Cable condition and serial number",
    "Patient site and perfusion quality",
    "Any unusual readings or alarms displayed",
    "Device final status and labeling"
  ]
},
  {
  "title": "Masimo Rad-97 Touchscreen / Control Panel Problems",
  "description": "Guide for troubleshooting touchscreen or control panel issues on the Masimo Rad-97 pulse oximeter.",
  "assetType": "Pulse Oximeter",
  "manufacturer": "Masimo",
  "model": "Rad-97",
  "url": "guides/masimo-rad-97-touchscreen.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Ensure Device is Powered Correctly",
      "instructions": "Confirm the device battery is charged or the power adapter is connected securely. A low battery or intermittent power can cause touchscreen malfunction."
    },
    {
      "title": "Inspect Screen for Debris or Damage",
      "instructions": "Clean the touchscreen with a soft, lint-free cloth and approved disinfectant. Check for cracks, scratches, or residue that might interfere with touch sensitivity."
    },
    {
      "title": "Check User Gloves / Protective Covers",
      "instructions": "Some medical gloves or screen protectors reduce touchscreen responsiveness. Remove any covers and test touch response."
    },
    {
      "title": "Restart the Device",
      "instructions": "Perform a proper power cycle: turn off, wait 10–15 seconds, and turn back on. This can clear temporary software glitches affecting the touchscreen."
    },
    {
      "title": "Verify Software / Settings",
      "instructions": "Check that the device is running the latest approved firmware version. Reset display settings to default if the touchscreen remains unresponsive."
    },
    {
      "title": "Inspect External Connections",
      "instructions": "Ensure any wired probes or modules are securely attached. Loose connections can sometimes interfere with system responsiveness."
    },
    {
      "title": "Test Basic Input Functions",
      "instructions": "Press physical buttons (if available) to confirm that non-touch input works. If physical buttons work but touch does not, the issue is likely localized to the touchscreen."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reported the Rad-97 touchscreen was unresponsive during patient monitoring.",
      "Cause": "Observed that the touchscreen did not respond to touch inputs; device powered normally and cables were secure; screen was clean and undamaged.",
      "Resolution": "Device removed from service, labeled Out of Service, and sent for repair. Patient monitored on alternate device during troubleshooting."
    }
  },
  "helpfulDetails": [
    "Battery level at time of failure",
    "Firmware version",
    "Any recent software updates",
    "Response of physical buttons if present",
    "Presence of gloves or protective screen covers"
  ]
},
  {
  "title": "Masimo Rad-97 Pulse Oximeter Power / Battery Issues",
  "description": "Guide for troubleshooting power and battery issues on the Masimo Rad-97 pulse oximeter, focusing on external causes first.",
  "assetType": "Pulse Oximeter",
  "manufacturer": "Masimo",
  "model": "Rad-97",
  "url": "guides/masimo-rad-97-power-issue.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Verify Battery Charge and Connections",
      "instructions": "Ensure the device is connected to the approved charger. Check that the charging contacts on both the battery and device are clean, free of debris, and aligned. Observe the charging indicator LED: solid or blinking light per Masimo specifications indicates charging status."
    },
    {
      "title": "Test With a Known Good Power Source",
      "instructions": "Plug the charger into a verified working outlet. Avoid power strips with switches or surge protectors that might interrupt current."
    },
    {
      "title": "Remove and Reinstall the Battery",
      "instructions": "Power down the device if possible. Remove the battery, inspect for corrosion, swelling, or damage. Reinsert securely and attempt to power on."
    },
    {
      "title": "Try a Known Good Battery",
      "instructions": "If available, replace the battery with a fully charged, verified working battery. Power on the device."
    },
    {
      "title": "Check for Firmware or Device Alerts",
      "instructions": "Some Rad-97 units may display battery or power warnings in the interface. Note any codes or messages for documentation and potential escalation."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Rad-97 would not power on; patient monitoring interrupted.",
      "Cause": "Battery failed to hold charge; charger and power source verified.",
      "Resolution": "Device removed from service, labeled Out of Service, sent to Biomedical Engineering for battery replacement and functional testing."
    }
  },
  "helpfulDetails": [
    "Battery type and age",
    "Charger model used",
    "LED charging indicator behavior",
    "Any unusual noises, smells, or heat from battery",
    "Device behavior when using a replacement battery"
  ]
}
]
