[
{
        "title": "Baxter SIGMA Spectrum Infusion Pump – Occlusion Alarm / Will Not Start Infusion",
        "description": "Structured Clinical Engineering approach for resolving occlusion alarms on a Baxter SIGMA Spectrum infusion pump before assuming internal failure.",
        "assetType": "Infusion Pump",
        "manufacturer": "Baxter",
        "model": "SIGMA Spectrum",
        "url": "guides/baxter-sigma-spectrum-occlusion.html",
        "dateAdded": "2026-02-17",
        "steps": [
          {
            "title": "Ensure Patient Safety First",
            "instructions": "If the pump is attached to an active patient, coordinate with clinical staff to transition the patient to another infusion pump before troubleshooting. Do not troubleshoot extensively while the device is actively infusing a critical medication."
          },
          {
            "title": "Inspect the IV Set and Tubing Path",
            "instructions": "Verify the tubing is correctly loaded into the pump channel. Confirm there are no kinks, sharp bends, compression points, or twisted tubing from the pump to the patient. Check that all roller clamps and slide clamps are fully open. Even minor tubing restriction can generate an occlusion alarm."
          },
          {
            "title": "Check the Patient-Side of the Line",
            "instructions": "Inspect the distal tubing and catheter site (visually only — do not manipulate invasive access unless authorized). Look for obvious downstream obstruction such as: IV pole hooks compressing tubing. Arm positioning causing line occlusion. Secondary tubing backflow issues. Occlusion alarms often originate downstream of the pump."
          },
          {
            "title": "Inspect the Cassette and Pump Door",
            "instructions": "Open the pump door and visually inspect the cassette seating. Ensure the disposable set is fully aligned and seated properly in the channel. Close the door firmly and verify it latches completely. An improperly seated cassette can cause false occlusion detection."
          },
          {
            "title": "Confirm Fluid Source and Prime Status",
            "instructions": "Verify the fluid bag contains adequate volume. Ensure the line has been properly primed and contains no large air gaps. Check that the spike is fully inserted and that the vent (if applicable) is correctly positioned."
          },
          {
            "title": "Review Alarm Details on Display",
            "instructions": "Note the exact alarm wording (e.g., “Upstream Occlusion” vs. “Downstream Occlusion” if displayed). Observe whether the alarm triggers immediately upon start or after pressure builds. Documenting the exact alarm behavior is important for CCR documentation."
          },
          {
            "title": "Perform a Controlled Reset",
            "instructions": "Stop the infusion. Remove and reload the tubing. Close the door securely. Restart the infusion and observe pressure behavior. If the alarm clears and infusion resumes normally, monitor briefly to ensure stable operation."
          },
          {
            "title": "If the Problem Persists",
            "instructions": "If the occlusion alarm continues after completing all external checks, common causes have been ruled out. Remove the pump from clinical service. Clearly label it “Out of Service”. Send for bench evaluation or repair. Persistent occlusion alarms after tubing and cassette verification may indicate internal pressure sensor or mechanism issues. Knowing when to stop bedside troubleshooting is proper Clinical Engineering practice."
          }
        ],
        "documentation": {
            "CCR": {
              "Complaint": "“Pump will not start infusion. Occlusion alarm displayed.”",
              "Cause": "“Tubing inspected and free of kinks. Clamps open. Cassette reseated. Fluid present and line primed. Alarm persists after reload. Suspect internal pressure sensing issue.”",
              "Resolution": "“Removed pump from service, labeled Out of Service, sent to CE shop for evaluation.” or “Bench tested; unable to clear occlusion alarm. Forwarded for repair.”"
            }
        },
        "helpfulDetails": [
          "Tubing inspected and/or replaced",
          "Clamps verified open",
          "Cassette reseated",
          "Fluid bag checked and primed",
          "Alarm type noted (upstream/downstream)",
          "Alarm cleared or persisted",
          "Any abnormal sounds or resistance felt",
          "Final device disposition"
        ]
      },{
  "title": "Baxter SIGMA Spectrum Infusion Pump - Cassette / Set Not Recognized",
  "description": "Guide for troubleshooting when a SIGMA Spectrum infusion pump fails to recognize the cassette or IV set.",
  "assetType": "Infusion Pump",
  "manufacturer": "Baxter",
  "model": "SIGMA Spectrum",
  "url": "guides/baxter-sigma-spectrum-cassete-not-recognized.html",
  "dateAdded": "2026-02-22",
  "steps": [
    {
      "title": "Verify Pump Power and Status",
      "instructions": "Ensure the pump is powered on and the display shows the main screen. Confirm battery or AC power is adequate; low power can prevent sensor operation. Why: Some pumps disable sensor detection under low battery or power instability."
    },
    {
      "title": "Check Cassette Orientation and Seating",
      "instructions": "Remove the cassette/set and inspect the orientation. Ensure it is inserted correctly per the labeled guide. Re-seat the cassette firmly until it clicks into place. Why: Misalignment is a common cause of recognition failure."
    },
    {
      "title": "Inspect the Cassette/Sensor Interface",
      "instructions": "Examine the pump’s sensor area and cassette for dirt, fluid, or debris. Wipe gently with a lint-free cloth if necessary. Why: Obstructions can block optical or mechanical sensors from detecting the cassette."
    },
    {
      "title": "Inspect the Cassette/Set Itself",
      "instructions": "Check for visible damage, cracks, or expired tubing. Ensure the cassette is compatible with the SIGMA Spectrum pump model. Why: Non-compatible or damaged cassettes will not be recognized."
    },
    {
      "title": "Power Cycle the Pump",
      "instructions": "Turn off the pump completely, wait 10–15 seconds, and power it back on. Reinsert the cassette and observe if it is recognized. Why: Temporary sensor or software errors can clear with a power cycle."
    },
    {
      "title": "Try a Known Good Cassette/Set",
      "instructions": "If available, insert a different, verified functional cassette to see if the pump recognizes it. Why: Confirms whether the issue is with the pump or the cassette itself."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pump does not recognize cassette/IV set.",
      "Cause": "Sensor area clean, cassette correctly oriented; verified known-good cassette recognized—original set may be damaged or incompatible.",
      "Resolution": "Original cassette removed from service; patient switched to verified pump; pump labeled Out of Service and sent for repair."
    }
  },
  "helpfulDetails": [
    "AC outlet verified",
    "Battery level adequate",
    "Cassette orientation checked",
    "Sensor area clean",
    "Cassette compatibility confirmed",
    "Alarm messages displayed"
  ]
}
]
