[
{
  "title": "AirLife FlowMate Oxygen Flowmeter - Gauge / Meter Malfunction",
  "description": "Troubleshoot inaccurate, erratic, or unresponsive AirLife FlowMate oxygen flowmeter readings by checking external factors before repair.",
  "assetType": "Oxygen Flowmeter",
  "manufacturer": "AirLife",
  "model": "FlowMate",
  "url": "guides/airlife-flowmate-gauge.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Verify the Gas Source",
      "instructions": "Ensure the oxygen cylinder or pipeline supply is turned on. Confirm that the supply pressure is within the recommended range for the FlowMate (typically 50–60 psi)."
    },
    {
      "title": "Inspect the Connection",
      "instructions": "Check that the flowmeter is fully seated on the regulator or manifold. Examine inlet threads for damage or debris."
    },
    {
      "title": "Check for Obstructions",
      "instructions": "Remove tubing from the outlet and visually inspect the flow path. Look for kinks, moisture, or particulate matter in the tubing."
    },
    {
      "title": "Test with Another Flowmeter",
      "instructions": "If available, attach a known-good flowmeter to the same source. Compare readings at identical settings."
    },
    {
      "title": "Environmental Factors",
      "instructions": "Ensure the device is not exposed to extreme vibration, tilt, or temperature fluctuations. The FlowMate should remain upright on a stable surface."
    },
    {
      "title": "Check for Visible Damage",
      "instructions": "Inspect the gauge face, needle, and housing for cracks, dents, or internal moisture."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Flowmeter needle jumps and reads inaccurately at all settings.",
      "Cause": "Upon inspection, supply pressure and connections were normal; tubing clear; device tested on stable surface; meter still inaccurate.",
      "Resolution": "Flowmeter removed from service, labeled Out of Service, sent for repair."
    }
  },
  "helpfulDetails": [
    "Supply source and pressure checked",
    "Tubing and connections inspected",
    "Device tested upright and stable",
    "Comparison flowmeter reading (if available)",
    "Any visible damage or moisture inside gauge"
  ]
},
  {
  "title": "AirLife FlowMate Oxygen Flowmeter - Leaks / Hissing Sounds",
  "description": "Guide to troubleshoot hissing sounds and leaks in the AirLife FlowMate oxygen flowmeter, focusing on external checks before internal repair.",
  "assetType": "Oxygen Flowmeter",
  "manufacturer": "AirLife",
  "model": "FlowMate",
  "url": "guides/airlife-flowmate-leaks.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Ensure Device is Off / Safe to Inspect",
      "instructions": "Confirm the oxygen source is off and the patient has been moved to another device if in use. Patient safety is priority; never troubleshoot a flowmeter under active patient use."
    },
    {
      "title": "Inspect Connections and Fittings",
      "instructions": "Check inlet and outlet connections for tightness. Inspect for any misaligned or cross-threaded fittings. Loose connections are a common cause of hissing leaks."
    },
    {
      "title": "Examine Tubing and Attachments",
      "instructions": "Look for cracks, splits, or worn areas in oxygen tubing. Replace any tubing showing wear. Ensure all tubing is fully seated on barbed connectors."
    },
    {
      "title": "Check Flowmeter Orientation and Installation",
      "instructions": "Confirm the flowmeter is upright and properly mounted according to manufacturer guidance. Flowmeters that are tilted or improperly seated can leak or produce noise."
    },
    {
      "title": "Test the Needle Valve and Flow Adjustment Knob",
      "instructions": "Slowly adjust the flow from zero to the prescribed setting. Listen for persistent hissing at full or mid-range flow. A hissing that persists regardless of flow setting may indicate an internal leak."
    },
    {
      "title": "Check for External Obstructions",
      "instructions": "Remove any humidifiers, adapters, or connectors temporarily. Test the flowmeter alone to determine if an accessory is causing the noise or leak."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Flowmeter makes hissing sound and may be leaking oxygen.",
      "Cause": "Observed loose tubing, misaligned connections, and persistent hissing despite proper setup.",
      "Resolution": "Tightened connections and replaced worn tubing. If leak persisted, flowmeter removed from service and labeled Out of Service for repair."
    }
  },
  "helpfulDetails": [
    "Outlet tested for pressure drop",
    "Tubing replaced or swapped",
    "Flow adjustment knob behavior",
    "Location of leak or hissing sound",
    "Final device status: functional after tubing/fittings corrected or sent for repair"
  ]
},
  {
  "title": "AirLife FlowMate Oxygen Flowmeter - No or Low Flow",
  "description": "Troubleshooting guide for situations where the AirLife FlowMate oxygen flowmeter produces no or reduced oxygen flow, focusing on external causes first.",
  "assetType": "Oxygen Flowmeter",
  "manufacturer": "AirLife",
  "model": "FlowMate",
  "url": "guides/airlife-flowmate-no-or-low-flow.html",
  "dateAdded": "2026-02-26",
  "steps": [
    {
      "title": "Verify Oxygen Source",
      "instructions": "Confirm the wall outlet or oxygen cylinder is turned on and has adequate pressure. Reason: A closed or depleted source is the most common cause of no or low flow."
    },
    {
      "title": "Check Supply Pressure",
      "instructions": "Use a wall flow gauge or cylinder pressure gauge to ensure pressure meets manufacturer specifications. Reason: Low source pressure can reduce flow or prevent the flowmeter from operating."
    },
    {
      "title": "Inspect Connections",
      "instructions": "Verify tubing is correctly attached at both the flowmeter inlet and patient interface. Look for kinks, twists, or tight bends in tubing. Reason: Obstructions in the tubing restrict flow."
    },
    {
      "title": "Check Flowmeter Valve / Knob",
      "instructions": "Turn the flow adjustment knob fully off and then back on slowly. Observe if the flow indicator moves. Reason: Knob position or a stuck valve may prevent flow."
    },
    {
      "title": "Inspect Flowmeter Chamber and Indicator",
      "instructions": "Ensure the float (ball or bobbin) moves freely and is not jammed. Clean if necessary following safe external procedures. Reason: A stuck float gives false readings or prevents flow."
    },
    {
      "title": "Test with Alternate Tubing or Outlet",
      "instructions": "Swap the oxygen tubing and/or connect to a different oxygen source. Reason: Confirms whether the issue is with the flowmeter or external supply."
    },
    {
      "title": "Observe for Leaks",
      "instructions": "Listen for hissing around connections. Tighten fittings if loose; do not overtighten plastic fittings. Reason: Leaks reduce or eliminate oxygen delivery."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "User reports “Oxygen flow is low or not present” on the FlowMate flowmeter.",
      "Cause": "Observed low source pressure from wall outlet; tubing kinked at elbow connector; flowmeter float stuck intermittently.",
      "Resolution": "Straightened tubing, verified source pressure, cleaned float chamber, confirmed proper flow. Device returned to service. If unresolved, removed and sent for repair with “Out of Service” label."
    }
  },
  "helpfulDetails": [
    "Outlet pressure reading",
    "Tubing condition",
    "Float movement behavior",
    "Valve/knob position",
    "Audible leaks or hissing",
    "Final functional status"
  ]
}
]
