[
{
  "title": "Getinge Servo-i Ventilator Expiratory Cassette Errors",
  "description": "Guide for troubleshooting expiratory cassette errors on a Servo-i ventilator, focusing on external causes before repair.",
  "assetType": "Ventilator",
  "manufacturer": "Getinge",
  "model": "Servo-i",
  "url": "guides/getinge-servo-i-expiratory-cassette.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure the ventilator is powered off before handling the cassette",
      "instructions": "Safety first: avoid disconnecting tubing or cassettes while the device is active on a patient."
    },
    {
      "title": "Verify expiratory cassette installation",
      "instructions": "Remove and reinstall the expiratory cassette. Listen for the “click” indicating it is fully seated. Misalignment can cause error codes."
    },
    {
      "title": "Inspect cassette and sensors for debris or damage",
      "instructions": "Check for moisture, secretions, or obstructions in the expiratory cassette. Ensure the sensor ports are clean and unobstructed."
    },
    {
      "title": "Check expiratory tubing connections",
      "instructions": "Confirm all patient circuit tubing is securely connected. Ensure there are no kinks, pinches, or leaks that could trigger cassette errors."
    },
    {
      "title": "Run a ventilator self-test",
      "instructions": "After verifying installation and connections, power on the ventilator and initiate a system self-test. Observe whether the expiratory cassette error clears. If the error persists, note the exact error code for escalation."
    },
    {
      "title": "Verify software and calibration status",
      "instructions": "Ensure the ventilator’s software is up to date. Confirm calibration logs do not indicate failed expiratory cassette calibration."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator displays expiratory cassette error code during setup.",
      "Cause": "Cassette was not fully seated; tubing connections were loose.",
      "Resolution": "Reinstalled expiratory cassette, secured tubing connections, ran self-test—device passed and returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested: Yes / No",
    "Tubing checked for leaks or kinks",
    "Sensor ports inspected and cleaned",
    "Error codes recorded",
    "Cassette seating verified",
    "Final device status: Ready for patient use or Out of Service"
  ]
},
  {
  "title": "Getinge Servo-i Ventilator - Flow Sensor or Volume Measurement Errors",
  "description": "Guide for troubleshooting flow sensor errors and tidal volume discrepancies on Getinge Servo-i ventilators, focusing on external causes first.",
  "assetType": "Ventilator",
  "manufacturer": "Getinge",
  "model": "Servo-i",
  "url": "guides/getinge-servo-i-flow-sensor.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Verify Power and Startup Sequence",
      "instructions": "Confirm the ventilator is properly powered and the battery is charged. Check that the ventilator completes its self-test without unexpected alarms. Why: Incomplete self-tests or unstable power can trigger false flow errors."
    },
    {
      "title": "Inspect Patient Circuit Connections",
      "instructions": "Ensure inspiratory and expiratory limbs are correctly connected. Confirm that filters, humidifiers, and heat moisture exchangers (HMEs) are properly seated. Why: Leaks or misaligned tubing can cause erroneous volume readings."
    },
    {
      "title": "Check Flow Sensor (Pneumotach) and Adapter",
      "instructions": "Remove and visually inspect the flow sensor for condensation, debris, or damage. Ensure the sensor is installed in the correct orientation according to the device labeling. Why: Obstructions, moisture, or incorrect installation can trigger measurement errors."
    },
    {
      "title": "Inspect Circuit for Leaks",
      "instructions": "Perform a leak test if the ventilator supports it. Check all connections, including endotracheal tube cuff seal, Y-piece, and filters. Why: Leaks affect tidal volume delivery and flow measurement accuracy."
    },
    {
      "title": "Check Humidification and Condensation",
      "instructions": "Drain excess water from heated circuits or HMEs. Confirm that the flow sensor is dry. Why: Condensation in the sensor or tubing alters flow and volume readings."
    },
    {
      "title": "Swap with Known Good Consumables",
      "instructions": "Replace the flow sensor or adapter with a verified functioning unit. Replace disposable patient circuit if necessary. Why: Confirms whether the error is due to consumable components rather than the ventilator hardware."
    },
    {
      "title": "Verify Settings and Calibration",
      "instructions": "Confirm ventilator mode, tidal volume, and circuit type are correctly configured. Re-run calibration or zeroing procedures as per normal operating procedure. Why: Incorrect configuration can cause alarms for “flow error” or “volume discrepancy.”"
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Ventilator displays “flow sensor error” and delivered tidal volume inconsistent.",
      "Cause": "External inspection revealed condensation in flow sensor and minor leak at Y-piece connection.",
      "Resolution": "Drained condensation, secured connections, replaced disposable sensor and patient circuit, recalibrated ventilator. Verified proper tidal volume delivery."
    }
  },
  "helpfulDetails": [
    "Outlet tested and verified",
    "Power stability checked",
    "Circuit orientation confirmed",
    "Condensation present or absent",
    "Sensor replacement history",
    "Post-troubleshooting tidal volume verification"
  ]
},
  {
  "title": "Getinge Servo-i Ventilator - Fails Pre-Use Check / 'Leak Detected'",
  "description": "Guide for troubleshooting a Getinge Servo-i ventilator that fails pre-use check with a 'Leak Detected' message, focusing on external causes first.",
  "assetType": "Ventilator",
  "manufacturer": "Getinge",
  "model": "Servo-i",
  "url": "guides/getinge-servo-i-fails-pre-use-check.html",
  "dateAdded": "2026-02-24",
  "steps": [
    {
      "title": "Ensure Device Is Powered and Stable",
      "instructions": "Verify the ventilator is plugged into a functional outlet. Check that the battery (if present) is charged and the unit is powered on. Why: Low or unstable power can cause false leak detection."
    },
    {
      "title": "Inspect the Breathing Circuit",
      "instructions": "Ensure all tubing (inspiratory and expiratory limbs) is correctly connected. Confirm that tubing is free of kinks, cracks, or holes. Remove and reconnect tubing to ensure secure connections. Why: Even a small disconnection or crack can trigger a leak alarm."
    },
    {
      "title": "Check the Patient Interface",
      "instructions": "Inspect the endotracheal tube, mask, or other patient connector. Ensure the device is properly attached with no loose connections. Why: Leaks often occur at the interface rather than inside the ventilator."
    },
    {
      "title": "Inspect the Exhalation Valve / Humidifier",
      "instructions": "Remove or check the exhalation valve for proper seating. If a heated humidifier is attached, confirm all connections are tight and tubing is intact. Why: A misaligned valve or humidifier connection can mimic a leak."
    },
    {
      "title": "Verify the Circuit Type Selected in Software",
      "instructions": "Ensure the ventilator software settings match the connected circuit (adult, pediatric, neonatal). Why: Mismatched settings can cause pre-use check failures."
    },
    {
      "title": "Perform a Manual Leak Test",
      "instructions": "Disconnect from the patient. Close the circuit as recommended in the user interface. Run the ventilator’s 'circuit check' or leak test again. Why: Confirms whether the leak is in the patient circuit or the ventilator."
    },
    {
      "title": "Replace Consumable Components if Needed",
      "instructions": "Swap out disposable circuits or valves with known-good units. Why: Consumables are common sources of leaks and are easily replaced without opening the ventilator."
    }
  ],
  "documentation": {
    "CCR": {
      "Complaint": "Pre-use check fails with ‘Leak Detected’ message.",
      "Cause": "Observed loose circuit connection at inspiratory limb. No cracks in tubing, valves seated correctly, no patient connected. Leak persisted after reconnecting.",
      "Resolution": "Replaced disposable breathing circuit with a verified functional circuit. Pre-use check passed successfully. Ventilator returned to service."
    }
  },
  "helpfulDetails": [
    "Outlet tested: ✔",
    "Tubing inspected and swapped: ✔",
    "Exhalation valve checked: ✔",
    "Software circuit type verified: ✔",
    "Leak test results: ✔",
    "Final device status: Functional, returned to service"
  ]
}
]
